ranjithaguna/pv/LED_Demo/source/pic32cx/component/safbc.h
/**
 * \brief Component description for PIC32CX/0525SG12 SAFBC
 *
 * Copyright (c) 2018 Microchip Technology Inc.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description version 2018-04-24T21:15:30Z */
#ifndef _PIC32CX_0525SG12_SAFBC_COMPONENT_H_
#define _PIC32CX_0525SG12_SAFBC_COMPONENT_H_

/** \addtogroup PIC32CX_0525SG12_SAFBC SAF BRIDGE COMPONENT
 *  @{
 */
/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR SAFBC */
/* ========================================================================== */

/* -------- SAFBC_EC_LEN_TAG_CMD : (SAFBC Offset: 0x18) (R/W 32) This register defines the command type and length of transfers requested by EC firmware -------- */

typedef union
{
  struct
  {
    uint32_t EC_PUT_CMD:8;              /**< bit:   0..7  This field must contain the value 0Ah; that is, the eSPI command                       PUT_FLASH_NP. */
    uint32_t EC_CTYPE_CMD:8;            /**< bit:  8..15  This field encodes the operation requested:                       00h = Read                       01h = Write (Page Program)                       02h = Erase                       Other encodings are undefined */
    uint32_t :8;                        /**< bit: 16..23  Reserved                                      */
    uint32_t EC_LENGTH:8;               /**< bit: 24..31  This field contains the Length field for all requests.                       Read or Write: The length in bytes of the data transfer, to or from                       the SRAM buffer. Must be in the range 1 -- 64 (01h -- 40h).                       Erase: Must encode an eSPI-defined Erase Block Size:                       00h = 4K                       01h = 32K                       02h = 64K                       Other encodings are undefined. */
  };
  uint32_t w;
} __SAFBC_EC_LEN_TAG_CMD_bits_t;
#define SAFBC_EC_LEN_TAG_CMD_RESETVALUE     (0x00U)                                       /**<  (SAFBC_EC_LEN_TAG_CMD) This register defines the command type and length of transfers requested by EC firmware  Reset Value */

#define SAFBC_EC_LEN_TAG_CMD_EC_PUT_CMD_Pos   (0)                                            /**< (SAFBC_EC_LEN_TAG_CMD) This field must contain the value 0Ah; that is, the eSPI command                       PUT_FLASH_NP. Position */
#define SAFBC_EC_LEN_TAG_CMD_EC_PUT_CMD_Msk   (0xFFU << SAFBC_EC_LEN_TAG_CMD_EC_PUT_CMD_Pos)  /**< (SAFBC_EC_LEN_TAG_CMD) This field must contain the value 0Ah; that is, the eSPI command                       PUT_FLASH_NP. Mask */
#define SAFBC_EC_LEN_TAG_CMD_EC_PUT_CMD(value) (SAFBC_EC_LEN_TAG_CMD_EC_PUT_CMD_Msk & ((value) << SAFBC_EC_LEN_TAG_CMD_EC_PUT_CMD_Pos))
#define SAFBC_EC_LEN_TAG_CMD_EC_CTYPE_CMD_Pos (8)                                            /**< (SAFBC_EC_LEN_TAG_CMD) This field encodes the operation requested:                       00h = Read                       01h = Write (Page Program)                       02h = Erase                       Other encodings are undefined Position */
#define SAFBC_EC_LEN_TAG_CMD_EC_CTYPE_CMD_Msk (0xFFU << SAFBC_EC_LEN_TAG_CMD_EC_CTYPE_CMD_Pos)  /**< (SAFBC_EC_LEN_TAG_CMD) This field encodes the operation requested:                       00h = Read                       01h = Write (Page Program)                       02h = Erase                       Other encodings are undefined Mask */
#define SAFBC_EC_LEN_TAG_CMD_EC_CTYPE_CMD(value) (SAFBC_EC_LEN_TAG_CMD_EC_CTYPE_CMD_Msk & ((value) << SAFBC_EC_LEN_TAG_CMD_EC_CTYPE_CMD_Pos))
#define SAFBC_EC_LEN_TAG_CMD_EC_LENGTH_Pos    (24)                                           /**< (SAFBC_EC_LEN_TAG_CMD) This field contains the Length field for all requests.                       Read or Write: The length in bytes of the data transfer, to or from                       the SRAM buffer. Must be in the range 1 -- 64 (01h -- 40h).                       Erase: Must encode an eSPI-defined Erase Block Size:                       00h = 4K                       01h = 32K                       02h = 64K                       Other encodings are undefined. Position */
#define SAFBC_EC_LEN_TAG_CMD_EC_LENGTH_Msk    (0xFFU << SAFBC_EC_LEN_TAG_CMD_EC_LENGTH_Pos)  /**< (SAFBC_EC_LEN_TAG_CMD) This field contains the Length field for all requests.                       Read or Write: The length in bytes of the data transfer, to or from                       the SRAM buffer. Must be in the range 1 -- 64 (01h -- 40h).                       Erase: Must encode an eSPI-defined Erase Block Size:                       00h = 4K                       01h = 32K                       02h = 64K                       Other encodings are undefined. Mask */
#define SAFBC_EC_LEN_TAG_CMD_EC_LENGTH(value) (SAFBC_EC_LEN_TAG_CMD_EC_LENGTH_Msk & ((value) << SAFBC_EC_LEN_TAG_CMD_EC_LENGTH_Pos))
#define SAFBC_EC_LEN_TAG_CMD_Msk              (0xFF00FFFFUL)                                 /**< (SAFBC_EC_LEN_TAG_CMD) Register Mask  */

/* -------- SAFBC_EC_FLASH_ADD : (SAFBC Offset: 0x1c) (R/W 32) This register hold the Flash Space address to be accessed by the current command from EC firmware. -------- */

typedef union
{
  struct
  {
    uint32_t FLASH_ADDR:32;             /**< bit:  0..31  FLASH_ADDR: This field holds the Flash address to be accessed. */
  };
  uint32_t w;
} __SAFBC_EC_FLASH_ADD_bits_t;
#define SAFBC_EC_FLASH_ADD_RESETVALUE       (0x00U)                                       /**<  (SAFBC_EC_FLASH_ADD) This register hold the Flash Space address to be accessed by the current command from EC firmware.  Reset Value */

#define SAFBC_EC_FLASH_ADD_FLASH_ADDR_Pos     (0)                                            /**< (SAFBC_EC_FLASH_ADD) FLASH_ADDR: This field holds the Flash address to be accessed. Position */
#define SAFBC_EC_FLASH_ADD_FLASH_ADDR_Msk     (0xFFFFFFFFU << SAFBC_EC_FLASH_ADD_FLASH_ADDR_Pos)  /**< (SAFBC_EC_FLASH_ADD) FLASH_ADDR: This field holds the Flash address to be accessed. Mask */
#define SAFBC_EC_FLASH_ADD_FLASH_ADDR(value)  (SAFBC_EC_FLASH_ADD_FLASH_ADDR_Msk & ((value) << SAFBC_EC_FLASH_ADD_FLASH_ADDR_Pos))
#define SAFBC_EC_FLASH_ADD_Msk                (0xFFFFFFFFUL)                                 /**< (SAFBC_EC_FLASH_ADD) Register Mask  */

