ranjithaguna/pv/LED_Demo/source/pic32cx/component/safbc.h
/* -------- SAFBC_EC_START : (SAFBC Offset: 0x20) (R/W 32) This register contains the Start control for a Flash access requested in the rest of the EC    Portal registers. It triggers the requested transfer. -------- */

typedef union
{
  struct
  {
    uint32_t START:1;                   /**< bit:      0  This bit is written with '1' to start a new request, but always appears                   '0' when being read. Writing '1' to this bit immediately sets the                   EC_BUSY bit to '1' as an acknowledgement that the request is being serviced.                   Writing '1' to the START bit again, while the EC_BUSY bit is                   already '1' will do nothing except to set the START_OVERFLOW                   error status bit to '1' and the request already in service will complete                   normally except for the START_OVERFLOW=1 status indication. */
    uint32_t :31;                       /**< bit:  1..31  Reserved                                      */
  };
  uint32_t w;
} __SAFBC_EC_START_bits_t;
#define SAFBC_EC_START_RESETVALUE           (0x00U)                                       /**<  (SAFBC_EC_START) This register contains the Start control for a Flash access requested in the rest of the EC    Portal registers. It triggers the requested transfer.  Reset Value */

#define SAFBC_EC_START_START_Pos              (0)                                            /**< (SAFBC_EC_START) This bit is written with '1' to start a new request, but always appears                   '0' when being read. Writing '1' to this bit immediately sets the                   EC_BUSY bit to '1' as an acknowledgement that the request is being serviced.                   Writing '1' to the START bit again, while the EC_BUSY bit is                   already '1' will do nothing except to set the START_OVERFLOW                   error status bit to '1' and the request already in service will complete                   normally except for the START_OVERFLOW=1 status indication. Position */
#define SAFBC_EC_START_START_Msk              (0x1U << SAFBC_EC_START_START_Pos)             /**< (SAFBC_EC_START) This bit is written with '1' to start a new request, but always appears                   '0' when being read. Writing '1' to this bit immediately sets the                   EC_BUSY bit to '1' as an acknowledgement that the request is being serviced.                   Writing '1' to the START bit again, while the EC_BUSY bit is                   already '1' will do nothing except to set the START_OVERFLOW                   error status bit to '1' and the request already in service will complete                   normally except for the START_OVERFLOW=1 status indication. Mask */
#define SAFBC_EC_START_Msk                    (0x00000001UL)                                 /**< (SAFBC_EC_START) Register Mask  */

/* -------- SAFBC_EC_AHB_ADD : (SAFBC Offset: 0x24) (R/W 32) This register holds a location in the EC's own address space that is to be used as     the SRAM buffer for an EC Flash access. -------- */

typedef union
{
  struct
  {
    uint32_t :2;                        /**< bit:   0..1  Reserved                                      */
    uint32_t BUF_ADDR:30;               /**< bit:  2..31  This field holds bits [31:2] of the SRAM buffer address.                   Bits[1:0] of the address are fixed at 00. */
  };
  uint32_t w;
} __SAFBC_EC_AHB_ADD_bits_t;
#define SAFBC_EC_AHB_ADD_RESETVALUE         (0x00U)                                       /**<  (SAFBC_EC_AHB_ADD) This register holds a location in the EC's own address space that is to be used as     the SRAM buffer for an EC Flash access.  Reset Value */

#define SAFBC_EC_AHB_ADD_BUF_ADDR_Pos         (2)                                            /**< (SAFBC_EC_AHB_ADD) This field holds bits [31:2] of the SRAM buffer address.                   Bits[1:0] of the address are fixed at 00. Position */
#define SAFBC_EC_AHB_ADD_BUF_ADDR_Msk         (0x3FFFFFFFU << SAFBC_EC_AHB_ADD_BUF_ADDR_Pos)  /**< (SAFBC_EC_AHB_ADD) This field holds bits [31:2] of the SRAM buffer address.                   Bits[1:0] of the address are fixed at 00. Mask */
#define SAFBC_EC_AHB_ADD_BUF_ADDR(value)      (SAFBC_EC_AHB_ADD_BUF_ADDR_Msk & ((value) << SAFBC_EC_AHB_ADD_BUF_ADDR_Pos))
#define SAFBC_EC_AHB_ADD_Msk                  (0xFFFFFFFCUL)                                 /**< (SAFBC_EC_AHB_ADD) Register Mask  */

/* -------- SAFBC_EC_DONE_STATUS : (SAFBC Offset: 0x28) (R/W 32) This register holds the DONE status bit, which indicates when a request is completed     by rising to '1'. It may be used as an interrupt trigger for INTR_FLASH. It may be cleared     at any time after it rises, but must be cleared before issuing the next request. -------- */

typedef union
{
  struct
  {
    uint32_t DONE:1;                    /**< bit:      0  This bit is set to '1' by hardware to indicate the end of a requested access by the EC.        It can be enabled to trigger an interrupt when '1'. Writing a '1' clears this bit and the interrupt source.        This is R/WC. */
    uint32_t DONE_TST:1;                /**< bit:      1  This bit is set to '1' by hardware during a requested access by the EC. It has no usage        except for possible diagnostic purposes, but should be cleared (with the rest of this register)         by writing '1' before starting any new access.        This is R/WC. */
    uint32_t TIMEOUT:1;                 /**< bit:      2  This bit indicates that an Erase or Write request from the EC has failed because the Flash        has timed out. This bit is cleared by writing '1' to its position.        This is R/WC. */
    uint32_t OUT_OF_RANGE:1;            /**< bit:      3  This bit indicates that a request from the EC has been rejected because it is beyond the        physical limits of the attached Flash devices, as declared in the Size Limit and Threshold        Registers. This bit is cleared by writing '1' to its position.        This is R/WC. */
    uint32_t ACCESS_VIOLATION:1;        /**< bit:      4  This bit indicates that a request from the EC has been rejected because it violates the        Protection Register settings. This bit is cleared by writing '1' to its position.        This is R/WC. */
    uint32_t BOUNDARY_4K:1;             /**< bit:      5  This bit indicates that a Read request from the EC has been rejected because it has attempted         to cross a 4K Flash address boundary. This bit is cleared by writing '1' to its position.        This is R/WC. */
    uint32_t ERASE_SIZE:1;              /**< bit:      6  This bit indicates that an invalid Erase Block Size has been specified in an Erase request        from the EC. This error is detected by seeing 00h in the specific Erase Size opcode field. This         bit is cleared by writing '1' to its position.        This is R/WC. */
    uint32_t START_OVERFLOW:1;          /**< bit:      7  This bit indicates that an access was already in progress when a new access was        requested by writing '1' to the START bit. Such a request is ignored except to set this bit.        This bit is cleared by writing '1' to its position.        This is R/WC. */
    uint32_t BAD_REQUEST:1;             /**< bit:      8  This bit indicates that an invalid Request code has been specified in the Portal        Command Register at the time the START bit was set to trigger it.        This bit is cleared by writing '1' to its position.         This is R/WC. */
    uint32_t :23;                       /**< bit:  9..31  Reserved                                      */
  };
  uint32_t w;
} __SAFBC_EC_DONE_STATUS_bits_t;
