ranjithaguna/pv/LED_Demo/source/pic32cx/component/safbc.h
#define SAFBC_EC_DONE_STATUS_RESETVALUE     (0x00U)                                       /**<  (SAFBC_EC_DONE_STATUS) This register holds the DONE status bit, which indicates when a request is completed     by rising to '1'. It may be used as an interrupt trigger for INTR_FLASH. It may be cleared     at any time after it rises, but must be cleared before issuing the next request.  Reset Value */

#define SAFBC_EC_DONE_STATUS_DONE_Pos         (0)                                            /**< (SAFBC_EC_DONE_STATUS) This bit is set to '1' by hardware to indicate the end of a requested access by the EC.        It can be enabled to trigger an interrupt when '1'. Writing a '1' clears this bit and the interrupt source.        This is R/WC. Position */
#define SAFBC_EC_DONE_STATUS_DONE_Msk         (0x1U << SAFBC_EC_DONE_STATUS_DONE_Pos)        /**< (SAFBC_EC_DONE_STATUS) This bit is set to '1' by hardware to indicate the end of a requested access by the EC.        It can be enabled to trigger an interrupt when '1'. Writing a '1' clears this bit and the interrupt source.        This is R/WC. Mask */
#define SAFBC_EC_DONE_STATUS_DONE_TST_Pos     (1)                                            /**< (SAFBC_EC_DONE_STATUS) This bit is set to '1' by hardware during a requested access by the EC. It has no usage        except for possible diagnostic purposes, but should be cleared (with the rest of this register)         by writing '1' before starting any new access.        This is R/WC. Position */
#define SAFBC_EC_DONE_STATUS_DONE_TST_Msk     (0x1U << SAFBC_EC_DONE_STATUS_DONE_TST_Pos)    /**< (SAFBC_EC_DONE_STATUS) This bit is set to '1' by hardware during a requested access by the EC. It has no usage        except for possible diagnostic purposes, but should be cleared (with the rest of this register)         by writing '1' before starting any new access.        This is R/WC. Mask */
#define SAFBC_EC_DONE_STATUS_TIMEOUT_Pos      (2)                                            /**< (SAFBC_EC_DONE_STATUS) This bit indicates that an Erase or Write request from the EC has failed because the Flash        has timed out. This bit is cleared by writing '1' to its position.        This is R/WC. Position */
#define SAFBC_EC_DONE_STATUS_TIMEOUT_Msk      (0x1U << SAFBC_EC_DONE_STATUS_TIMEOUT_Pos)     /**< (SAFBC_EC_DONE_STATUS) This bit indicates that an Erase or Write request from the EC has failed because the Flash        has timed out. This bit is cleared by writing '1' to its position.        This is R/WC. Mask */
#define SAFBC_EC_DONE_STATUS_OUT_OF_RANGE_Pos (3)                                            /**< (SAFBC_EC_DONE_STATUS) This bit indicates that a request from the EC has been rejected because it is beyond the        physical limits of the attached Flash devices, as declared in the Size Limit and Threshold        Registers. This bit is cleared by writing '1' to its position.        This is R/WC. Position */
#define SAFBC_EC_DONE_STATUS_OUT_OF_RANGE_Msk (0x1U << SAFBC_EC_DONE_STATUS_OUT_OF_RANGE_Pos)  /**< (SAFBC_EC_DONE_STATUS) This bit indicates that a request from the EC has been rejected because it is beyond the        physical limits of the attached Flash devices, as declared in the Size Limit and Threshold        Registers. This bit is cleared by writing '1' to its position.        This is R/WC. Mask */
#define SAFBC_EC_DONE_STATUS_ACCESS_VIOLATION_Pos (4)                                            /**< (SAFBC_EC_DONE_STATUS) This bit indicates that a request from the EC has been rejected because it violates the        Protection Register settings. This bit is cleared by writing '1' to its position.        This is R/WC. Position */
#define SAFBC_EC_DONE_STATUS_ACCESS_VIOLATION_Msk (0x1U << SAFBC_EC_DONE_STATUS_ACCESS_VIOLATION_Pos)  /**< (SAFBC_EC_DONE_STATUS) This bit indicates that a request from the EC has been rejected because it violates the        Protection Register settings. This bit is cleared by writing '1' to its position.        This is R/WC. Mask */
#define SAFBC_EC_DONE_STATUS_BOUNDARY_4K_Pos  (5)                                            /**< (SAFBC_EC_DONE_STATUS) This bit indicates that a Read request from the EC has been rejected because it has attempted         to cross a 4K Flash address boundary. This bit is cleared by writing '1' to its position.        This is R/WC. Position */
#define SAFBC_EC_DONE_STATUS_BOUNDARY_4K_Msk  (0x1U << SAFBC_EC_DONE_STATUS_BOUNDARY_4K_Pos)  /**< (SAFBC_EC_DONE_STATUS) This bit indicates that a Read request from the EC has been rejected because it has attempted         to cross a 4K Flash address boundary. This bit is cleared by writing '1' to its position.        This is R/WC. Mask */
#define SAFBC_EC_DONE_STATUS_ERASE_SIZE_Pos   (6)                                            /**< (SAFBC_EC_DONE_STATUS) This bit indicates that an invalid Erase Block Size has been specified in an Erase request        from the EC. This error is detected by seeing 00h in the specific Erase Size opcode field. This         bit is cleared by writing '1' to its position.        This is R/WC. Position */
#define SAFBC_EC_DONE_STATUS_ERASE_SIZE_Msk   (0x1U << SAFBC_EC_DONE_STATUS_ERASE_SIZE_Pos)  /**< (SAFBC_EC_DONE_STATUS) This bit indicates that an invalid Erase Block Size has been specified in an Erase request        from the EC. This error is detected by seeing 00h in the specific Erase Size opcode field. This         bit is cleared by writing '1' to its position.        This is R/WC. Mask */
#define SAFBC_EC_DONE_STATUS_START_OVERFLOW_Pos (7)                                            /**< (SAFBC_EC_DONE_STATUS) This bit indicates that an access was already in progress when a new access was        requested by writing '1' to the START bit. Such a request is ignored except to set this bit.        This bit is cleared by writing '1' to its position.        This is R/WC. Position */
#define SAFBC_EC_DONE_STATUS_START_OVERFLOW_Msk (0x1U << SAFBC_EC_DONE_STATUS_START_OVERFLOW_Pos)  /**< (SAFBC_EC_DONE_STATUS) This bit indicates that an access was already in progress when a new access was        requested by writing '1' to the START bit. Such a request is ignored except to set this bit.        This bit is cleared by writing '1' to its position.        This is R/WC. Mask */
#define SAFBC_EC_DONE_STATUS_BAD_REQUEST_Pos  (8)                                            /**< (SAFBC_EC_DONE_STATUS) This bit indicates that an invalid Request code has been specified in the Portal        Command Register at the time the START bit was set to trigger it.        This bit is cleared by writing '1' to its position.         This is R/WC. Position */
#define SAFBC_EC_DONE_STATUS_BAD_REQUEST_Msk  (0x1U << SAFBC_EC_DONE_STATUS_BAD_REQUEST_Pos)  /**< (SAFBC_EC_DONE_STATUS) This bit indicates that an invalid Request code has been specified in the Portal        Command Register at the time the START bit was set to trigger it.        This bit is cleared by writing '1' to its position.         This is R/WC. Mask */
#define SAFBC_EC_DONE_STATUS_Msk              (0x000001FFUL)                                 /**< (SAFBC_EC_DONE_STATUS) Register Mask  */

/* -------- SAFBC_EC_EN : (SAFBC Offset: 0x2c) (R/W 32) This register contains the one bit DONE_EN in bit position[0]. This bit enables the DONE bit in     the status register to trigger an interrupt. -------- */

typedef union
{
  struct
  {
    uint32_t DONE_EN:1;                 /**< bit:      0  This bit enables interrupts from the DONE bit in the Status register.         1 = Enabled         0 = Disabled */
    uint32_t :31;                       /**< bit:  1..31  Reserved                                      */
  };
  uint32_t w;
} __SAFBC_EC_EN_bits_t;
#define SAFBC_EC_EN_RESETVALUE              (0x00U)                                       /**<  (SAFBC_EC_EN) This register contains the one bit DONE_EN in bit position[0]. This bit enables the DONE bit in     the status register to trigger an interrupt.  Reset Value */

#define SAFBC_EC_EN_DONE_EN_Pos               (0)                                            /**< (SAFBC_EC_EN) This bit enables interrupts from the DONE bit in the Status register.         1 = Enabled         0 = Disabled Position */
#define SAFBC_EC_EN_DONE_EN_Msk               (0x1U << SAFBC_EC_EN_DONE_EN_Pos)              /**< (SAFBC_EC_EN) This bit enables interrupts from the DONE bit in the Status register.         1 = Enabled         0 = Disabled Mask */
#define SAFBC_EC_EN_Msk                       (0x00000001UL)                                 /**< (SAFBC_EC_EN) Register Mask  */

