ranjithaguna/pv/LED_Demo/source/pic32cx/component/safbc.h
/* -------- SAFBC_CONFIG_SIZE : (SAFBC Offset: 0x30) (R/W 32) This register declares the address of the final byte of the Flash space implemented in the    physically present Flash device or devices. -------- */

typedef union
{
  struct
  {
    uint32_t LIMIT:32;                  /**< bit:  0..31  This register declares the address of the final byte of the Flash space implemented in the    physically present Flash device or devices. */
  };
  uint32_t w;
} __SAFBC_CONFIG_SIZE_bits_t;
#define SAFBC_CONFIG_SIZE_RESETVALUE        (0x00U)                                       /**<  (SAFBC_CONFIG_SIZE) This register declares the address of the final byte of the Flash space implemented in the    physically present Flash device or devices.  Reset Value */

#define SAFBC_CONFIG_SIZE_LIMIT_Pos           (0)                                            /**< (SAFBC_CONFIG_SIZE) This register declares the address of the final byte of the Flash space implemented in the    physically present Flash device or devices. Position */
#define SAFBC_CONFIG_SIZE_LIMIT_Msk           (0xFFFFFFFFU << SAFBC_CONFIG_SIZE_LIMIT_Pos)   /**< (SAFBC_CONFIG_SIZE) This register declares the address of the final byte of the Flash space implemented in the    physically present Flash device or devices. Mask */
#define SAFBC_CONFIG_SIZE_LIMIT(value)        (SAFBC_CONFIG_SIZE_LIMIT_Msk & ((value) << SAFBC_CONFIG_SIZE_LIMIT_Pos))
#define SAFBC_CONFIG_SIZE_Msk                 (0xFFFFFFFFUL)                                 /**< (SAFBC_CONFIG_SIZE) Register Mask  */

/* -------- SAFBC_CONFIG_TH : (SAFBC Offset: 0x34) (R/W 32) This register declares whether there are two Flash devices, and if so, where the boundary is     between the devices. -------- */

typedef union
{
  struct
  {
    uint32_t THRESHOLD:32;              /**< bit:  0..31  The address placed in this register is the address of the first byte of the second Flash         device. If there is only one Flash device, then this register must contain a value greater than         the Size Limit register above. */
  };
  uint32_t w;
} __SAFBC_CONFIG_TH_bits_t;
#define SAFBC_CONFIG_TH_RESETVALUE          (0x00U)                                       /**<  (SAFBC_CONFIG_TH) This register declares whether there are two Flash devices, and if so, where the boundary is     between the devices.  Reset Value */

#define SAFBC_CONFIG_TH_THRESHOLD_Pos         (0)                                            /**< (SAFBC_CONFIG_TH) The address placed in this register is the address of the first byte of the second Flash         device. If there is only one Flash device, then this register must contain a value greater than         the Size Limit register above. Position */
#define SAFBC_CONFIG_TH_THRESHOLD_Msk         (0xFFFFFFFFU << SAFBC_CONFIG_TH_THRESHOLD_Pos)  /**< (SAFBC_CONFIG_TH) The address placed in this register is the address of the first byte of the second Flash         device. If there is only one Flash device, then this register must contain a value greater than         the Size Limit register above. Mask */
#define SAFBC_CONFIG_TH_THRESHOLD(value)      (SAFBC_CONFIG_TH_THRESHOLD_Msk & ((value) << SAFBC_CONFIG_TH_THRESHOLD_Pos))
#define SAFBC_CONFIG_TH_Msk                   (0xFFFFFFFFUL)                                 /**< (SAFBC_CONFIG_TH) Register Mask  */

/* -------- SAFBC_CONFIG_MISC : (SAFBC Offset: 0x38) (R/W 32) Bits[7:6] (PREFIX) declare the need for some Flash devices (notably Micron) to be given an     explicit command to enter Continuous Mode, as opposed to requiring only Mode bits in the first     Read access. -------- */

typedef union
{
  struct
  {
    uint32_t PREFETCH_OPT_EN:2;         /**< bit:   0..1  Selects optimized data prefetching from the Flash devices to the eSPI Master. This field has no        effect unless the PREFETCH_EN bit is also '1'         00= Prefetched data from Flash is delivered using canonical eSPI methods. (Default)        11= Prefetched data from Flash is delivered using expedited eSPI methods.        01,10= (Reserved) */
    uint32_t :2;                        /**< bit:   2..3  Reserved                                      */
    uint32_t CS0_4BYTE_ADDR_MODE:1;     /**< bit:      4  Declares whether the Flash device on CS0# uses a 32-bit address. Set this bit to '1' if the Flash         device is 32Mbytes (256MBits) or greater. This bit does not cause the Flash device itself to be placed         into 4-byte address mode; that must be done by EC firmware before enabling SAFS operation.         0=Issue 3-byte addresses to the CS0# Flash device.         1=Issue 4-byte addresses to the CS0# Flash device. */
    uint32_t CS1_4BYTE_ADDR_MODE:1;     /**< bit:      5  Declares whether the Flash device on CS1# uses a 32-bit address. Set this bit to '1' if the Flash         device is 32Mbytes (256MBits) or greater. This bit does not cause the Flash device itself to be placed         into 4-byte address mode; that must be done by EC firmware before enabling SAFS operation.         0=Issue 3-byte addresses to the CS1# Flash device.         1=Issue 4-byte addresses to the CS1# Flash device. */
    uint32_t CS0_CONT_PREFIX_EN:1;      /**< bit:      6  Declares whether the Flash device on CS0# requires a prefix command to enter Continuous Mode.         0=No prefix command is required by the Flash device on CS0#.         1=A Prefix command will be issued from the CS0 fields of the SAF Flash Configuration Special Mode Register         to the Flash device on CS0# before entry into Continuous Mode. */
    uint32_t CS1_CONT_PREFIX_EN:1;      /**< bit:      7  Declares whether the Flash device on CS1# (if any) requires a prefix command to enter Continuous Mode.         0=No prefix command is required by the Flash device on CS1#.         1=A Prefix command will be issued from the CS1 fields of the SAF Flash Configuration Special Mode Register         to the Flash device on CS1# before entry into Continuous Mode. */
    uint32_t :4;                        /**< bit:  8..11  Reserved                                      */
    uint32_t SAF_MODE_ENABLE:1;         /**< bit:     12  0=SAFS Mode operation is globally disabled.               1=SAFS Mode operation is globally enabled. The Captive QMSPI Block register set and       the SAF Communication register set also become inaccessible to EC firmware. */
    uint32_t SAF_MODE_LOCK:1;           /**< bit:     13  0=The SAF Bridge register sets are unlocked and available R/W to EC firmware.               1=The SAF Bridge register sets Device Configuration and Device Timing, including this                register, are locked read-only to EC firmware. */
    uint32_t :18;                       /**< bit: 14..31  Reserved                                      */
  };
  uint32_t w;
} __SAFBC_CONFIG_MISC_bits_t;
#define SAFBC_CONFIG_MISC_RESETVALUE        (0x00U)                                       /**<  (SAFBC_CONFIG_MISC) Bits[7:6] (PREFIX) declare the need for some Flash devices (notably Micron) to be given an     explicit command to enter Continuous Mode, as opposed to requiring only Mode bits in the first     Read access.  Reset Value */

#define SAFBC_CONFIG_MISC_PREFETCH_OPT_EN_Pos (0)                                            /**< (SAFBC_CONFIG_MISC) Selects optimized data prefetching from the Flash devices to the eSPI Master. This field has no        effect unless the PREFETCH_EN bit is also '1'         00= Prefetched data from Flash is delivered using canonical eSPI methods. (Default)        11= Prefetched data from Flash is delivered using expedited eSPI methods.        01,10= (Reserved) Position */
#define SAFBC_CONFIG_MISC_PREFETCH_OPT_EN_Msk (0x3U << SAFBC_CONFIG_MISC_PREFETCH_OPT_EN_Pos)  /**< (SAFBC_CONFIG_MISC) Selects optimized data prefetching from the Flash devices to the eSPI Master. This field has no        effect unless the PREFETCH_EN bit is also '1'         00= Prefetched data from Flash is delivered using canonical eSPI methods. (Default)        11= Prefetched data from Flash is delivered using expedited eSPI methods.        01,10= (Reserved) Mask */
#define SAFBC_CONFIG_MISC_PREFETCH_OPT_EN(value) (SAFBC_CONFIG_MISC_PREFETCH_OPT_EN_Msk & ((value) << SAFBC_CONFIG_MISC_PREFETCH_OPT_EN_Pos))
#define SAFBC_CONFIG_MISC_CS0_4BYTE_ADDR_MODE_Pos (4)                                            /**< (SAFBC_CONFIG_MISC) Declares whether the Flash device on CS0# uses a 32-bit address. Set this bit to '1' if the Flash         device is 32Mbytes (256MBits) or greater. This bit does not cause the Flash device itself to be placed         into 4-byte address mode; that must be done by EC firmware before enabling SAFS operation.         0=Issue 3-byte addresses to the CS0# Flash device.         1=Issue 4-byte addresses to the CS0# Flash device. Position */
#define SAFBC_CONFIG_MISC_CS0_4BYTE_ADDR_MODE_Msk (0x1U << SAFBC_CONFIG_MISC_CS0_4BYTE_ADDR_MODE_Pos)  /**< (SAFBC_CONFIG_MISC) Declares whether the Flash device on CS0# uses a 32-bit address. Set this bit to '1' if the Flash         device is 32Mbytes (256MBits) or greater. This bit does not cause the Flash device itself to be placed         into 4-byte address mode; that must be done by EC firmware before enabling SAFS operation.         0=Issue 3-byte addresses to the CS0# Flash device.         1=Issue 4-byte addresses to the CS0# Flash device. Mask */
#define SAFBC_CONFIG_MISC_CS1_4BYTE_ADDR_MODE_Pos (5)                                            /**< (SAFBC_CONFIG_MISC) Declares whether the Flash device on CS1# uses a 32-bit address. Set this bit to '1' if the Flash         device is 32Mbytes (256MBits) or greater. This bit does not cause the Flash device itself to be placed         into 4-byte address mode; that must be done by EC firmware before enabling SAFS operation.         0=Issue 3-byte addresses to the CS1# Flash device.         1=Issue 4-byte addresses to the CS1# Flash device. Position */
#define SAFBC_CONFIG_MISC_CS1_4BYTE_ADDR_MODE_Msk (0x1U << SAFBC_CONFIG_MISC_CS1_4BYTE_ADDR_MODE_Pos)  /**< (SAFBC_CONFIG_MISC) Declares whether the Flash device on CS1# uses a 32-bit address. Set this bit to '1' if the Flash         device is 32Mbytes (256MBits) or greater. This bit does not cause the Flash device itself to be placed         into 4-byte address mode; that must be done by EC firmware before enabling SAFS operation.         0=Issue 3-byte addresses to the CS1# Flash device.         1=Issue 4-byte addresses to the CS1# Flash device. Mask */
#define SAFBC_CONFIG_MISC_CS0_CONT_PREFIX_EN_Pos (6)                                            /**< (SAFBC_CONFIG_MISC) Declares whether the Flash device on CS0# requires a prefix command to enter Continuous Mode.         0=No prefix command is required by the Flash device on CS0#.         1=A Prefix command will be issued from the CS0 fields of the SAF Flash Configuration Special Mode Register         to the Flash device on CS0# before entry into Continuous Mode. Position */
#define SAFBC_CONFIG_MISC_CS0_CONT_PREFIX_EN_Msk (0x1U << SAFBC_CONFIG_MISC_CS0_CONT_PREFIX_EN_Pos)  /**< (SAFBC_CONFIG_MISC) Declares whether the Flash device on CS0# requires a prefix command to enter Continuous Mode.         0=No prefix command is required by the Flash device on CS0#.         1=A Prefix command will be issued from the CS0 fields of the SAF Flash Configuration Special Mode Register         to the Flash device on CS0# before entry into Continuous Mode. Mask */
#define SAFBC_CONFIG_MISC_CS1_CONT_PREFIX_EN_Pos (7)                                            /**< (SAFBC_CONFIG_MISC) Declares whether the Flash device on CS1# (if any) requires a prefix command to enter Continuous Mode.         0=No prefix command is required by the Flash device on CS1#.         1=A Prefix command will be issued from the CS1 fields of the SAF Flash Configuration Special Mode Register         to the Flash device on CS1# before entry into Continuous Mode. Position */
#define SAFBC_CONFIG_MISC_CS1_CONT_PREFIX_EN_Msk (0x1U << SAFBC_CONFIG_MISC_CS1_CONT_PREFIX_EN_Pos)  /**< (SAFBC_CONFIG_MISC) Declares whether the Flash device on CS1# (if any) requires a prefix command to enter Continuous Mode.         0=No prefix command is required by the Flash device on CS1#.         1=A Prefix command will be issued from the CS1 fields of the SAF Flash Configuration Special Mode Register         to the Flash device on CS1# before entry into Continuous Mode. Mask */
#define SAFBC_CONFIG_MISC_SAF_MODE_ENABLE_Pos (12)                                           /**< (SAFBC_CONFIG_MISC) 0=SAFS Mode operation is globally disabled.               1=SAFS Mode operation is globally enabled. The Captive QMSPI Block register set and       the SAF Communication register set also become inaccessible to EC firmware. Position */
#define SAFBC_CONFIG_MISC_SAF_MODE_ENABLE_Msk (0x1U << SAFBC_CONFIG_MISC_SAF_MODE_ENABLE_Pos)  /**< (SAFBC_CONFIG_MISC) 0=SAFS Mode operation is globally disabled.               1=SAFS Mode operation is globally enabled. The Captive QMSPI Block register set and       the SAF Communication register set also become inaccessible to EC firmware. Mask */
#define SAFBC_CONFIG_MISC_SAF_MODE_LOCK_Pos   (13)                                           /**< (SAFBC_CONFIG_MISC) 0=The SAF Bridge register sets are unlocked and available R/W to EC firmware.               1=The SAF Bridge register sets Device Configuration and Device Timing, including this                register, are locked read-only to EC firmware. Position */
#define SAFBC_CONFIG_MISC_SAF_MODE_LOCK_Msk   (0x1U << SAFBC_CONFIG_MISC_SAF_MODE_LOCK_Pos)  /**< (SAFBC_CONFIG_MISC) 0=The SAF Bridge register sets are unlocked and available R/W to EC firmware.               1=The SAF Bridge register sets Device Configuration and Device Timing, including this                register, are locked read-only to EC firmware. Mask */
#define SAFBC_CONFIG_MISC_Msk                 (0x000030F3UL)                                 /**< (SAFBC_CONFIG_MISC) Register Mask  */

/* -------- SAFBC_ESPI_ERRINTR_STAT : (SAFBC Offset: 0x3c) (R/W 32) These bits may be individually enabled to trigger interrupts using the corresponding        Interrupt Enable register. -------- */

typedef union
{
  struct
  {
    uint32_t TIMEOUT:1;                 /**< bit:      0  This bit indicates that an Erase or Write request from the Host Chipset has failed               because the Flash has timed out. This bit is cleared by writing '1' to its position.        This is R/WC. */
    uint32_t OUT_OF_RANGE:1;            /**< bit:      1  This bit indicates that a request from the Host Chipset has been rejected because        it is beyond the physical limits of the attached Flash devices. This bit is cleared by        writing '1' to its position.        This is R/WC. */
    uint32_t ACCESS_VIOLATION:1;        /**< bit:      2  This bit indicates that a request from the Host Chipset has been rejected because        it violates the Protection Register settings. This bit is cleared by writing '1' to its        position.        This is R/WC. */
    uint32_t BOUNDARY_4K:1;             /**< bit:      3  This bit indicates that a Read request from the Host Chipset has been rejected        because it has attempted to cross a 4K Flash address boundary. This bit is cleared by        writing '1' to its position.        This is R/WC. */
    uint32_t ERASE_SIZE:1;              /**< bit:      4  This bit indicates that an invalid Erase Block Size has been specified in        an Erase request from the Host Chipset. This bit is cleared by writing '1' to its position.        This is R/WC. */
    uint32_t :27;                       /**< bit:  5..31  Reserved                                      */
  };
  uint32_t w;
} __SAFBC_ESPI_ERRINTR_STAT_bits_t;
#define SAFBC_ESPI_ERRINTR_STAT_RESETVALUE  (0x00U)                                       /**<  (SAFBC_ESPI_ERRINTR_STAT) These bits may be individually enabled to trigger interrupts using the corresponding        Interrupt Enable register.  Reset Value */

