ranjithaguna/pv/LED_Demo/source/pic32cx/component/safbc.h
#define SAFBC_ESPI_ERRINTR_STAT_TIMEOUT_Pos   (0)                                            /**< (SAFBC_ESPI_ERRINTR_STAT) This bit indicates that an Erase or Write request from the Host Chipset has failed               because the Flash has timed out. This bit is cleared by writing '1' to its position.        This is R/WC. Position */
#define SAFBC_ESPI_ERRINTR_STAT_TIMEOUT_Msk   (0x1U << SAFBC_ESPI_ERRINTR_STAT_TIMEOUT_Pos)  /**< (SAFBC_ESPI_ERRINTR_STAT) This bit indicates that an Erase or Write request from the Host Chipset has failed               because the Flash has timed out. This bit is cleared by writing '1' to its position.        This is R/WC. Mask */
#define SAFBC_ESPI_ERRINTR_STAT_OUT_OF_RANGE_Pos (1)                                            /**< (SAFBC_ESPI_ERRINTR_STAT) This bit indicates that a request from the Host Chipset has been rejected because        it is beyond the physical limits of the attached Flash devices. This bit is cleared by        writing '1' to its position.        This is R/WC. Position */
#define SAFBC_ESPI_ERRINTR_STAT_OUT_OF_RANGE_Msk (0x1U << SAFBC_ESPI_ERRINTR_STAT_OUT_OF_RANGE_Pos)  /**< (SAFBC_ESPI_ERRINTR_STAT) This bit indicates that a request from the Host Chipset has been rejected because        it is beyond the physical limits of the attached Flash devices. This bit is cleared by        writing '1' to its position.        This is R/WC. Mask */
#define SAFBC_ESPI_ERRINTR_STAT_ACCESS_VIOLATION_Pos (2)                                            /**< (SAFBC_ESPI_ERRINTR_STAT) This bit indicates that a request from the Host Chipset has been rejected because        it violates the Protection Register settings. This bit is cleared by writing '1' to its        position.        This is R/WC. Position */
#define SAFBC_ESPI_ERRINTR_STAT_ACCESS_VIOLATION_Msk (0x1U << SAFBC_ESPI_ERRINTR_STAT_ACCESS_VIOLATION_Pos)  /**< (SAFBC_ESPI_ERRINTR_STAT) This bit indicates that a request from the Host Chipset has been rejected because        it violates the Protection Register settings. This bit is cleared by writing '1' to its        position.        This is R/WC. Mask */
#define SAFBC_ESPI_ERRINTR_STAT_BOUNDARY_4K_Pos (3)                                            /**< (SAFBC_ESPI_ERRINTR_STAT) This bit indicates that a Read request from the Host Chipset has been rejected        because it has attempted to cross a 4K Flash address boundary. This bit is cleared by        writing '1' to its position.        This is R/WC. Position */
#define SAFBC_ESPI_ERRINTR_STAT_BOUNDARY_4K_Msk (0x1U << SAFBC_ESPI_ERRINTR_STAT_BOUNDARY_4K_Pos)  /**< (SAFBC_ESPI_ERRINTR_STAT) This bit indicates that a Read request from the Host Chipset has been rejected        because it has attempted to cross a 4K Flash address boundary. This bit is cleared by        writing '1' to its position.        This is R/WC. Mask */
#define SAFBC_ESPI_ERRINTR_STAT_ERASE_SIZE_Pos (4)                                            /**< (SAFBC_ESPI_ERRINTR_STAT) This bit indicates that an invalid Erase Block Size has been specified in        an Erase request from the Host Chipset. This bit is cleared by writing '1' to its position.        This is R/WC. Position */
#define SAFBC_ESPI_ERRINTR_STAT_ERASE_SIZE_Msk (0x1U << SAFBC_ESPI_ERRINTR_STAT_ERASE_SIZE_Pos)  /**< (SAFBC_ESPI_ERRINTR_STAT) This bit indicates that an invalid Erase Block Size has been specified in        an Erase request from the Host Chipset. This bit is cleared by writing '1' to its position.        This is R/WC. Mask */
#define SAFBC_ESPI_ERRINTR_STAT_Msk           (0x0000001FUL)                                 /**< (SAFBC_ESPI_ERRINTR_STAT) Register Mask  */

/* -------- SAFBC_ESPI_ERRINT_EN : (SAFBC Offset: 0x40) (R/W 32) These bits individually enable the bits in SAF eSPI Monitor Status Register  to trigger    interrupts to the EC firmware. -------- */

typedef union
{
  struct
  {
    uint32_t TIMEOUT_EN:1;              /**< bit:      0  This bit enables the TIMEOUT status bit as an interrupt. */
    uint32_t OUT_OF_RANGE_EN:1;         /**< bit:      1  This bit enables the OUT_OF_RANGE status bit as an interrupt. */
    uint32_t ACCESS_VIOLATION_EN:1;     /**< bit:      2  This bit enables the ACCESS_VIOLATION status bit as an interrupt. */
    uint32_t BOUNDARY_4K_EN:1;          /**< bit:      3  This bit enables the 4K_BOUNDARY status bit as an interrupt. */
    uint32_t ERASE_SIZE_EN:1;           /**< bit:      4  This bit enables the ERASE_SIZE status bit as an interrupt. */
    uint32_t :27;                       /**< bit:  5..31  Reserved                                      */
  };
  uint32_t w;
} __SAFBC_ESPI_ERRINT_EN_bits_t;
#define SAFBC_ESPI_ERRINT_EN_RESETVALUE     (0x00U)                                       /**<  (SAFBC_ESPI_ERRINT_EN) These bits individually enable the bits in SAF eSPI Monitor Status Register  to trigger    interrupts to the EC firmware.  Reset Value */

#define SAFBC_ESPI_ERRINT_EN_TIMEOUT_EN_Pos   (0)                                            /**< (SAFBC_ESPI_ERRINT_EN) This bit enables the TIMEOUT status bit as an interrupt. Position */
#define SAFBC_ESPI_ERRINT_EN_TIMEOUT_EN_Msk   (0x1U << SAFBC_ESPI_ERRINT_EN_TIMEOUT_EN_Pos)  /**< (SAFBC_ESPI_ERRINT_EN) This bit enables the TIMEOUT status bit as an interrupt. Mask */
#define SAFBC_ESPI_ERRINT_EN_OUT_OF_RANGE_EN_Pos (1)                                            /**< (SAFBC_ESPI_ERRINT_EN) This bit enables the OUT_OF_RANGE status bit as an interrupt. Position */
#define SAFBC_ESPI_ERRINT_EN_OUT_OF_RANGE_EN_Msk (0x1U << SAFBC_ESPI_ERRINT_EN_OUT_OF_RANGE_EN_Pos)  /**< (SAFBC_ESPI_ERRINT_EN) This bit enables the OUT_OF_RANGE status bit as an interrupt. Mask */
#define SAFBC_ESPI_ERRINT_EN_ACCESS_VIOLATION_EN_Pos (2)                                            /**< (SAFBC_ESPI_ERRINT_EN) This bit enables the ACCESS_VIOLATION status bit as an interrupt. Position */
#define SAFBC_ESPI_ERRINT_EN_ACCESS_VIOLATION_EN_Msk (0x1U << SAFBC_ESPI_ERRINT_EN_ACCESS_VIOLATION_EN_Pos)  /**< (SAFBC_ESPI_ERRINT_EN) This bit enables the ACCESS_VIOLATION status bit as an interrupt. Mask */
#define SAFBC_ESPI_ERRINT_EN_BOUNDARY_4K_EN_Pos (3)                                            /**< (SAFBC_ESPI_ERRINT_EN) This bit enables the 4K_BOUNDARY status bit as an interrupt. Position */
#define SAFBC_ESPI_ERRINT_EN_BOUNDARY_4K_EN_Msk (0x1U << SAFBC_ESPI_ERRINT_EN_BOUNDARY_4K_EN_Pos)  /**< (SAFBC_ESPI_ERRINT_EN) This bit enables the 4K_BOUNDARY status bit as an interrupt. Mask */
#define SAFBC_ESPI_ERRINT_EN_ERASE_SIZE_EN_Pos (4)                                            /**< (SAFBC_ESPI_ERRINT_EN) This bit enables the ERASE_SIZE status bit as an interrupt. Position */
#define SAFBC_ESPI_ERRINT_EN_ERASE_SIZE_EN_Msk (0x1U << SAFBC_ESPI_ERRINT_EN_ERASE_SIZE_EN_Pos)  /**< (SAFBC_ESPI_ERRINT_EN) This bit enables the ERASE_SIZE status bit as an interrupt. Mask */
#define SAFBC_ESPI_ERRINT_EN_Msk              (0x0000001FUL)                                 /**< (SAFBC_ESPI_ERRINT_EN) Register Mask  */

/* -------- SAFBC_EC_BUSY_REG : (SAFBC Offset: 0x44) (R/W 32) This register holds the EC_BUSY status bit, which indicates when the EC Portal    is busy performing an access. -------- */

typedef union
{
  struct
  {
    uint32_t EC_BUSY:1;                 /**< bit:      0  This Read-Only bit is set to '1' by hardware when the START bit is written with        '1' to start a new request. It is cleared to '0' when request completes, and its        falling edge sets the DONE bit. While this bit is '1', the EC Portal Command, Flash        Address and Buffer Address registers are locked Read-Only, and the START bit is disabled,        causing it only to set the START_OVERFLOW error status bit to '1'. */
    uint32_t :31;                       /**< bit:  1..31  Reserved                                      */
  };
  uint32_t w;
} __SAFBC_EC_BUSY_REG_bits_t;
#define SAFBC_EC_BUSY_REG_RESETVALUE        (0x00U)                                       /**<  (SAFBC_EC_BUSY_REG) This register holds the EC_BUSY status bit, which indicates when the EC Portal    is busy performing an access.  Reset Value */

#define SAFBC_EC_BUSY_REG_EC_BUSY_Pos         (0)                                            /**< (SAFBC_EC_BUSY_REG) This Read-Only bit is set to '1' by hardware when the START bit is written with        '1' to start a new request. It is cleared to '0' when request completes, and its        falling edge sets the DONE bit. While this bit is '1', the EC Portal Command, Flash        Address and Buffer Address registers are locked Read-Only, and the START bit is disabled,        causing it only to set the START_OVERFLOW error status bit to '1'. Position */
#define SAFBC_EC_BUSY_REG_EC_BUSY_Msk         (0x1U << SAFBC_EC_BUSY_REG_EC_BUSY_Pos)        /**< (SAFBC_EC_BUSY_REG) This Read-Only bit is set to '1' by hardware when the START bit is written with        '1' to start a new request. It is cleared to '0' when request completes, and its        falling edge sets the DONE bit. While this bit is '1', the EC Portal Command, Flash        Address and Buffer Address registers are locked Read-Only, and the START bit is disabled,        causing it only to set the START_OVERFLOW error status bit to '1'. Mask */
#define SAFBC_EC_BUSY_REG_Msk                 (0x00000001UL)                                 /**< (SAFBC_EC_BUSY_REG) Register Mask  */

/* -------- SAFBC_CNFG_CS0_OPCODEA : (SAFBC Offset: 0x4c) (R/W 32) There are two Opcode A registers, one associated with each of the Flashes. If the CS1     Flash does not exist, its register can be left in its default state. The four fields in each     register represent the 8-bit Flash opcodes for Write Enable, Suspend, Resume and Read Status     Register. The Status Register referred to is the register inside the Flash which contains the     (BUSY) or (IN PROGRESS) status bit in position 0. -------- */

typedef union
{
  struct
  {
    uint32_t OP_WE:8;                   /**< bit:   0..7  This field contains the 8-bit Opcode for Write Enable in the respective Flash device. */
    uint32_t OP_SUS:8;                  /**< bit:  8..15  This field contains the 8-bit Opcode for Suspend in the respective Flash device. */
    uint32_t OP_RSM:8;                  /**< bit: 16..23  This field contains the 8-bit Opcode for Resume in the respective Flash device. */
    uint32_t OP_POLL1:8;                /**< bit: 24..31  This field contains the 8-bit Opcode for Read Status Register in the respective Flash       device. */
  };
  uint32_t w;
} __SAFBC_CNFG_CS0_OPCODEA_bits_t;
#define SAFBC_CNFG_CS0_OPCODEA_RESETVALUE   (0x00U)                                       /**<  (SAFBC_CNFG_CS0_OPCODEA) There are two Opcode A registers, one associated with each of the Flashes. If the CS1     Flash does not exist, its register can be left in its default state. The four fields in each     register represent the 8-bit Flash opcodes for Write Enable, Suspend, Resume and Read Status     Register. The Status Register referred to is the register inside the Flash which contains the     (BUSY) or (IN PROGRESS) status bit in position 0.  Reset Value */

