ranjithaguna/pv/LED_Demo/source/pic32cx/component/safbc.h
#define SAFBC_CNFG_CS0_OPCODEA_OP_WE_Pos      (0)                                            /**< (SAFBC_CNFG_CS0_OPCODEA) This field contains the 8-bit Opcode for Write Enable in the respective Flash device. Position */
#define SAFBC_CNFG_CS0_OPCODEA_OP_WE_Msk      (0xFFU << SAFBC_CNFG_CS0_OPCODEA_OP_WE_Pos)    /**< (SAFBC_CNFG_CS0_OPCODEA) This field contains the 8-bit Opcode for Write Enable in the respective Flash device. Mask */
#define SAFBC_CNFG_CS0_OPCODEA_OP_WE(value)   (SAFBC_CNFG_CS0_OPCODEA_OP_WE_Msk & ((value) << SAFBC_CNFG_CS0_OPCODEA_OP_WE_Pos))
#define SAFBC_CNFG_CS0_OPCODEA_OP_SUS_Pos     (8)                                            /**< (SAFBC_CNFG_CS0_OPCODEA) This field contains the 8-bit Opcode for Suspend in the respective Flash device. Position */
#define SAFBC_CNFG_CS0_OPCODEA_OP_SUS_Msk     (0xFFU << SAFBC_CNFG_CS0_OPCODEA_OP_SUS_Pos)   /**< (SAFBC_CNFG_CS0_OPCODEA) This field contains the 8-bit Opcode for Suspend in the respective Flash device. Mask */
#define SAFBC_CNFG_CS0_OPCODEA_OP_SUS(value)  (SAFBC_CNFG_CS0_OPCODEA_OP_SUS_Msk & ((value) << SAFBC_CNFG_CS0_OPCODEA_OP_SUS_Pos))
#define SAFBC_CNFG_CS0_OPCODEA_OP_RSM_Pos     (16)                                           /**< (SAFBC_CNFG_CS0_OPCODEA) This field contains the 8-bit Opcode for Resume in the respective Flash device. Position */
#define SAFBC_CNFG_CS0_OPCODEA_OP_RSM_Msk     (0xFFU << SAFBC_CNFG_CS0_OPCODEA_OP_RSM_Pos)   /**< (SAFBC_CNFG_CS0_OPCODEA) This field contains the 8-bit Opcode for Resume in the respective Flash device. Mask */
#define SAFBC_CNFG_CS0_OPCODEA_OP_RSM(value)  (SAFBC_CNFG_CS0_OPCODEA_OP_RSM_Msk & ((value) << SAFBC_CNFG_CS0_OPCODEA_OP_RSM_Pos))
#define SAFBC_CNFG_CS0_OPCODEA_OP_POLL1_Pos   (24)                                           /**< (SAFBC_CNFG_CS0_OPCODEA) This field contains the 8-bit Opcode for Read Status Register in the respective Flash       device. Position */
#define SAFBC_CNFG_CS0_OPCODEA_OP_POLL1_Msk   (0xFFU << SAFBC_CNFG_CS0_OPCODEA_OP_POLL1_Pos)  /**< (SAFBC_CNFG_CS0_OPCODEA) This field contains the 8-bit Opcode for Read Status Register in the respective Flash       device. Mask */
#define SAFBC_CNFG_CS0_OPCODEA_OP_POLL1(value) (SAFBC_CNFG_CS0_OPCODEA_OP_POLL1_Msk & ((value) << SAFBC_CNFG_CS0_OPCODEA_OP_POLL1_Pos))
#define SAFBC_CNFG_CS0_OPCODEA_Msk            (0xFFFFFFFFUL)                                 /**< (SAFBC_CNFG_CS0_OPCODEA) Register Mask  */

/* -------- SAFBC_CNFG_CS0_OPCODEB : (SAFBC Offset: 0x50) (R/W 32) There are two Opcode B registers, one associated with each of the Flashes. If the CS1 Flash    does not exist, its register can be left in its default state. The OP_PROGRAM field is mandatory,    and must hold the Page Program opcode for the respective Flash. The Erase size of 4K is mandatory,    and so the OP_ERASE0 field must be initialized to the appropriate opcode for the Flash device.    There is only one bit declaring each Erase size up to the Host System (instead of one per Flash device,    see eSPI Configuration Register 44h), so if there are two Flash devices, each    Erase size over 4K must be declared here only if BOTH Flash devices support it. -------- */

typedef union
{
  struct
  {
    uint32_t OP_ERASE0:8;               /**< bit:   0..7  This field contains the 8-bit Opcode for 4K Erase in the respective Flash device. This Erase         size is mandatory. */
    uint32_t OP_ERASE1:8;               /**< bit:  8..15  This field contains the 8-bit Opcode for 32K Erase in the respective Flash device. If there         are two Flash devices present, and 32K Erase is not supported by both Flash devices, then this         field must be left as 00h in both the CS0 and CS1 registers. */
    uint32_t OP_ERASE2:8;               /**< bit: 16..23  This field contains the 8-bit Opcode for 64K Erase in the respective Flash device. If there         are two Flash devices present, and 64K Erase is not supported by both Flash devices, then this         field must be left as 00h in both the CS0 and CS1 registers. */
    uint32_t OP_PROGRAM:8;              /**< bit: 24..31  This field contains the 8-bit Opcode for Page Program in the respective Flash device. */
  };
  uint32_t w;
} __SAFBC_CNFG_CS0_OPCODEB_bits_t;
#define SAFBC_CNFG_CS0_OPCODEB_RESETVALUE   (0x00U)                                       /**<  (SAFBC_CNFG_CS0_OPCODEB) There are two Opcode B registers, one associated with each of the Flashes. If the CS1 Flash    does not exist, its register can be left in its default state. The OP_PROGRAM field is mandatory,    and must hold the Page Program opcode for the respective Flash. The Erase size of 4K is mandatory,    and so the OP_ERASE0 field must be initialized to the appropriate opcode for the Flash device.    There is only one bit declaring each Erase size up to the Host System (instead of one per Flash device,    see eSPI Configuration Register 44h), so if there are two Flash devices, each    Erase size over 4K must be declared here only if BOTH Flash devices support it.  Reset Value */

#define SAFBC_CNFG_CS0_OPCODEB_OP_ERASE0_Pos  (0)                                            /**< (SAFBC_CNFG_CS0_OPCODEB) This field contains the 8-bit Opcode for 4K Erase in the respective Flash device. This Erase         size is mandatory. Position */
#define SAFBC_CNFG_CS0_OPCODEB_OP_ERASE0_Msk  (0xFFU << SAFBC_CNFG_CS0_OPCODEB_OP_ERASE0_Pos)  /**< (SAFBC_CNFG_CS0_OPCODEB) This field contains the 8-bit Opcode for 4K Erase in the respective Flash device. This Erase         size is mandatory. Mask */
#define SAFBC_CNFG_CS0_OPCODEB_OP_ERASE0(value) (SAFBC_CNFG_CS0_OPCODEB_OP_ERASE0_Msk & ((value) << SAFBC_CNFG_CS0_OPCODEB_OP_ERASE0_Pos))
#define SAFBC_CNFG_CS0_OPCODEB_OP_ERASE1_Pos  (8)                                            /**< (SAFBC_CNFG_CS0_OPCODEB) This field contains the 8-bit Opcode for 32K Erase in the respective Flash device. If there         are two Flash devices present, and 32K Erase is not supported by both Flash devices, then this         field must be left as 00h in both the CS0 and CS1 registers. Position */
#define SAFBC_CNFG_CS0_OPCODEB_OP_ERASE1_Msk  (0xFFU << SAFBC_CNFG_CS0_OPCODEB_OP_ERASE1_Pos)  /**< (SAFBC_CNFG_CS0_OPCODEB) This field contains the 8-bit Opcode for 32K Erase in the respective Flash device. If there         are two Flash devices present, and 32K Erase is not supported by both Flash devices, then this         field must be left as 00h in both the CS0 and CS1 registers. Mask */
#define SAFBC_CNFG_CS0_OPCODEB_OP_ERASE1(value) (SAFBC_CNFG_CS0_OPCODEB_OP_ERASE1_Msk & ((value) << SAFBC_CNFG_CS0_OPCODEB_OP_ERASE1_Pos))
#define SAFBC_CNFG_CS0_OPCODEB_OP_ERASE2_Pos  (16)                                           /**< (SAFBC_CNFG_CS0_OPCODEB) This field contains the 8-bit Opcode for 64K Erase in the respective Flash device. If there         are two Flash devices present, and 64K Erase is not supported by both Flash devices, then this         field must be left as 00h in both the CS0 and CS1 registers. Position */
#define SAFBC_CNFG_CS0_OPCODEB_OP_ERASE2_Msk  (0xFFU << SAFBC_CNFG_CS0_OPCODEB_OP_ERASE2_Pos)  /**< (SAFBC_CNFG_CS0_OPCODEB) This field contains the 8-bit Opcode for 64K Erase in the respective Flash device. If there         are two Flash devices present, and 64K Erase is not supported by both Flash devices, then this         field must be left as 00h in both the CS0 and CS1 registers. Mask */
#define SAFBC_CNFG_CS0_OPCODEB_OP_ERASE2(value) (SAFBC_CNFG_CS0_OPCODEB_OP_ERASE2_Msk & ((value) << SAFBC_CNFG_CS0_OPCODEB_OP_ERASE2_Pos))
#define SAFBC_CNFG_CS0_OPCODEB_OP_PROGRAM_Pos (24)                                           /**< (SAFBC_CNFG_CS0_OPCODEB) This field contains the 8-bit Opcode for Page Program in the respective Flash device. Position */
#define SAFBC_CNFG_CS0_OPCODEB_OP_PROGRAM_Msk (0xFFU << SAFBC_CNFG_CS0_OPCODEB_OP_PROGRAM_Pos)  /**< (SAFBC_CNFG_CS0_OPCODEB) This field contains the 8-bit Opcode for Page Program in the respective Flash device. Mask */
#define SAFBC_CNFG_CS0_OPCODEB_OP_PROGRAM(value) (SAFBC_CNFG_CS0_OPCODEB_OP_PROGRAM_Msk & ((value) << SAFBC_CNFG_CS0_OPCODEB_OP_PROGRAM_Pos))
#define SAFBC_CNFG_CS0_OPCODEB_Msk            (0xFFFFFFFFUL)                                 /**< (SAFBC_CNFG_CS0_OPCODEB) Register Mask  */

/* -------- SAFBC_CNFG_CS0_OPCODEC : (SAFBC Offset: 0x54) (R/W 32) There are two Opcode C registers, one associated with each of the Flashes. If the CS1 Flash     does not exist, its register can be left in its default state. Two fields (OP) define opcodes,     and two fields (MODE) represent the Mode code values. Mode codes are provided immediately after     the Address in Continuous Read traffic, and are used to keep the Flash device in Continuous     Read Mode. Depending on the Flash device manufacturer, this mode may be documented in their     datasheet as either a Mode byte, or as certain bits of a first Dummy byte or first Dummy     clock. The recommended Mode values given below are selected to be appropriate for any Flash device. -------- */

typedef union
{
  struct
  {
    uint32_t OP_READ:8;                 /**< bit:   0..7  This field must contain the 8-bit Opcode for Fast Read Quad or Fast Read Dual in the         respective Flash device. This code is used in entering Continuous Read mode, and does not         appear afterward. */
    uint32_t MODE_NONC:8;               /**< bit:  8..15  This field is currently a placeholder and is not used. The recommended value for this         field, for future compatibility, is FFh. */
    uint32_t MODE_CONT:8;               /**< bit: 16..23  This field contains the 8-bit Mode code used to place (or keep) the Flash device in         Continuous Read mode. It is strongly recommended that this value be set to A5h, as a         universally-acceptable value among Flash devices. */
    uint32_t OP_POLL2:8;                /**< bit: 24..31  This field contains the 8-bit Opcode used to confirm Suspended status in the Flash device.         It is issued using a designated Timing Descriptor chain Poll which is used to read a 16-bit         value. This value is evaluated using the Mask values in the Poll2 Mask register */
  };
  uint32_t w;
} __SAFBC_CNFG_CS0_OPCODEC_bits_t;
#define SAFBC_CNFG_CS0_OPCODEC_RESETVALUE   (0x00U)                                       /**<  (SAFBC_CNFG_CS0_OPCODEC) There are two Opcode C registers, one associated with each of the Flashes. If the CS1 Flash     does not exist, its register can be left in its default state. Two fields (OP) define opcodes,     and two fields (MODE) represent the Mode code values. Mode codes are provided immediately after     the Address in Continuous Read traffic, and are used to keep the Flash device in Continuous     Read Mode. Depending on the Flash device manufacturer, this mode may be documented in their     datasheet as either a Mode byte, or as certain bits of a first Dummy byte or first Dummy     clock. The recommended Mode values given below are selected to be appropriate for any Flash device.  Reset Value */

#define SAFBC_CNFG_CS0_OPCODEC_OP_READ_Pos    (0)                                            /**< (SAFBC_CNFG_CS0_OPCODEC) This field must contain the 8-bit Opcode for Fast Read Quad or Fast Read Dual in the         respective Flash device. This code is used in entering Continuous Read mode, and does not         appear afterward. Position */
#define SAFBC_CNFG_CS0_OPCODEC_OP_READ_Msk    (0xFFU << SAFBC_CNFG_CS0_OPCODEC_OP_READ_Pos)  /**< (SAFBC_CNFG_CS0_OPCODEC) This field must contain the 8-bit Opcode for Fast Read Quad or Fast Read Dual in the         respective Flash device. This code is used in entering Continuous Read mode, and does not         appear afterward. Mask */
#define SAFBC_CNFG_CS0_OPCODEC_OP_READ(value) (SAFBC_CNFG_CS0_OPCODEC_OP_READ_Msk & ((value) << SAFBC_CNFG_CS0_OPCODEC_OP_READ_Pos))
#define SAFBC_CNFG_CS0_OPCODEC_MODE_NONC_Pos  (8)                                            /**< (SAFBC_CNFG_CS0_OPCODEC) This field is currently a placeholder and is not used. The recommended value for this         field, for future compatibility, is FFh. Position */
#define SAFBC_CNFG_CS0_OPCODEC_MODE_NONC_Msk  (0xFFU << SAFBC_CNFG_CS0_OPCODEC_MODE_NONC_Pos)  /**< (SAFBC_CNFG_CS0_OPCODEC) This field is currently a placeholder and is not used. The recommended value for this         field, for future compatibility, is FFh. Mask */
#define SAFBC_CNFG_CS0_OPCODEC_MODE_NONC(value) (SAFBC_CNFG_CS0_OPCODEC_MODE_NONC_Msk & ((value) << SAFBC_CNFG_CS0_OPCODEC_MODE_NONC_Pos))
#define SAFBC_CNFG_CS0_OPCODEC_MODE_CONT_Pos  (16)                                           /**< (SAFBC_CNFG_CS0_OPCODEC) This field contains the 8-bit Mode code used to place (or keep) the Flash device in         Continuous Read mode. It is strongly recommended that this value be set to A5h, as a         universally-acceptable value among Flash devices. Position */
#define SAFBC_CNFG_CS0_OPCODEC_MODE_CONT_Msk  (0xFFU << SAFBC_CNFG_CS0_OPCODEC_MODE_CONT_Pos)  /**< (SAFBC_CNFG_CS0_OPCODEC) This field contains the 8-bit Mode code used to place (or keep) the Flash device in         Continuous Read mode. It is strongly recommended that this value be set to A5h, as a         universally-acceptable value among Flash devices. Mask */
#define SAFBC_CNFG_CS0_OPCODEC_MODE_CONT(value) (SAFBC_CNFG_CS0_OPCODEC_MODE_CONT_Msk & ((value) << SAFBC_CNFG_CS0_OPCODEC_MODE_CONT_Pos))
#define SAFBC_CNFG_CS0_OPCODEC_OP_POLL2_Pos   (24)                                           /**< (SAFBC_CNFG_CS0_OPCODEC) This field contains the 8-bit Opcode used to confirm Suspended status in the Flash device.         It is issued using a designated Timing Descriptor chain Poll which is used to read a 16-bit         value. This value is evaluated using the Mask values in the Poll2 Mask register Position */
#define SAFBC_CNFG_CS0_OPCODEC_OP_POLL2_Msk   (0xFFU << SAFBC_CNFG_CS0_OPCODEC_OP_POLL2_Pos)  /**< (SAFBC_CNFG_CS0_OPCODEC) This field contains the 8-bit Opcode used to confirm Suspended status in the Flash device.         It is issued using a designated Timing Descriptor chain Poll which is used to read a 16-bit         value. This value is evaluated using the Mask values in the Poll2 Mask register Mask */
#define SAFBC_CNFG_CS0_OPCODEC_OP_POLL2(value) (SAFBC_CNFG_CS0_OPCODEC_OP_POLL2_Msk & ((value) << SAFBC_CNFG_CS0_OPCODEC_OP_POLL2_Pos))
#define SAFBC_CNFG_CS0_OPCODEC_Msk            (0xFFFFFFFFUL)                                 /**< (SAFBC_CNFG_CS0_OPCODEC) Register Mask  */

/* -------- SAFBC_CNFG_CS0_DESC : (SAFBC Offset: 0x58) (R/W 32) There are two Per-Flash Descriptors registers, one associated with each of the Flash devices.     If the CS1 Flash does not exist, its register can be left in its default state. Each 4-bit field     is a pointer which identifies a Timing Descriptor location in the Captive QMSPI block's Timing     Description register structure.     The ENTER_CONT (Enter Continuous Mode) and READ_CONT (Read in Continuous Mode) fields are used to     invoke a QMSPI Timing Descriptor chain for the corresponding action, by identifying the first     Descriptor entry of the chain being invoked. Using the general QMSPI programming model, these     settings would be:      ENTER_CONT =      - 3 for CS0      - 9 for CS1      READ_CONT =      - 0 for CS0      - 6 for CS1      The SIZE_CONT field identifies the specific Descriptor within the READ_CONT chain that holds the      requested Read size. Using the example QMSPI programming model, these settings would be:       SIZE_CONT =       - 2 for CS0       - 8 for CS1 -------- */

typedef union
{
  struct
  {
    uint32_t ENTER_CONT:4;              /**< bit:   0..3  This field points to the first Descriptor element of the Enter Continuous Mode chain. */
    uint32_t :4;                        /**< bit:   4..7  Reserved                                      */
    uint32_t READ_CONT:4;               /**< bit:  8..11  This field points to the first Descriptor element of the Continuous Read chain. */
    uint32_t SIZE_CONT:4;               /**< bit: 12..15  This field points to the Descriptor element within the READ_CONT chain that contains         the Length field for data. */
    uint32_t :16;                       /**< bit: 16..31  Reserved                                      */
  };
  uint32_t w;
} __SAFBC_CNFG_CS0_DESC_bits_t;
#define SAFBC_CNFG_CS0_DESC_RESETVALUE      (0x00U)                                       /**<  (SAFBC_CNFG_CS0_DESC) There are two Per-Flash Descriptors registers, one associated with each of the Flash devices.     If the CS1 Flash does not exist, its register can be left in its default state. Each 4-bit field     is a pointer which identifies a Timing Descriptor location in the Captive QMSPI block's Timing     Description register structure.     The ENTER_CONT (Enter Continuous Mode) and READ_CONT (Read in Continuous Mode) fields are used to     invoke a QMSPI Timing Descriptor chain for the corresponding action, by identifying the first     Descriptor entry of the chain being invoked. Using the general QMSPI programming model, these     settings would be:      ENTER_CONT =      - 3 for CS0      - 9 for CS1      READ_CONT =      - 0 for CS0      - 6 for CS1      The SIZE_CONT field identifies the specific Descriptor within the READ_CONT chain that holds the      requested Read size. Using the example QMSPI programming model, these settings would be:       SIZE_CONT =       - 2 for CS0       - 8 for CS1  Reset Value */

