ranjithaguna/pv/LED_Demo/source/pic32cx/component/safbc.h
#define SAFBC_CNFG_CS0_DESC_ENTER_CONT_Pos    (0)                                            /**< (SAFBC_CNFG_CS0_DESC) This field points to the first Descriptor element of the Enter Continuous Mode chain. Position */
#define SAFBC_CNFG_CS0_DESC_ENTER_CONT_Msk    (0xFU << SAFBC_CNFG_CS0_DESC_ENTER_CONT_Pos)   /**< (SAFBC_CNFG_CS0_DESC) This field points to the first Descriptor element of the Enter Continuous Mode chain. Mask */
#define SAFBC_CNFG_CS0_DESC_ENTER_CONT(value) (SAFBC_CNFG_CS0_DESC_ENTER_CONT_Msk & ((value) << SAFBC_CNFG_CS0_DESC_ENTER_CONT_Pos))
#define SAFBC_CNFG_CS0_DESC_READ_CONT_Pos     (8)                                            /**< (SAFBC_CNFG_CS0_DESC) This field points to the first Descriptor element of the Continuous Read chain. Position */
#define SAFBC_CNFG_CS0_DESC_READ_CONT_Msk     (0xFU << SAFBC_CNFG_CS0_DESC_READ_CONT_Pos)    /**< (SAFBC_CNFG_CS0_DESC) This field points to the first Descriptor element of the Continuous Read chain. Mask */
#define SAFBC_CNFG_CS0_DESC_READ_CONT(value)  (SAFBC_CNFG_CS0_DESC_READ_CONT_Msk & ((value) << SAFBC_CNFG_CS0_DESC_READ_CONT_Pos))
#define SAFBC_CNFG_CS0_DESC_SIZE_CONT_Pos     (12)                                           /**< (SAFBC_CNFG_CS0_DESC) This field points to the Descriptor element within the READ_CONT chain that contains         the Length field for data. Position */
#define SAFBC_CNFG_CS0_DESC_SIZE_CONT_Msk     (0xFU << SAFBC_CNFG_CS0_DESC_SIZE_CONT_Pos)    /**< (SAFBC_CNFG_CS0_DESC) This field points to the Descriptor element within the READ_CONT chain that contains         the Length field for data. Mask */
#define SAFBC_CNFG_CS0_DESC_SIZE_CONT(value)  (SAFBC_CNFG_CS0_DESC_SIZE_CONT_Msk & ((value) << SAFBC_CNFG_CS0_DESC_SIZE_CONT_Pos))
#define SAFBC_CNFG_CS0_DESC_Msk               (0x0000FF0FUL)                                 /**< (SAFBC_CNFG_CS0_DESC) Register Mask  */

/* -------- SAFBC_CNFG_CS1_OPCODEA : (SAFBC Offset: 0x5c) (R/W 32) This is the CS1 Opcode A register. \n   If the CS1 Flash does not exist, its register can be left in its default state. The four fields in each register represent the 8-bit Flash\n   opcodes for Write Enable, Suspend, Resume and Read Status Register. The Status Register referred to is the register inside the Flash which\n          contains the BUSY or IN PROGRESS status bit in position 0. -------- */

typedef union
{
  struct
  {
    uint32_t OP_WE:8;                   /**< bit:   0..7  This field contains the 8-bit Opcode for Write Enable in the respective Flash device. */
    uint32_t OP_SUS:8;                  /**< bit:  8..15  This field contains the 8-bit Opcode for Suspend in the respective Flash device. */
    uint32_t OP_RSM:8;                  /**< bit: 16..23  This field contains the 8-bit Opcode for Resume in the respective Flash device. */
    uint32_t OP_POLL1:8;                /**< bit: 24..31  This field contains the 8-bit Opcode for Read Status Register in the respective Flash       device. */
  };
  uint32_t w;
} __SAFBC_CNFG_CS1_OPCODEA_bits_t;
#define SAFBC_CNFG_CS1_OPCODEA_RESETVALUE   (0x00U)                                       /**<  (SAFBC_CNFG_CS1_OPCODEA) This is the CS1 Opcode A register. \n   If the CS1 Flash does not exist, its register can be left in its default state. The four fields in each register represent the 8-bit Flash\n   opcodes for Write Enable, Suspend, Resume and Read Status Register. The Status Register referred to is the register inside the Flash which\n          contains the BUSY or IN PROGRESS status bit in position 0.  Reset Value */

#define SAFBC_CNFG_CS1_OPCODEA_OP_WE_Pos      (0)                                            /**< (SAFBC_CNFG_CS1_OPCODEA) This field contains the 8-bit Opcode for Write Enable in the respective Flash device. Position */
#define SAFBC_CNFG_CS1_OPCODEA_OP_WE_Msk      (0xFFU << SAFBC_CNFG_CS1_OPCODEA_OP_WE_Pos)    /**< (SAFBC_CNFG_CS1_OPCODEA) This field contains the 8-bit Opcode for Write Enable in the respective Flash device. Mask */
#define SAFBC_CNFG_CS1_OPCODEA_OP_WE(value)   (SAFBC_CNFG_CS1_OPCODEA_OP_WE_Msk & ((value) << SAFBC_CNFG_CS1_OPCODEA_OP_WE_Pos))
#define SAFBC_CNFG_CS1_OPCODEA_OP_SUS_Pos     (8)                                            /**< (SAFBC_CNFG_CS1_OPCODEA) This field contains the 8-bit Opcode for Suspend in the respective Flash device. Position */
#define SAFBC_CNFG_CS1_OPCODEA_OP_SUS_Msk     (0xFFU << SAFBC_CNFG_CS1_OPCODEA_OP_SUS_Pos)   /**< (SAFBC_CNFG_CS1_OPCODEA) This field contains the 8-bit Opcode for Suspend in the respective Flash device. Mask */
#define SAFBC_CNFG_CS1_OPCODEA_OP_SUS(value)  (SAFBC_CNFG_CS1_OPCODEA_OP_SUS_Msk & ((value) << SAFBC_CNFG_CS1_OPCODEA_OP_SUS_Pos))
#define SAFBC_CNFG_CS1_OPCODEA_OP_RSM_Pos     (16)                                           /**< (SAFBC_CNFG_CS1_OPCODEA) This field contains the 8-bit Opcode for Resume in the respective Flash device. Position */
#define SAFBC_CNFG_CS1_OPCODEA_OP_RSM_Msk     (0xFFU << SAFBC_CNFG_CS1_OPCODEA_OP_RSM_Pos)   /**< (SAFBC_CNFG_CS1_OPCODEA) This field contains the 8-bit Opcode for Resume in the respective Flash device. Mask */
#define SAFBC_CNFG_CS1_OPCODEA_OP_RSM(value)  (SAFBC_CNFG_CS1_OPCODEA_OP_RSM_Msk & ((value) << SAFBC_CNFG_CS1_OPCODEA_OP_RSM_Pos))
#define SAFBC_CNFG_CS1_OPCODEA_OP_POLL1_Pos   (24)                                           /**< (SAFBC_CNFG_CS1_OPCODEA) This field contains the 8-bit Opcode for Read Status Register in the respective Flash       device. Position */
#define SAFBC_CNFG_CS1_OPCODEA_OP_POLL1_Msk   (0xFFU << SAFBC_CNFG_CS1_OPCODEA_OP_POLL1_Pos)  /**< (SAFBC_CNFG_CS1_OPCODEA) This field contains the 8-bit Opcode for Read Status Register in the respective Flash       device. Mask */
#define SAFBC_CNFG_CS1_OPCODEA_OP_POLL1(value) (SAFBC_CNFG_CS1_OPCODEA_OP_POLL1_Msk & ((value) << SAFBC_CNFG_CS1_OPCODEA_OP_POLL1_Pos))
#define SAFBC_CNFG_CS1_OPCODEA_Msk            (0xFFFFFFFFUL)                                 /**< (SAFBC_CNFG_CS1_OPCODEA) Register Mask  */

/* -------- SAFBC_CNFG_CS1_OPCODEB : (SAFBC Offset: 0x60) (R/W 32) This is the CS1 Flash Opcode B register. If the CS1 Flash does not exist, its register can be     left in its default state. The OP_PROGRAM field is mandatory, and must hold the Page Program     opcode for the respective Flash. The Erase size of 4K is mandatory, and so the OP_ERASE0 field     must be initialized to the appropriate opcode for the Flash device. There is only one bit     declaring each Erase size up to the Host System (instead of one per Flash device, see eSPI     Configuration Register 44h), so if there are two Flash devices, each Erase size over 4K must     be declared here only if BOTH Flash devices support it. -------- */

typedef union
{
  struct
  {
    uint32_t OP_ERASE0:8;               /**< bit:   0..7  This field contains the 8-bit Opcode for 4K Erase in the respective Flash device. This Erase         size is mandatory. */
    uint32_t OP_ERASE1:8;               /**< bit:  8..15  This field contains the 8-bit Opcode for 32K Erase in the respective Flash device. If there         are two Flash devices present, and 32K Erase is not supported by both Flash devices, then this         field must be left as 00h in both the CS0 and CS1 registers. */
    uint32_t OP_ERASE2:8;               /**< bit: 16..23  This field contains the 8-bit Opcode for 64K Erase in the respective Flash device. If there         are two Flash devices present, and 64K Erase is not supported by both Flash devices, then this         field must be left as 00h in both the CS0 and CS1 registers. */
    uint32_t OP_PROGRAM:8;              /**< bit: 24..31  This field contains the 8-bit Opcode for Page Program in the respective Flash device. */
  };
  uint32_t w;
} __SAFBC_CNFG_CS1_OPCODEB_bits_t;
#define SAFBC_CNFG_CS1_OPCODEB_RESETVALUE   (0x00U)                                       /**<  (SAFBC_CNFG_CS1_OPCODEB) This is the CS1 Flash Opcode B register. If the CS1 Flash does not exist, its register can be     left in its default state. The OP_PROGRAM field is mandatory, and must hold the Page Program     opcode for the respective Flash. The Erase size of 4K is mandatory, and so the OP_ERASE0 field     must be initialized to the appropriate opcode for the Flash device. There is only one bit     declaring each Erase size up to the Host System (instead of one per Flash device, see eSPI     Configuration Register 44h), so if there are two Flash devices, each Erase size over 4K must     be declared here only if BOTH Flash devices support it.  Reset Value */

