ranjithaguna/pv/LED_Demo/source/pic32cx/component/safbc.h
/* -------- SAFBC_CNFG_CS_DESC : (SAFBC Offset: 0x6c) (R/W 32) This is a single register, which accompanies the two Per-Flash Descriptors registers, and     provides Descriptor pointers that are shared by both CS0 and CS1 devices uniformly.     Each 4-bit field is a pointer which identifies a Timing Descriptor location in the Captive     QMSPI block's memory. The EXIT_CONT field (Exit Continuous Mode) points to the single chain     invoked to exit the Flash from Continuous Mode, allowing an Erase or Program command to be     entered. This chain is identical for either Flash device, regardless of its manufacturer, and     simply directs a universal Exit symbol to the appropriate CS0/CS1 device. The POLL1 and POLL2     fields should both point to the same chain. This chain will issue the appropriate opcode for the     operation (Poll1 or Poll2) supplied by the SAF Bridge from the Opcode registers, and will read     back 16 bits of information for use by the SAF Bridge. -------- */

typedef union
{
  struct
  {
    uint32_t EXIT_CONT:4;               /**< bit:   0..3  This field points to the first Descriptor element of the Exit Continuous Mode chain. */
    uint32_t :4;                        /**< bit:   4..7  Reserved                                      */
    uint32_t POLL1:4;                   /**< bit:  8..11  This field points to the first Descriptor element of the Poll chain, used when         polling for Busy status. */
    uint32_t POLL2:4;                   /**< bit: 12..15  This field points to the first Descriptor element of the Poll chain, used when         polling for Suspended status. */
    uint32_t :16;                       /**< bit: 16..31  Reserved                                      */
  };
  uint32_t w;
} __SAFBC_CNFG_CS_DESC_bits_t;
#define SAFBC_CNFG_CS_DESC_RESETVALUE       (0x00U)                                       /**<  (SAFBC_CNFG_CS_DESC) This is a single register, which accompanies the two Per-Flash Descriptors registers, and     provides Descriptor pointers that are shared by both CS0 and CS1 devices uniformly.     Each 4-bit field is a pointer which identifies a Timing Descriptor location in the Captive     QMSPI block's memory. The EXIT_CONT field (Exit Continuous Mode) points to the single chain     invoked to exit the Flash from Continuous Mode, allowing an Erase or Program command to be     entered. This chain is identical for either Flash device, regardless of its manufacturer, and     simply directs a universal Exit symbol to the appropriate CS0/CS1 device. The POLL1 and POLL2     fields should both point to the same chain. This chain will issue the appropriate opcode for the     operation (Poll1 or Poll2) supplied by the SAF Bridge from the Opcode registers, and will read     back 16 bits of information for use by the SAF Bridge.  Reset Value */

#define SAFBC_CNFG_CS_DESC_EXIT_CONT_Pos      (0)                                            /**< (SAFBC_CNFG_CS_DESC) This field points to the first Descriptor element of the Exit Continuous Mode chain. Position */
#define SAFBC_CNFG_CS_DESC_EXIT_CONT_Msk      (0xFU << SAFBC_CNFG_CS_DESC_EXIT_CONT_Pos)     /**< (SAFBC_CNFG_CS_DESC) This field points to the first Descriptor element of the Exit Continuous Mode chain. Mask */
#define SAFBC_CNFG_CS_DESC_EXIT_CONT(value)   (SAFBC_CNFG_CS_DESC_EXIT_CONT_Msk & ((value) << SAFBC_CNFG_CS_DESC_EXIT_CONT_Pos))
#define SAFBC_CNFG_CS_DESC_POLL1_Pos          (8)                                            /**< (SAFBC_CNFG_CS_DESC) This field points to the first Descriptor element of the Poll chain, used when         polling for Busy status. Position */
#define SAFBC_CNFG_CS_DESC_POLL1_Msk          (0xFU << SAFBC_CNFG_CS_DESC_POLL1_Pos)         /**< (SAFBC_CNFG_CS_DESC) This field points to the first Descriptor element of the Poll chain, used when         polling for Busy status. Mask */
#define SAFBC_CNFG_CS_DESC_POLL1(value)       (SAFBC_CNFG_CS_DESC_POLL1_Msk & ((value) << SAFBC_CNFG_CS_DESC_POLL1_Pos))
#define SAFBC_CNFG_CS_DESC_POLL2_Pos          (12)                                           /**< (SAFBC_CNFG_CS_DESC) This field points to the first Descriptor element of the Poll chain, used when         polling for Suspended status. Position */
#define SAFBC_CNFG_CS_DESC_POLL2_Msk          (0xFU << SAFBC_CNFG_CS_DESC_POLL2_Pos)         /**< (SAFBC_CNFG_CS_DESC) This field points to the first Descriptor element of the Poll chain, used when         polling for Suspended status. Mask */
#define SAFBC_CNFG_CS_DESC_POLL2(value)       (SAFBC_CNFG_CS_DESC_POLL2_Msk & ((value) << SAFBC_CNFG_CS_DESC_POLL2_Pos))
#define SAFBC_CNFG_CS_DESC_Msk                (0x0000FF0FUL)                                 /**< (SAFBC_CNFG_CS_DESC) Register Mask  */

/* -------- SAFBC_PROTECT_LOCK : (SAFBC Offset: 0x70) (R/W 32) There is a bit in this register for each of the 17 Protection Region Register sets. Writing     '1' to a bit locks the associated 4-Register set to Read-Only access, and also locks this bit     itself to a Read-Only '1'. -------- */

typedef union
{
  struct
  {
    uint32_t SAF_PROT_LOCK_0:1;         /**< bit:      0  In its initial 0 state, this bit allows Read and Write access to the corresponding         Region Register set RR = 0: Start, Limit, Write and Read.          When written to 1, this bit locks those four registers as read-only, and also locks this         bit itself against being cleared. */
    uint32_t SAF_PROT_LOCK_1:1;         /**< bit:      1  In its initial 0 state, this bit allows Read and Write access to the corresponding         Region Register set RR = 1: Start, Limit, Write and Read.          When written to 1, this bit locks those four registers as read-only, and also locks this         bit itself against being cleared. */
    uint32_t SAF_PROT_LOCK_2:1;         /**< bit:      2  In its initial 0 state, this bit allows Read and Write access to the corresponding         Region Register set RR = 2: Start, Limit, Write and Read.          When written to 1, this bit locks those four registers as read-only, and also locks this         bit itself against being cleared. */
    uint32_t SAF_PROT_LOCK_3:1;         /**< bit:      3  In its initial 0 state, this bit allows Read and Write access to the corresponding         Region Register set RR = 3: Start, Limit, Write and Read.          When written to 1, this bit locks those four registers as read-only, and also locks this         bit itself against being cleared. */
    uint32_t SAF_PROT_LOCK_4:1;         /**< bit:      4  In its initial 0 state, this bit allows Read and Write access to the corresponding         Region Register set RR = 4: Start, Limit, Write and Read.          When written to 1, this bit locks those four registers as read-only, and also locks this         bit itself against being cleared. */
    uint32_t SAF_PROT_LOCK_5:1;         /**< bit:      5  In its initial 0 state, this bit allows Read and Write access to the corresponding         Region Register set RR = 5: Start, Limit, Write and Read.          When written to 1, this bit locks those four registers as read-only, and also locks this         bit itself against being cleared. */
    uint32_t SAF_PROT_LOCK_6:1;         /**< bit:      6  In its initial 0 state, this bit allows Read and Write access to the corresponding         Region Register set RR = 6: Start, Limit, Write and Read.          When written to 1, this bit locks those four registers as read-only, and also locks this         bit itself against being cleared. */
    uint32_t SAF_PROT_LOCK_7:1;         /**< bit:      7  In its initial 0 state, this bit allows Read and Write access to the corresponding         Region Register set RR = 7: Start, Limit, Write and Read.          When written to 1, this bit locks those four registers as read-only, and also locks this         bit itself against being cleared. */
    uint32_t SAF_PROT_LOCK_8:1;         /**< bit:      8  In its initial 0 state, this bit allows Read and Write access to the corresponding         Region Register set RR = 8: Start, Limit, Write and Read.          When written to 1, this bit locks those four registers as read-only, and also locks this         bit itself against being cleared. */
    uint32_t SAF_PROT_LOCK_9:1;         /**< bit:      9  In its initial 0 state, this bit allows Read and Write access to the corresponding         Region Register set RR = 9: Start, Limit, Write and Read.          When written to 1, this bit locks those four registers as read-only, and also locks this         bit itself against being cleared. */
    uint32_t SAF_PROT_LOCK_10:1;        /**< bit:     10  In its initial 0 state, this bit allows Read and Write access to the corresponding         Region Register set RR = 10: Start, Limit, Write and Read.          When written to 1, this bit locks those four registers as read-only, and also locks this         bit itself against being cleared. */
    uint32_t SAF_PROT_LOCK_11:1;        /**< bit:     11  In its initial 0 state, this bit allows Read and Write access to the corresponding         Region Register set RR = 11: Start, Limit, Write and Read.          When written to 1, this bit locks those four registers as read-only, and also locks this         bit itself against being cleared. */
    uint32_t SAF_PROT_LOCK_12:1;        /**< bit:     12  In its initial 0 state, this bit allows Read and Write access to the corresponding         Region Register set RR = 12: Start, Limit, Write and Read.          When written to 1, this bit locks those four registers as read-only, and also locks this         bit itself against being cleared. */
    uint32_t SAF_PROT_LOCK_13:1;        /**< bit:     13  In its initial 0 state, this bit allows Read and Write access to the corresponding         Region Register set RR = 13: Start, Limit, Write and Read.          When written to 1, this bit locks those four registers as read-only, and also locks this         bit itself against being cleared. */
    uint32_t SAF_PROT_LOCK_14:1;        /**< bit:     14  In its initial 0 state, this bit allows Read and Write access to the corresponding         Region Register set RR = 14: Start, Limit, Write and Read.          When written to 1, this bit locks those four registers as read-only, and also locks this         bit itself against being cleared. */
    uint32_t SAF_PROT_LOCK_15:1;        /**< bit:     15  In its initial 0 state, this bit allows Read and Write access to the corresponding         Region Register set RR = 15: Start, Limit, Write and Read.          When written to 1, this bit locks those four registers as read-only, and also locks this         bit itself against being cleared. */
    uint32_t SAF_PROT_LOCK_16:1;        /**< bit:     16  In its initial 0 state, this bit allows Read and Write access to the corresponding         Region Register set RR = 16: Start, Limit, Write and Read.          When written to 1, this bit locks those four registers as read-only, and also locks this         bit itself against being cleared. */
    uint32_t :15;                       /**< bit: 17..31  Reserved                                      */
  };
  struct
  {
    uint32_t SAF_PROT_LOCK_:17;         /**< bit:  0..16  In its initial x state, this bit allows Read and Write access to the corresponding         Region Register set RR = x6: Start, Limit, Write and Read.          When written to x, this bit locks those four registers as read-only, and also locks this         bit itself against being cleared. */
    uint32_t :15;                       /**< bit: 17..31  Reserved                                      */
  };
  uint32_t w;
} __SAFBC_PROTECT_LOCK_bits_t;
#define SAFBC_PROTECT_LOCK_RESETVALUE       (0x00U)                                       /**<  (SAFBC_PROTECT_LOCK) There is a bit in this register for each of the 17 Protection Region Register sets. Writing     '1' to a bit locks the associated 4-Register set to Read-Only access, and also locks this bit     itself to a Read-Only '1'.  Reset Value */

