ranjithaguna/pv/LED_Demo/source/pic32cx/component/safbc.h
#define SAFBC_PROTECT_LOCK_SAF_PROT_LOCK_0_Pos (0)                                            /**< (SAFBC_PROTECT_LOCK) In its initial 0 state, this bit allows Read and Write access to the corresponding         Region Register set RR = 0: Start, Limit, Write and Read.          When written to 1, this bit locks those four registers as read-only, and also locks this         bit itself against being cleared. Position */
#define SAFBC_PROTECT_LOCK_SAF_PROT_LOCK_0_Msk (0x1U << SAFBC_PROTECT_LOCK_SAF_PROT_LOCK_0_Pos)  /**< (SAFBC_PROTECT_LOCK) In its initial 0 state, this bit allows Read and Write access to the corresponding         Region Register set RR = 0: Start, Limit, Write and Read.          When written to 1, this bit locks those four registers as read-only, and also locks this         bit itself against being cleared. Mask */
#define SAFBC_PROTECT_LOCK_SAF_PROT_LOCK_1_Pos (1)                                            /**< (SAFBC_PROTECT_LOCK) In its initial 0 state, this bit allows Read and Write access to the corresponding         Region Register set RR = 1: Start, Limit, Write and Read.          When written to 1, this bit locks those four registers as read-only, and also locks this         bit itself against being cleared. Position */
#define SAFBC_PROTECT_LOCK_SAF_PROT_LOCK_1_Msk (0x1U << SAFBC_PROTECT_LOCK_SAF_PROT_LOCK_1_Pos)  /**< (SAFBC_PROTECT_LOCK) In its initial 0 state, this bit allows Read and Write access to the corresponding         Region Register set RR = 1: Start, Limit, Write and Read.          When written to 1, this bit locks those four registers as read-only, and also locks this         bit itself against being cleared. Mask */
#define SAFBC_PROTECT_LOCK_SAF_PROT_LOCK_2_Pos (2)                                            /**< (SAFBC_PROTECT_LOCK) In its initial 0 state, this bit allows Read and Write access to the corresponding         Region Register set RR = 2: Start, Limit, Write and Read.          When written to 1, this bit locks those four registers as read-only, and also locks this         bit itself against being cleared. Position */
#define SAFBC_PROTECT_LOCK_SAF_PROT_LOCK_2_Msk (0x1U << SAFBC_PROTECT_LOCK_SAF_PROT_LOCK_2_Pos)  /**< (SAFBC_PROTECT_LOCK) In its initial 0 state, this bit allows Read and Write access to the corresponding         Region Register set RR = 2: Start, Limit, Write and Read.          When written to 1, this bit locks those four registers as read-only, and also locks this         bit itself against being cleared. Mask */
#define SAFBC_PROTECT_LOCK_SAF_PROT_LOCK_3_Pos (3)                                            /**< (SAFBC_PROTECT_LOCK) In its initial 0 state, this bit allows Read and Write access to the corresponding         Region Register set RR = 3: Start, Limit, Write and Read.          When written to 1, this bit locks those four registers as read-only, and also locks this         bit itself against being cleared. Position */
#define SAFBC_PROTECT_LOCK_SAF_PROT_LOCK_3_Msk (0x1U << SAFBC_PROTECT_LOCK_SAF_PROT_LOCK_3_Pos)  /**< (SAFBC_PROTECT_LOCK) In its initial 0 state, this bit allows Read and Write access to the corresponding         Region Register set RR = 3: Start, Limit, Write and Read.          When written to 1, this bit locks those four registers as read-only, and also locks this         bit itself against being cleared. Mask */
#define SAFBC_PROTECT_LOCK_SAF_PROT_LOCK_4_Pos (4)                                            /**< (SAFBC_PROTECT_LOCK) In its initial 0 state, this bit allows Read and Write access to the corresponding         Region Register set RR = 4: Start, Limit, Write and Read.          When written to 1, this bit locks those four registers as read-only, and also locks this         bit itself against being cleared. Position */
#define SAFBC_PROTECT_LOCK_SAF_PROT_LOCK_4_Msk (0x1U << SAFBC_PROTECT_LOCK_SAF_PROT_LOCK_4_Pos)  /**< (SAFBC_PROTECT_LOCK) In its initial 0 state, this bit allows Read and Write access to the corresponding         Region Register set RR = 4: Start, Limit, Write and Read.          When written to 1, this bit locks those four registers as read-only, and also locks this         bit itself against being cleared. Mask */
#define SAFBC_PROTECT_LOCK_SAF_PROT_LOCK_5_Pos (5)                                            /**< (SAFBC_PROTECT_LOCK) In its initial 0 state, this bit allows Read and Write access to the corresponding         Region Register set RR = 5: Start, Limit, Write and Read.          When written to 1, this bit locks those four registers as read-only, and also locks this         bit itself against being cleared. Position */
#define SAFBC_PROTECT_LOCK_SAF_PROT_LOCK_5_Msk (0x1U << SAFBC_PROTECT_LOCK_SAF_PROT_LOCK_5_Pos)  /**< (SAFBC_PROTECT_LOCK) In its initial 0 state, this bit allows Read and Write access to the corresponding         Region Register set RR = 5: Start, Limit, Write and Read.          When written to 1, this bit locks those four registers as read-only, and also locks this         bit itself against being cleared. Mask */
#define SAFBC_PROTECT_LOCK_SAF_PROT_LOCK_6_Pos (6)                                            /**< (SAFBC_PROTECT_LOCK) In its initial 0 state, this bit allows Read and Write access to the corresponding         Region Register set RR = 6: Start, Limit, Write and Read.          When written to 1, this bit locks those four registers as read-only, and also locks this         bit itself against being cleared. Position */
#define SAFBC_PROTECT_LOCK_SAF_PROT_LOCK_6_Msk (0x1U << SAFBC_PROTECT_LOCK_SAF_PROT_LOCK_6_Pos)  /**< (SAFBC_PROTECT_LOCK) In its initial 0 state, this bit allows Read and Write access to the corresponding         Region Register set RR = 6: Start, Limit, Write and Read.          When written to 1, this bit locks those four registers as read-only, and also locks this         bit itself against being cleared. Mask */
#define SAFBC_PROTECT_LOCK_SAF_PROT_LOCK_7_Pos (7)                                            /**< (SAFBC_PROTECT_LOCK) In its initial 0 state, this bit allows Read and Write access to the corresponding         Region Register set RR = 7: Start, Limit, Write and Read.          When written to 1, this bit locks those four registers as read-only, and also locks this         bit itself against being cleared. Position */
#define SAFBC_PROTECT_LOCK_SAF_PROT_LOCK_7_Msk (0x1U << SAFBC_PROTECT_LOCK_SAF_PROT_LOCK_7_Pos)  /**< (SAFBC_PROTECT_LOCK) In its initial 0 state, this bit allows Read and Write access to the corresponding         Region Register set RR = 7: Start, Limit, Write and Read.          When written to 1, this bit locks those four registers as read-only, and also locks this         bit itself against being cleared. Mask */
#define SAFBC_PROTECT_LOCK_SAF_PROT_LOCK_8_Pos (8)                                            /**< (SAFBC_PROTECT_LOCK) In its initial 0 state, this bit allows Read and Write access to the corresponding         Region Register set RR = 8: Start, Limit, Write and Read.          When written to 1, this bit locks those four registers as read-only, and also locks this         bit itself against being cleared. Position */
#define SAFBC_PROTECT_LOCK_SAF_PROT_LOCK_8_Msk (0x1U << SAFBC_PROTECT_LOCK_SAF_PROT_LOCK_8_Pos)  /**< (SAFBC_PROTECT_LOCK) In its initial 0 state, this bit allows Read and Write access to the corresponding         Region Register set RR = 8: Start, Limit, Write and Read.          When written to 1, this bit locks those four registers as read-only, and also locks this         bit itself against being cleared. Mask */
#define SAFBC_PROTECT_LOCK_SAF_PROT_LOCK_9_Pos (9)                                            /**< (SAFBC_PROTECT_LOCK) In its initial 0 state, this bit allows Read and Write access to the corresponding         Region Register set RR = 9: Start, Limit, Write and Read.          When written to 1, this bit locks those four registers as read-only, and also locks this         bit itself against being cleared. Position */
#define SAFBC_PROTECT_LOCK_SAF_PROT_LOCK_9_Msk (0x1U << SAFBC_PROTECT_LOCK_SAF_PROT_LOCK_9_Pos)  /**< (SAFBC_PROTECT_LOCK) In its initial 0 state, this bit allows Read and Write access to the corresponding         Region Register set RR = 9: Start, Limit, Write and Read.          When written to 1, this bit locks those four registers as read-only, and also locks this         bit itself against being cleared. Mask */
#define SAFBC_PROTECT_LOCK_SAF_PROT_LOCK_10_Pos (10)                                           /**< (SAFBC_PROTECT_LOCK) In its initial 0 state, this bit allows Read and Write access to the corresponding         Region Register set RR = 10: Start, Limit, Write and Read.          When written to 1, this bit locks those four registers as read-only, and also locks this         bit itself against being cleared. Position */
#define SAFBC_PROTECT_LOCK_SAF_PROT_LOCK_10_Msk (0x1U << SAFBC_PROTECT_LOCK_SAF_PROT_LOCK_10_Pos)  /**< (SAFBC_PROTECT_LOCK) In its initial 0 state, this bit allows Read and Write access to the corresponding         Region Register set RR = 10: Start, Limit, Write and Read.          When written to 1, this bit locks those four registers as read-only, and also locks this         bit itself against being cleared. Mask */
#define SAFBC_PROTECT_LOCK_SAF_PROT_LOCK_11_Pos (11)                                           /**< (SAFBC_PROTECT_LOCK) In its initial 0 state, this bit allows Read and Write access to the corresponding         Region Register set RR = 11: Start, Limit, Write and Read.          When written to 1, this bit locks those four registers as read-only, and also locks this         bit itself against being cleared. Position */
#define SAFBC_PROTECT_LOCK_SAF_PROT_LOCK_11_Msk (0x1U << SAFBC_PROTECT_LOCK_SAF_PROT_LOCK_11_Pos)  /**< (SAFBC_PROTECT_LOCK) In its initial 0 state, this bit allows Read and Write access to the corresponding         Region Register set RR = 11: Start, Limit, Write and Read.          When written to 1, this bit locks those four registers as read-only, and also locks this         bit itself against being cleared. Mask */
#define SAFBC_PROTECT_LOCK_SAF_PROT_LOCK_12_Pos (12)                                           /**< (SAFBC_PROTECT_LOCK) In its initial 0 state, this bit allows Read and Write access to the corresponding         Region Register set RR = 12: Start, Limit, Write and Read.          When written to 1, this bit locks those four registers as read-only, and also locks this         bit itself against being cleared. Position */
#define SAFBC_PROTECT_LOCK_SAF_PROT_LOCK_12_Msk (0x1U << SAFBC_PROTECT_LOCK_SAF_PROT_LOCK_12_Pos)  /**< (SAFBC_PROTECT_LOCK) In its initial 0 state, this bit allows Read and Write access to the corresponding         Region Register set RR = 12: Start, Limit, Write and Read.          When written to 1, this bit locks those four registers as read-only, and also locks this         bit itself against being cleared. Mask */
#define SAFBC_PROTECT_LOCK_SAF_PROT_LOCK_13_Pos (13)                                           /**< (SAFBC_PROTECT_LOCK) In its initial 0 state, this bit allows Read and Write access to the corresponding         Region Register set RR = 13: Start, Limit, Write and Read.          When written to 1, this bit locks those four registers as read-only, and also locks this         bit itself against being cleared. Position */
#define SAFBC_PROTECT_LOCK_SAF_PROT_LOCK_13_Msk (0x1U << SAFBC_PROTECT_LOCK_SAF_PROT_LOCK_13_Pos)  /**< (SAFBC_PROTECT_LOCK) In its initial 0 state, this bit allows Read and Write access to the corresponding         Region Register set RR = 13: Start, Limit, Write and Read.          When written to 1, this bit locks those four registers as read-only, and also locks this         bit itself against being cleared. Mask */
#define SAFBC_PROTECT_LOCK_SAF_PROT_LOCK_14_Pos (14)                                           /**< (SAFBC_PROTECT_LOCK) In its initial 0 state, this bit allows Read and Write access to the corresponding         Region Register set RR = 14: Start, Limit, Write and Read.          When written to 1, this bit locks those four registers as read-only, and also locks this         bit itself against being cleared. Position */
#define SAFBC_PROTECT_LOCK_SAF_PROT_LOCK_14_Msk (0x1U << SAFBC_PROTECT_LOCK_SAF_PROT_LOCK_14_Pos)  /**< (SAFBC_PROTECT_LOCK) In its initial 0 state, this bit allows Read and Write access to the corresponding         Region Register set RR = 14: Start, Limit, Write and Read.          When written to 1, this bit locks those four registers as read-only, and also locks this         bit itself against being cleared. Mask */
#define SAFBC_PROTECT_LOCK_SAF_PROT_LOCK_15_Pos (15)                                           /**< (SAFBC_PROTECT_LOCK) In its initial 0 state, this bit allows Read and Write access to the corresponding         Region Register set RR = 15: Start, Limit, Write and Read.          When written to 1, this bit locks those four registers as read-only, and also locks this         bit itself against being cleared. Position */
#define SAFBC_PROTECT_LOCK_SAF_PROT_LOCK_15_Msk (0x1U << SAFBC_PROTECT_LOCK_SAF_PROT_LOCK_15_Pos)  /**< (SAFBC_PROTECT_LOCK) In its initial 0 state, this bit allows Read and Write access to the corresponding         Region Register set RR = 15: Start, Limit, Write and Read.          When written to 1, this bit locks those four registers as read-only, and also locks this         bit itself against being cleared. Mask */
#define SAFBC_PROTECT_LOCK_SAF_PROT_LOCK_16_Pos (16)                                           /**< (SAFBC_PROTECT_LOCK) In its initial 0 state, this bit allows Read and Write access to the corresponding         Region Register set RR = 16: Start, Limit, Write and Read.          When written to 1, this bit locks those four registers as read-only, and also locks this         bit itself against being cleared. Position */
#define SAFBC_PROTECT_LOCK_SAF_PROT_LOCK_16_Msk (0x1U << SAFBC_PROTECT_LOCK_SAF_PROT_LOCK_16_Pos)  /**< (SAFBC_PROTECT_LOCK) In its initial 0 state, this bit allows Read and Write access to the corresponding         Region Register set RR = 16: Start, Limit, Write and Read.          When written to 1, this bit locks those four registers as read-only, and also locks this         bit itself against being cleared. Mask */
#define SAFBC_PROTECT_LOCK_Msk                (0x0001FFFFUL)                                 /**< (SAFBC_PROTECT_LOCK) Register Mask  */
#define SAFBC_PROTECT_LOCK_SAF_PROT_LOCK__Pos (0)                                            /**< (SAFBC_PROTECT_LOCK Position) In its initial x state, this bit allows Read and Write access to the corresponding         Region Register set RR = x6: Start, Limit, Write and Read.          When written to x, this bit locks those four registers as read-only, and also locks this         bit itself against being cleared. */
#define SAFBC_PROTECT_LOCK_SAF_PROT_LOCK__Msk (0x1FFFFU << SAFBC_PROTECT_LOCK_SAF_PROT_LOCK__Pos)  /**< (SAFBC_PROTECT_LOCK Mask) SAF_PROT_LOCK_ */
#define SAFBC_PROTECT_LOCK_SAF_PROT_LOCK_(value) (SAFBC_PROTECT_LOCK_SAF_PROT_LOCK__Msk & ((value) << SAFBC_PROTECT_LOCK_SAF_PROT_LOCK__Pos))

