ranjithaguna/pv/LED_Demo/source/pic32cx/component/safbc.h
/* -------- SAFBC_PROTECT_DIRTY : (SAFBC Offset: 0x74) (R/W 32) There is a bit in this register for each of the 12 Flash Regions that can be allocated from     the Region Table in the Intel Descriptor structure. Register sets 12 through 16 do not represent     allocated Flash regions, and so they do not have bits in this register. -------- */

typedef union
{
  struct
  {
    uint32_t SAF_PROT_DIRTY_0:1;        /**< bit:      0  Indicates whether contents of Region 0 have been changed.         0=There has been no Write or Erase performed in this region since this bit was last cleared.         1=A Write or Erase has been performed in this region since this bit was last cleared. */
    uint32_t SAF_PROT_DIRTY_1:1;        /**< bit:      1  Indicates whether contents of Region 1 have been changed.         0=There has been no Write or Erase performed in this region since this bit was last cleared.         1=A Write or Erase has been performed in this region since this bit was last cleared. */
    uint32_t SAF_PROT_DIRTY_2:1;        /**< bit:      2  Indicates whether contents of Region 2 have been changed.         0=There has been no Write or Erase performed in this region since this bit was last cleared.         1=A Write or Erase has been performed in this region since this bit was last cleared. */
    uint32_t SAF_PROT_DIRTY_3:1;        /**< bit:      3  Indicates whether contents of Region 3 have been changed.         0=There has been no Write or Erase performed in this region since this bit was last cleared.         1=A Write or Erase has been performed in this region since this bit was last cleared. */
    uint32_t SAF_PROT_DIRTY_4:1;        /**< bit:      4  Indicates whether contents of Region 4 have been changed.         0=There has been no Write or Erase performed in this region since this bit was last cleared.         1=A Write or Erase has been performed in this region since this bit was last cleared. */
    uint32_t SAF_PROT_DIRTY_5:1;        /**< bit:      5  Indicates whether contents of Region 5 have been changed.         0=There has been no Write or Erase performed in this region since this bit was last cleared.         1=A Write or Erase has been performed in this region since this bit was last cleared. */
    uint32_t SAF_PROT_DIRTY_6:1;        /**< bit:      6  Indicates whether contents of Region 6 have been changed.         0=There has been no Write or Erase performed in this region since this bit was last cleared.         1=A Write or Erase has been performed in this region since this bit was last cleared. */
    uint32_t SAF_PROT_DIRTY_7:1;        /**< bit:      7  Indicates whether contents of Region 7 have been changed.         0=There has been no Write or Erase performed in this region since this bit was last cleared.         1=A Write or Erase has been performed in this region since this bit was last cleared. */
    uint32_t SAF_PROT_DIRTY_8:1;        /**< bit:      8  Indicates whether contents of Region 8 have been changed.         0=There has been no Write or Erase performed in this region since this bit was last cleared.         1=A Write or Erase has been performed in this region since this bit was last cleared. */
    uint32_t SAF_PROT_DIRTY_9:1;        /**< bit:      9  Indicates whether contents of Region 9 have been changed.         0=There has been no Write or Erase performed in this region since this bit was last cleared.         1=A Write or Erase has been performed in this region since this bit was last cleared. */
    uint32_t SAF_PROT_DIRTY_10:1;       /**< bit:     10  Indicates whether contents of Region 10 have been changed.         0=There has been no Write or Erase performed in this region since this bit was last cleared.         1=A Write or Erase has been performed in this region since this bit was last cleared. */
    uint32_t SAF_PROT_DIRTY_11:1;       /**< bit:     11  Indicates whether contents of Region 11 have been changed.         0=There has been no Write or Erase performed in this region since this bit was last cleared.         1=A Write or Erase has been performed in this region since this bit was last cleared. */
    uint32_t :20;                       /**< bit: 12..31  Reserved                                      */
  };
  struct
  {
    uint32_t SAF_PROT_DIRTY_:12;        /**< bit:  0..11  Indicates whether contents of Region xx have been changed.         x=There has been no Write or Erase performed in this region since this bit was last cleared.         x=A Write or Erase has been performed in this region since this bit was last cleared. */
    uint32_t :20;                       /**< bit: 12..31  Reserved                                      */
  };
  uint32_t w;
} __SAFBC_PROTECT_DIRTY_bits_t;
#define SAFBC_PROTECT_DIRTY_RESETVALUE      (0x00U)                                       /**<  (SAFBC_PROTECT_DIRTY) There is a bit in this register for each of the 12 Flash Regions that can be allocated from     the Region Table in the Intel Descriptor structure. Register sets 12 through 16 do not represent     allocated Flash regions, and so they do not have bits in this register.  Reset Value */

#define SAFBC_PROTECT_DIRTY_SAF_PROT_DIRTY_0_Pos (0)                                            /**< (SAFBC_PROTECT_DIRTY) Indicates whether contents of Region 0 have been changed.         0=There has been no Write or Erase performed in this region since this bit was last cleared.         1=A Write or Erase has been performed in this region since this bit was last cleared. Position */
#define SAFBC_PROTECT_DIRTY_SAF_PROT_DIRTY_0_Msk (0x1U << SAFBC_PROTECT_DIRTY_SAF_PROT_DIRTY_0_Pos)  /**< (SAFBC_PROTECT_DIRTY) Indicates whether contents of Region 0 have been changed.         0=There has been no Write or Erase performed in this region since this bit was last cleared.         1=A Write or Erase has been performed in this region since this bit was last cleared. Mask */
#define SAFBC_PROTECT_DIRTY_SAF_PROT_DIRTY_1_Pos (1)                                            /**< (SAFBC_PROTECT_DIRTY) Indicates whether contents of Region 1 have been changed.         0=There has been no Write or Erase performed in this region since this bit was last cleared.         1=A Write or Erase has been performed in this region since this bit was last cleared. Position */
#define SAFBC_PROTECT_DIRTY_SAF_PROT_DIRTY_1_Msk (0x1U << SAFBC_PROTECT_DIRTY_SAF_PROT_DIRTY_1_Pos)  /**< (SAFBC_PROTECT_DIRTY) Indicates whether contents of Region 1 have been changed.         0=There has been no Write or Erase performed in this region since this bit was last cleared.         1=A Write or Erase has been performed in this region since this bit was last cleared. Mask */
#define SAFBC_PROTECT_DIRTY_SAF_PROT_DIRTY_2_Pos (2)                                            /**< (SAFBC_PROTECT_DIRTY) Indicates whether contents of Region 2 have been changed.         0=There has been no Write or Erase performed in this region since this bit was last cleared.         1=A Write or Erase has been performed in this region since this bit was last cleared. Position */
#define SAFBC_PROTECT_DIRTY_SAF_PROT_DIRTY_2_Msk (0x1U << SAFBC_PROTECT_DIRTY_SAF_PROT_DIRTY_2_Pos)  /**< (SAFBC_PROTECT_DIRTY) Indicates whether contents of Region 2 have been changed.         0=There has been no Write or Erase performed in this region since this bit was last cleared.         1=A Write or Erase has been performed in this region since this bit was last cleared. Mask */
#define SAFBC_PROTECT_DIRTY_SAF_PROT_DIRTY_3_Pos (3)                                            /**< (SAFBC_PROTECT_DIRTY) Indicates whether contents of Region 3 have been changed.         0=There has been no Write or Erase performed in this region since this bit was last cleared.         1=A Write or Erase has been performed in this region since this bit was last cleared. Position */
#define SAFBC_PROTECT_DIRTY_SAF_PROT_DIRTY_3_Msk (0x1U << SAFBC_PROTECT_DIRTY_SAF_PROT_DIRTY_3_Pos)  /**< (SAFBC_PROTECT_DIRTY) Indicates whether contents of Region 3 have been changed.         0=There has been no Write or Erase performed in this region since this bit was last cleared.         1=A Write or Erase has been performed in this region since this bit was last cleared. Mask */
#define SAFBC_PROTECT_DIRTY_SAF_PROT_DIRTY_4_Pos (4)                                            /**< (SAFBC_PROTECT_DIRTY) Indicates whether contents of Region 4 have been changed.         0=There has been no Write or Erase performed in this region since this bit was last cleared.         1=A Write or Erase has been performed in this region since this bit was last cleared. Position */
#define SAFBC_PROTECT_DIRTY_SAF_PROT_DIRTY_4_Msk (0x1U << SAFBC_PROTECT_DIRTY_SAF_PROT_DIRTY_4_Pos)  /**< (SAFBC_PROTECT_DIRTY) Indicates whether contents of Region 4 have been changed.         0=There has been no Write or Erase performed in this region since this bit was last cleared.         1=A Write or Erase has been performed in this region since this bit was last cleared. Mask */
#define SAFBC_PROTECT_DIRTY_SAF_PROT_DIRTY_5_Pos (5)                                            /**< (SAFBC_PROTECT_DIRTY) Indicates whether contents of Region 5 have been changed.         0=There has been no Write or Erase performed in this region since this bit was last cleared.         1=A Write or Erase has been performed in this region since this bit was last cleared. Position */
#define SAFBC_PROTECT_DIRTY_SAF_PROT_DIRTY_5_Msk (0x1U << SAFBC_PROTECT_DIRTY_SAF_PROT_DIRTY_5_Pos)  /**< (SAFBC_PROTECT_DIRTY) Indicates whether contents of Region 5 have been changed.         0=There has been no Write or Erase performed in this region since this bit was last cleared.         1=A Write or Erase has been performed in this region since this bit was last cleared. Mask */
#define SAFBC_PROTECT_DIRTY_SAF_PROT_DIRTY_6_Pos (6)                                            /**< (SAFBC_PROTECT_DIRTY) Indicates whether contents of Region 6 have been changed.         0=There has been no Write or Erase performed in this region since this bit was last cleared.         1=A Write or Erase has been performed in this region since this bit was last cleared. Position */
#define SAFBC_PROTECT_DIRTY_SAF_PROT_DIRTY_6_Msk (0x1U << SAFBC_PROTECT_DIRTY_SAF_PROT_DIRTY_6_Pos)  /**< (SAFBC_PROTECT_DIRTY) Indicates whether contents of Region 6 have been changed.         0=There has been no Write or Erase performed in this region since this bit was last cleared.         1=A Write or Erase has been performed in this region since this bit was last cleared. Mask */
#define SAFBC_PROTECT_DIRTY_SAF_PROT_DIRTY_7_Pos (7)                                            /**< (SAFBC_PROTECT_DIRTY) Indicates whether contents of Region 7 have been changed.         0=There has been no Write or Erase performed in this region since this bit was last cleared.         1=A Write or Erase has been performed in this region since this bit was last cleared. Position */
#define SAFBC_PROTECT_DIRTY_SAF_PROT_DIRTY_7_Msk (0x1U << SAFBC_PROTECT_DIRTY_SAF_PROT_DIRTY_7_Pos)  /**< (SAFBC_PROTECT_DIRTY) Indicates whether contents of Region 7 have been changed.         0=There has been no Write or Erase performed in this region since this bit was last cleared.         1=A Write or Erase has been performed in this region since this bit was last cleared. Mask */
#define SAFBC_PROTECT_DIRTY_SAF_PROT_DIRTY_8_Pos (8)                                            /**< (SAFBC_PROTECT_DIRTY) Indicates whether contents of Region 8 have been changed.         0=There has been no Write or Erase performed in this region since this bit was last cleared.         1=A Write or Erase has been performed in this region since this bit was last cleared. Position */
#define SAFBC_PROTECT_DIRTY_SAF_PROT_DIRTY_8_Msk (0x1U << SAFBC_PROTECT_DIRTY_SAF_PROT_DIRTY_8_Pos)  /**< (SAFBC_PROTECT_DIRTY) Indicates whether contents of Region 8 have been changed.         0=There has been no Write or Erase performed in this region since this bit was last cleared.         1=A Write or Erase has been performed in this region since this bit was last cleared. Mask */
#define SAFBC_PROTECT_DIRTY_SAF_PROT_DIRTY_9_Pos (9)                                            /**< (SAFBC_PROTECT_DIRTY) Indicates whether contents of Region 9 have been changed.         0=There has been no Write or Erase performed in this region since this bit was last cleared.         1=A Write or Erase has been performed in this region since this bit was last cleared. Position */
#define SAFBC_PROTECT_DIRTY_SAF_PROT_DIRTY_9_Msk (0x1U << SAFBC_PROTECT_DIRTY_SAF_PROT_DIRTY_9_Pos)  /**< (SAFBC_PROTECT_DIRTY) Indicates whether contents of Region 9 have been changed.         0=There has been no Write or Erase performed in this region since this bit was last cleared.         1=A Write or Erase has been performed in this region since this bit was last cleared. Mask */
#define SAFBC_PROTECT_DIRTY_SAF_PROT_DIRTY_10_Pos (10)                                           /**< (SAFBC_PROTECT_DIRTY) Indicates whether contents of Region 10 have been changed.         0=There has been no Write or Erase performed in this region since this bit was last cleared.         1=A Write or Erase has been performed in this region since this bit was last cleared. Position */
#define SAFBC_PROTECT_DIRTY_SAF_PROT_DIRTY_10_Msk (0x1U << SAFBC_PROTECT_DIRTY_SAF_PROT_DIRTY_10_Pos)  /**< (SAFBC_PROTECT_DIRTY) Indicates whether contents of Region 10 have been changed.         0=There has been no Write or Erase performed in this region since this bit was last cleared.         1=A Write or Erase has been performed in this region since this bit was last cleared. Mask */
#define SAFBC_PROTECT_DIRTY_SAF_PROT_DIRTY_11_Pos (11)                                           /**< (SAFBC_PROTECT_DIRTY) Indicates whether contents of Region 11 have been changed.         0=There has been no Write or Erase performed in this region since this bit was last cleared.         1=A Write or Erase has been performed in this region since this bit was last cleared. Position */
#define SAFBC_PROTECT_DIRTY_SAF_PROT_DIRTY_11_Msk (0x1U << SAFBC_PROTECT_DIRTY_SAF_PROT_DIRTY_11_Pos)  /**< (SAFBC_PROTECT_DIRTY) Indicates whether contents of Region 11 have been changed.         0=There has been no Write or Erase performed in this region since this bit was last cleared.         1=A Write or Erase has been performed in this region since this bit was last cleared. Mask */
#define SAFBC_PROTECT_DIRTY_Msk               (0x00000FFFUL)                                 /**< (SAFBC_PROTECT_DIRTY) Register Mask  */
#define SAFBC_PROTECT_DIRTY_SAF_PROT_DIRTY__Pos (0)                                            /**< (SAFBC_PROTECT_DIRTY Position) Indicates whether contents of Region xx have been changed.         x=There has been no Write or Erase performed in this region since this bit was last cleared.         x=A Write or Erase has been performed in this region since this bit was last cleared. */
#define SAFBC_PROTECT_DIRTY_SAF_PROT_DIRTY__Msk (0xFFFU << SAFBC_PROTECT_DIRTY_SAF_PROT_DIRTY__Pos)  /**< (SAFBC_PROTECT_DIRTY Mask) SAF_PROT_DIRTY_ */
#define SAFBC_PROTECT_DIRTY_SAF_PROT_DIRTY_(value) (SAFBC_PROTECT_DIRTY_SAF_PROT_DIRTY__Msk & ((value) << SAFBC_PROTECT_DIRTY_SAF_PROT_DIRTY__Pos))

/* -------- SAFBC_TAGMAP0 : (SAFBC Offset: 0x78) (R/W 32) The default values in this register match hard-wired assignments made in the Chipset for eSPI     Tag values 0h through 7h. A default value of 7 indicates a non-existent map entry, for a Tag value     which should never happen. -------- */

typedef union
{
  struct
  {
    uint32_t STM_0:3;                   /**< bit:   0..2  This bit contains the mapping of the 4-bit eSPI Tag value 0h to its 3-bit Protection Master         number. */
    uint32_t :1;                        /**< bit:      3  Reserved                                      */
    uint32_t STM_1:3;                   /**< bit:   4..6  This bit contains the mapping of the 4-bit eSPI Tag value 1h to its 3-bit Protection Master         number. */
    uint32_t :1;                        /**< bit:      7  Reserved                                      */
    uint32_t STM_2:3;                   /**< bit:  8..10  This bit contains the mapping of the 4-bit eSPI Tag value 2h to its 3-bit Protection Master         number. */
    uint32_t :1;                        /**< bit:     11  Reserved                                      */
    uint32_t STM_3:3;                   /**< bit: 12..14  This bit contains the mapping of the 4-bit eSPI Tag value 3h to its 3-bit Protection Master         number. */
    uint32_t :1;                        /**< bit:     15  Reserved                                      */
    uint32_t STM_4:3;                   /**< bit: 16..18  This bit contains the mapping of the 4-bit eSPI Tag value 4h to its 3-bit Protection Master         number. */
    uint32_t :1;                        /**< bit:     19  Reserved                                      */
    uint32_t STM_5:3;                   /**< bit: 20..22  This bit contains the mapping of the 4-bit eSPI Tag value 5h to its 3-bit Protection Master         number. */
    uint32_t :1;                        /**< bit:     23  Reserved                                      */
    uint32_t STM_6:3;                   /**< bit: 24..26  This bit contains the mapping of the 4-bit eSPI Tag value 6h to its 3-bit Protection Master         number. */
    uint32_t :1;                        /**< bit:     27  Reserved                                      */
    uint32_t STM_7:3;                   /**< bit: 28..30  This bit contains the mapping of the 4-bit eSPI Tag value 7h to its 3-bit Protection Master         number. */
    uint32_t :1;                        /**< bit:     31  Reserved                                      */
  };
  uint32_t w;
} __SAFBC_TAGMAP0_bits_t;
#define SAFBC_TAGMAP0_RESETVALUE            (0x23221100U)                                 /**<  (SAFBC_TAGMAP0) The default values in this register match hard-wired assignments made in the Chipset for eSPI     Tag values 0h through 7h. A default value of 7 indicates a non-existent map entry, for a Tag value     which should never happen.  Reset Value */

#define SAFBC_TAGMAP0_STM_0_Pos               (0)                                            /**< (SAFBC_TAGMAP0) This bit contains the mapping of the 4-bit eSPI Tag value 0h to its 3-bit Protection Master         number. Position */
#define SAFBC_TAGMAP0_STM_0_Msk               (0x7U << SAFBC_TAGMAP0_STM_0_Pos)              /**< (SAFBC_TAGMAP0) This bit contains the mapping of the 4-bit eSPI Tag value 0h to its 3-bit Protection Master         number. Mask */
#define SAFBC_TAGMAP0_STM_0(value)            (SAFBC_TAGMAP0_STM_0_Msk & ((value) << SAFBC_TAGMAP0_STM_0_Pos))
#define SAFBC_TAGMAP0_STM_1_Pos               (4)                                            /**< (SAFBC_TAGMAP0) This bit contains the mapping of the 4-bit eSPI Tag value 1h to its 3-bit Protection Master         number. Position */
#define SAFBC_TAGMAP0_STM_1_Msk               (0x7U << SAFBC_TAGMAP0_STM_1_Pos)              /**< (SAFBC_TAGMAP0) This bit contains the mapping of the 4-bit eSPI Tag value 1h to its 3-bit Protection Master         number. Mask */
#define SAFBC_TAGMAP0_STM_1(value)            (SAFBC_TAGMAP0_STM_1_Msk & ((value) << SAFBC_TAGMAP0_STM_1_Pos))
#define SAFBC_TAGMAP0_STM_2_Pos               (8)                                            /**< (SAFBC_TAGMAP0) This bit contains the mapping of the 4-bit eSPI Tag value 2h to its 3-bit Protection Master         number. Position */
#define SAFBC_TAGMAP0_STM_2_Msk               (0x7U << SAFBC_TAGMAP0_STM_2_Pos)              /**< (SAFBC_TAGMAP0) This bit contains the mapping of the 4-bit eSPI Tag value 2h to its 3-bit Protection Master         number. Mask */
#define SAFBC_TAGMAP0_STM_2(value)            (SAFBC_TAGMAP0_STM_2_Msk & ((value) << SAFBC_TAGMAP0_STM_2_Pos))
#define SAFBC_TAGMAP0_STM_3_Pos               (12)                                           /**< (SAFBC_TAGMAP0) This bit contains the mapping of the 4-bit eSPI Tag value 3h to its 3-bit Protection Master         number. Position */
#define SAFBC_TAGMAP0_STM_3_Msk               (0x7U << SAFBC_TAGMAP0_STM_3_Pos)              /**< (SAFBC_TAGMAP0) This bit contains the mapping of the 4-bit eSPI Tag value 3h to its 3-bit Protection Master         number. Mask */
#define SAFBC_TAGMAP0_STM_3(value)            (SAFBC_TAGMAP0_STM_3_Msk & ((value) << SAFBC_TAGMAP0_STM_3_Pos))
#define SAFBC_TAGMAP0_STM_4_Pos               (16)                                           /**< (SAFBC_TAGMAP0) This bit contains the mapping of the 4-bit eSPI Tag value 4h to its 3-bit Protection Master         number. Position */
#define SAFBC_TAGMAP0_STM_4_Msk               (0x7U << SAFBC_TAGMAP0_STM_4_Pos)              /**< (SAFBC_TAGMAP0) This bit contains the mapping of the 4-bit eSPI Tag value 4h to its 3-bit Protection Master         number. Mask */
#define SAFBC_TAGMAP0_STM_4(value)            (SAFBC_TAGMAP0_STM_4_Msk & ((value) << SAFBC_TAGMAP0_STM_4_Pos))
#define SAFBC_TAGMAP0_STM_5_Pos               (20)                                           /**< (SAFBC_TAGMAP0) This bit contains the mapping of the 4-bit eSPI Tag value 5h to its 3-bit Protection Master         number. Position */
#define SAFBC_TAGMAP0_STM_5_Msk               (0x7U << SAFBC_TAGMAP0_STM_5_Pos)              /**< (SAFBC_TAGMAP0) This bit contains the mapping of the 4-bit eSPI Tag value 5h to its 3-bit Protection Master         number. Mask */
#define SAFBC_TAGMAP0_STM_5(value)            (SAFBC_TAGMAP0_STM_5_Msk & ((value) << SAFBC_TAGMAP0_STM_5_Pos))
#define SAFBC_TAGMAP0_STM_6_Pos               (24)                                           /**< (SAFBC_TAGMAP0) This bit contains the mapping of the 4-bit eSPI Tag value 6h to its 3-bit Protection Master         number. Position */
#define SAFBC_TAGMAP0_STM_6_Msk               (0x7U << SAFBC_TAGMAP0_STM_6_Pos)              /**< (SAFBC_TAGMAP0) This bit contains the mapping of the 4-bit eSPI Tag value 6h to its 3-bit Protection Master         number. Mask */
#define SAFBC_TAGMAP0_STM_6(value)            (SAFBC_TAGMAP0_STM_6_Msk & ((value) << SAFBC_TAGMAP0_STM_6_Pos))
#define SAFBC_TAGMAP0_STM_7_Pos               (28)                                           /**< (SAFBC_TAGMAP0) This bit contains the mapping of the 4-bit eSPI Tag value 7h to its 3-bit Protection Master         number. Position */
#define SAFBC_TAGMAP0_STM_7_Msk               (0x7U << SAFBC_TAGMAP0_STM_7_Pos)              /**< (SAFBC_TAGMAP0) This bit contains the mapping of the 4-bit eSPI Tag value 7h to its 3-bit Protection Master         number. Mask */
#define SAFBC_TAGMAP0_STM_7(value)            (SAFBC_TAGMAP0_STM_7_Msk & ((value) << SAFBC_TAGMAP0_STM_7_Pos))
#define SAFBC_TAGMAP0_Msk                     (0x77777777UL)                                 /**< (SAFBC_TAGMAP0) Register Mask  */

/* -------- SAFBC_TAGMAP1 : (SAFBC Offset: 0x7c) (R/W 32) The default values in this register match hard-wired assignments made in the Chipset for eSPI Tag     values 8h through Fh. A default value of 7 indicates a non-existent map entry, for a Tag value which     should never happen. -------- */

