ranjithaguna/pv/LED_Demo/source/pic32cx/component/safbc.h
typedef union
{
  struct
  {
    uint32_t STM_8:3;                   /**< bit:   0..2  This bit contains the mapping of the 4-bit eSPI Tag value 8h to its 3-bit Protection Master         number. */
    uint32_t :1;                        /**< bit:      3  Reserved                                      */
    uint32_t STM_9:3;                   /**< bit:   4..6  This bit contains the mapping of the 4-bit eSPI Tag value 9h to its 3-bit Protection Master         number. */
    uint32_t :1;                        /**< bit:      7  Reserved                                      */
    uint32_t STM_A:3;                   /**< bit:  8..10  This bit contains the mapping of the 4-bit eSPI Tag value Ah to its 3-bit Protection Master         number. */
    uint32_t :1;                        /**< bit:     11  Reserved                                      */
    uint32_t STM_B:3;                   /**< bit: 12..14  This bit contains the mapping of the 4-bit eSPI Tag value Bh to its 3-bit Protection Master         number. */
    uint32_t :1;                        /**< bit:     15  Reserved                                      */
    uint32_t STM_C:3;                   /**< bit: 16..18  This bit contains the mapping of the 4-bit eSPI Tag value Ch to its 3-bit Protection Master         number. */
    uint32_t :1;                        /**< bit:     19  Reserved                                      */
    uint32_t STM_D:3;                   /**< bit: 20..22  This bit contains the mapping of the 4-bit eSPI Tag value Dh to its 3-bit Protection Master         number. */
    uint32_t :1;                        /**< bit:     23  Reserved                                      */
    uint32_t STM_E:3;                   /**< bit: 24..26  This bit contains the mapping of the 4-bit eSPI Tag value Eh to its 3-bit Protection Master         number. */
    uint32_t :1;                        /**< bit:     27  Reserved                                      */
    uint32_t STM_F:3;                   /**< bit: 28..30  This bit contains the mapping of the 4-bit eSPI Tag value Fh to its 3-bit Protection Master         number. */
    uint32_t :1;                        /**< bit:     31  Reserved                                      */
  };
  uint32_t w;
} __SAFBC_TAGMAP1_bits_t;
#define SAFBC_TAGMAP1_RESETVALUE            (0x77677767U)                                 /**<  (SAFBC_TAGMAP1) The default values in this register match hard-wired assignments made in the Chipset for eSPI Tag     values 8h through Fh. A default value of 7 indicates a non-existent map entry, for a Tag value which     should never happen.  Reset Value */

#define SAFBC_TAGMAP1_STM_8_Pos               (0)                                            /**< (SAFBC_TAGMAP1) This bit contains the mapping of the 4-bit eSPI Tag value 8h to its 3-bit Protection Master         number. Position */
#define SAFBC_TAGMAP1_STM_8_Msk               (0x7U << SAFBC_TAGMAP1_STM_8_Pos)              /**< (SAFBC_TAGMAP1) This bit contains the mapping of the 4-bit eSPI Tag value 8h to its 3-bit Protection Master         number. Mask */
#define SAFBC_TAGMAP1_STM_8(value)            (SAFBC_TAGMAP1_STM_8_Msk & ((value) << SAFBC_TAGMAP1_STM_8_Pos))
#define SAFBC_TAGMAP1_STM_9_Pos               (4)                                            /**< (SAFBC_TAGMAP1) This bit contains the mapping of the 4-bit eSPI Tag value 9h to its 3-bit Protection Master         number. Position */
#define SAFBC_TAGMAP1_STM_9_Msk               (0x7U << SAFBC_TAGMAP1_STM_9_Pos)              /**< (SAFBC_TAGMAP1) This bit contains the mapping of the 4-bit eSPI Tag value 9h to its 3-bit Protection Master         number. Mask */
#define SAFBC_TAGMAP1_STM_9(value)            (SAFBC_TAGMAP1_STM_9_Msk & ((value) << SAFBC_TAGMAP1_STM_9_Pos))
#define SAFBC_TAGMAP1_STM_A_Pos               (8)                                            /**< (SAFBC_TAGMAP1) This bit contains the mapping of the 4-bit eSPI Tag value Ah to its 3-bit Protection Master         number. Position */
#define SAFBC_TAGMAP1_STM_A_Msk               (0x7U << SAFBC_TAGMAP1_STM_A_Pos)              /**< (SAFBC_TAGMAP1) This bit contains the mapping of the 4-bit eSPI Tag value Ah to its 3-bit Protection Master         number. Mask */
#define SAFBC_TAGMAP1_STM_A(value)            (SAFBC_TAGMAP1_STM_A_Msk & ((value) << SAFBC_TAGMAP1_STM_A_Pos))
#define SAFBC_TAGMAP1_STM_B_Pos               (12)                                           /**< (SAFBC_TAGMAP1) This bit contains the mapping of the 4-bit eSPI Tag value Bh to its 3-bit Protection Master         number. Position */
#define SAFBC_TAGMAP1_STM_B_Msk               (0x7U << SAFBC_TAGMAP1_STM_B_Pos)              /**< (SAFBC_TAGMAP1) This bit contains the mapping of the 4-bit eSPI Tag value Bh to its 3-bit Protection Master         number. Mask */
#define SAFBC_TAGMAP1_STM_B(value)            (SAFBC_TAGMAP1_STM_B_Msk & ((value) << SAFBC_TAGMAP1_STM_B_Pos))
#define SAFBC_TAGMAP1_STM_C_Pos               (16)                                           /**< (SAFBC_TAGMAP1) This bit contains the mapping of the 4-bit eSPI Tag value Ch to its 3-bit Protection Master         number. Position */
#define SAFBC_TAGMAP1_STM_C_Msk               (0x7U << SAFBC_TAGMAP1_STM_C_Pos)              /**< (SAFBC_TAGMAP1) This bit contains the mapping of the 4-bit eSPI Tag value Ch to its 3-bit Protection Master         number. Mask */
#define SAFBC_TAGMAP1_STM_C(value)            (SAFBC_TAGMAP1_STM_C_Msk & ((value) << SAFBC_TAGMAP1_STM_C_Pos))
#define SAFBC_TAGMAP1_STM_D_Pos               (20)                                           /**< (SAFBC_TAGMAP1) This bit contains the mapping of the 4-bit eSPI Tag value Dh to its 3-bit Protection Master         number. Position */
#define SAFBC_TAGMAP1_STM_D_Msk               (0x7U << SAFBC_TAGMAP1_STM_D_Pos)              /**< (SAFBC_TAGMAP1) This bit contains the mapping of the 4-bit eSPI Tag value Dh to its 3-bit Protection Master         number. Mask */
#define SAFBC_TAGMAP1_STM_D(value)            (SAFBC_TAGMAP1_STM_D_Msk & ((value) << SAFBC_TAGMAP1_STM_D_Pos))
#define SAFBC_TAGMAP1_STM_E_Pos               (24)                                           /**< (SAFBC_TAGMAP1) This bit contains the mapping of the 4-bit eSPI Tag value Eh to its 3-bit Protection Master         number. Position */
#define SAFBC_TAGMAP1_STM_E_Msk               (0x7U << SAFBC_TAGMAP1_STM_E_Pos)              /**< (SAFBC_TAGMAP1) This bit contains the mapping of the 4-bit eSPI Tag value Eh to its 3-bit Protection Master         number. Mask */
#define SAFBC_TAGMAP1_STM_E(value)            (SAFBC_TAGMAP1_STM_E_Msk & ((value) << SAFBC_TAGMAP1_STM_E_Pos))
#define SAFBC_TAGMAP1_STM_F_Pos               (28)                                           /**< (SAFBC_TAGMAP1) This bit contains the mapping of the 4-bit eSPI Tag value Fh to its 3-bit Protection Master         number. Position */
#define SAFBC_TAGMAP1_STM_F_Msk               (0x7U << SAFBC_TAGMAP1_STM_F_Pos)              /**< (SAFBC_TAGMAP1) This bit contains the mapping of the 4-bit eSPI Tag value Fh to its 3-bit Protection Master         number. Mask */
#define SAFBC_TAGMAP1_STM_F(value)            (SAFBC_TAGMAP1_STM_F_Msk & ((value) << SAFBC_TAGMAP1_STM_F_Pos))
#define SAFBC_TAGMAP1_Msk                     (0x77777777UL)                                 /**< (SAFBC_TAGMAP1) Register Mask  */

/* -------- SAFBC_TAGMAP2 : (SAFBC Offset: 0x80) (R/W 32) The default value in bits [2:0] of this register matches the hard-wired assignment made in the     Chipset for accesses made by an EC. After ensuring that all three Tag Map Registers [2:0] contain     valid mappings, the STM_LK bit should be set to '1' to lock them, preventing firmware from     re-assigning them later. -------- */

typedef union
{
  struct
  {
    uint32_t SM_EC:3;                   /**< bit:   0..2  This bit maps the 3-bit Protection Master number assigned to EC Firmware accesses. */
    uint32_t :28;                       /**< bit:  3..30  Reserved                                      */
    uint32_t STM_LK:1;                  /**< bit:     31  1 Locks all bits in the Tag Map Registers, including this bit.              0 (Default) keeps all Tag Map Register fields R/W. */
  };
  uint32_t w;
} __SAFBC_TAGMAP2_bits_t;
