ranjithaguna/pv/LED_Demo/source/pic32cx/component/safbc.h
#define SAFBC_TAGMAP2_RESETVALUE            (0x05U)                                       /**<  (SAFBC_TAGMAP2) The default value in bits [2:0] of this register matches the hard-wired assignment made in the     Chipset for accesses made by an EC. After ensuring that all three Tag Map Registers [2:0] contain     valid mappings, the STM_LK bit should be set to '1' to lock them, preventing firmware from     re-assigning them later.  Reset Value */

#define SAFBC_TAGMAP2_SM_EC_Pos               (0)                                            /**< (SAFBC_TAGMAP2) This bit maps the 3-bit Protection Master number assigned to EC Firmware accesses. Position */
#define SAFBC_TAGMAP2_SM_EC_Msk               (0x7U << SAFBC_TAGMAP2_SM_EC_Pos)              /**< (SAFBC_TAGMAP2) This bit maps the 3-bit Protection Master number assigned to EC Firmware accesses. Mask */
#define SAFBC_TAGMAP2_SM_EC(value)            (SAFBC_TAGMAP2_SM_EC_Msk & ((value) << SAFBC_TAGMAP2_SM_EC_Pos))
#define SAFBC_TAGMAP2_STM_LK_Pos              (31)                                           /**< (SAFBC_TAGMAP2) 1 Locks all bits in the Tag Map Registers, including this bit.              0 (Default) keeps all Tag Map Register fields R/W. Position */
#define SAFBC_TAGMAP2_STM_LK_Msk              (0x1U << SAFBC_TAGMAP2_STM_LK_Pos)             /**< (SAFBC_TAGMAP2) 1 Locks all bits in the Tag Map Registers, including this bit.              0 (Default) keeps all Tag Map Register fields R/W. Mask */
#define SAFBC_TAGMAP2_Msk                     (0x80000007UL)                                 /**< (SAFBC_TAGMAP2) Register Mask  */

/* -------- SAFBC_START00 : (SAFBC Offset: 0x84) (R/W 32) This is Start00 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5). -------- */

typedef union
{
  struct
  {
    uint32_t SAF_PROT_START:20;         /**< bit:  0..19  This field contains the start address of this Region, in units of 4K bytes. */
    uint32_t :12;                       /**< bit: 20..31  Reserved                                      */
  };
  uint32_t w;
} __SAFBC_START00_bits_t;
#define SAFBC_START00_RESETVALUE            (0x7FFFU)                                     /**<  (SAFBC_START00) This is Start00 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5).  Reset Value */

#define SAFBC_START00_SAF_PROT_START_Pos      (0)                                            /**< (SAFBC_START00) This field contains the start address of this Region, in units of 4K bytes. Position */
#define SAFBC_START00_SAF_PROT_START_Msk      (0xFFFFFU << SAFBC_START00_SAF_PROT_START_Pos)  /**< (SAFBC_START00) This field contains the start address of this Region, in units of 4K bytes. Mask */
#define SAFBC_START00_SAF_PROT_START(value)   (SAFBC_START00_SAF_PROT_START_Msk & ((value) << SAFBC_START00_SAF_PROT_START_Pos))
#define SAFBC_START00_Msk                     (0x000FFFFFUL)                                 /**< (SAFBC_START00) Register Mask  */

/* -------- SAFBC_LIMIT00 : (SAFBC Offset: 0x88) (R/W 32) This is Limit00 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5). -------- */

typedef union
{
  struct
  {
    uint32_t SAF_PROT_LIMIT:20;         /**< bit:  0..19  This field contains the limit address of this Region, in units of 4K bytes. The entire 4K         block identified is within the Region: that is, the final byte address is determined by appending         FFFh to this field. */
    uint32_t :12;                       /**< bit: 20..31  Reserved                                      */
  };
  uint32_t w;
} __SAFBC_LIMIT00_bits_t;
#define SAFBC_LIMIT00_RESETVALUE            (0x00U)                                       /**<  (SAFBC_LIMIT00) This is Limit00 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5).  Reset Value */

#define SAFBC_LIMIT00_SAF_PROT_LIMIT_Pos      (0)                                            /**< (SAFBC_LIMIT00) This field contains the limit address of this Region, in units of 4K bytes. The entire 4K         block identified is within the Region: that is, the final byte address is determined by appending         FFFh to this field. Position */
#define SAFBC_LIMIT00_SAF_PROT_LIMIT_Msk      (0xFFFFFU << SAFBC_LIMIT00_SAF_PROT_LIMIT_Pos)  /**< (SAFBC_LIMIT00) This field contains the limit address of this Region, in units of 4K bytes. The entire 4K         block identified is within the Region: that is, the final byte address is determined by appending         FFFh to this field. Mask */
#define SAFBC_LIMIT00_SAF_PROT_LIMIT(value)   (SAFBC_LIMIT00_SAF_PROT_LIMIT_Msk & ((value) << SAFBC_LIMIT00_SAF_PROT_LIMIT_Pos))
#define SAFBC_LIMIT00_Msk                     (0x000FFFFFUL)                                 /**< (SAFBC_LIMIT00) Register Mask  */

