ranjithaguna/pv/LED_Demo/source/pic32cx/component/safbc.h
/* -------- SAFBC_WRITE00 : (SAFBC Offset: 0x8c) (R/W 32) This is Write00 register. It applies to the region defined by the associated [RR] Start and     Limit registers. Bits at positions [0]--[7] grant Write/Erase permission to Permission Masters     numbered 0--7 respectively. -------- */

typedef union
{
  struct
  {
    uint32_t SAF_PROT_WR0:1;            /**< bit:      0  This bit contains the permission for Write or Erase access by Protection Master 0 to this         Region. It is a read-only '1' placeholder because Protection Master 0 has full access to all         Flash locations.          1=Protection Master 0 may always Write and Erase in this region. */
    uint32_t SAF_PROT_WR1:1;            /**< bit:      1  This bit contains the permission for Write or Erase access by Protection Master 1 to this         Region.          0=Protection Master 1 may not Write or Erase in this region.         1=Protection Master 1 may Write and Erase in this region. */
    uint32_t SAF_PROT_WR2:1;            /**< bit:      2  This bit contains the permission for Write or Erase access by Protection Master 2 to this         Region.          0=Protection Master 2 may not Write or Erase in this region.         1=Protection Master 2 may Write and Erase in this region. */
    uint32_t SAF_PROT_WR3:1;            /**< bit:      3  This bit contains the permission for Write or Erase access by Protection Master 3 to this         Region.          0=Protection Master 3 may not Write or Erase in this region.         1=Protection Master 3 may Write and Erase in this region. */
    uint32_t SAF_PROT_WR4:1;            /**< bit:      4  This bit contains the permission for Write or Erase access by Protection Master 4 to this         Region.          0=Protection Master 4 may not Write or Erase in this region.         1=Protection Master 4 may Write and Erase in this region. */
    uint32_t SAF_PROT_WR5:1;            /**< bit:      5  This bit contains the permission for Write or Erase access by Protection Master 5 to this         Region.          0=Protection Master 5 may not Write or Erase in this region.         1=Protection Master 5 may Write and Erase in this region. */
    uint32_t SAF_PROT_WR6:1;            /**< bit:      6  This bit contains the permission for Write or Erase access by Protection Master 6 to this         Region.          0=Protection Master 6 may not Write or Erase in this region.         1=Protection Master 6 may Write and Erase in this region. */
    uint32_t SAF_PROT_WR7:1;            /**< bit:      7  This bit contains the permission for Write or Erase access by Protection Master 7 to this         Region.          0=Protection Master 7 may not Write or Erase in this region.         1=Protection Master 7 may Write and Erase in this region. */
    uint32_t :24;                       /**< bit:  8..31  Reserved                                      */
  };
  struct
  {
    uint32_t SAF_PROT_WR:8;             /**< bit:   0..7  This bit contains the permission for Write or Erase access by Protection Master 7 to this         Region.          x=Protection Master 7 may not Write or Erase in this region.         x=Protection Master 7 may Write and Erase in this region. */
    uint32_t :24;                       /**< bit:  8..31  Reserved                                      */
  };
  uint32_t w;
} __SAFBC_WRITE00_bits_t;
#define SAFBC_WRITE00_RESETVALUE            (0x01U)                                       /**<  (SAFBC_WRITE00) This is Write00 register. It applies to the region defined by the associated [RR] Start and     Limit registers. Bits at positions [0]--[7] grant Write/Erase permission to Permission Masters     numbered 0--7 respectively.  Reset Value */

#define SAFBC_WRITE00_SAF_PROT_WR0_Pos        (0)                                            /**< (SAFBC_WRITE00) This bit contains the permission for Write or Erase access by Protection Master 0 to this         Region. It is a read-only '1' placeholder because Protection Master 0 has full access to all         Flash locations.          1=Protection Master 0 may always Write and Erase in this region. Position */
#define SAFBC_WRITE00_SAF_PROT_WR0_Msk        (0x1U << SAFBC_WRITE00_SAF_PROT_WR0_Pos)       /**< (SAFBC_WRITE00) This bit contains the permission for Write or Erase access by Protection Master 0 to this         Region. It is a read-only '1' placeholder because Protection Master 0 has full access to all         Flash locations.          1=Protection Master 0 may always Write and Erase in this region. Mask */
#define SAFBC_WRITE00_SAF_PROT_WR1_Pos        (1)                                            /**< (SAFBC_WRITE00) This bit contains the permission for Write or Erase access by Protection Master 1 to this         Region.          0=Protection Master 1 may not Write or Erase in this region.         1=Protection Master 1 may Write and Erase in this region. Position */
#define SAFBC_WRITE00_SAF_PROT_WR1_Msk        (0x1U << SAFBC_WRITE00_SAF_PROT_WR1_Pos)       /**< (SAFBC_WRITE00) This bit contains the permission for Write or Erase access by Protection Master 1 to this         Region.          0=Protection Master 1 may not Write or Erase in this region.         1=Protection Master 1 may Write and Erase in this region. Mask */
#define SAFBC_WRITE00_SAF_PROT_WR2_Pos        (2)                                            /**< (SAFBC_WRITE00) This bit contains the permission for Write or Erase access by Protection Master 2 to this         Region.          0=Protection Master 2 may not Write or Erase in this region.         1=Protection Master 2 may Write and Erase in this region. Position */
#define SAFBC_WRITE00_SAF_PROT_WR2_Msk        (0x1U << SAFBC_WRITE00_SAF_PROT_WR2_Pos)       /**< (SAFBC_WRITE00) This bit contains the permission for Write or Erase access by Protection Master 2 to this         Region.          0=Protection Master 2 may not Write or Erase in this region.         1=Protection Master 2 may Write and Erase in this region. Mask */
#define SAFBC_WRITE00_SAF_PROT_WR3_Pos        (3)                                            /**< (SAFBC_WRITE00) This bit contains the permission for Write or Erase access by Protection Master 3 to this         Region.          0=Protection Master 3 may not Write or Erase in this region.         1=Protection Master 3 may Write and Erase in this region. Position */
#define SAFBC_WRITE00_SAF_PROT_WR3_Msk        (0x1U << SAFBC_WRITE00_SAF_PROT_WR3_Pos)       /**< (SAFBC_WRITE00) This bit contains the permission for Write or Erase access by Protection Master 3 to this         Region.          0=Protection Master 3 may not Write or Erase in this region.         1=Protection Master 3 may Write and Erase in this region. Mask */
#define SAFBC_WRITE00_SAF_PROT_WR4_Pos        (4)                                            /**< (SAFBC_WRITE00) This bit contains the permission for Write or Erase access by Protection Master 4 to this         Region.          0=Protection Master 4 may not Write or Erase in this region.         1=Protection Master 4 may Write and Erase in this region. Position */
#define SAFBC_WRITE00_SAF_PROT_WR4_Msk        (0x1U << SAFBC_WRITE00_SAF_PROT_WR4_Pos)       /**< (SAFBC_WRITE00) This bit contains the permission for Write or Erase access by Protection Master 4 to this         Region.          0=Protection Master 4 may not Write or Erase in this region.         1=Protection Master 4 may Write and Erase in this region. Mask */
#define SAFBC_WRITE00_SAF_PROT_WR5_Pos        (5)                                            /**< (SAFBC_WRITE00) This bit contains the permission for Write or Erase access by Protection Master 5 to this         Region.          0=Protection Master 5 may not Write or Erase in this region.         1=Protection Master 5 may Write and Erase in this region. Position */
#define SAFBC_WRITE00_SAF_PROT_WR5_Msk        (0x1U << SAFBC_WRITE00_SAF_PROT_WR5_Pos)       /**< (SAFBC_WRITE00) This bit contains the permission for Write or Erase access by Protection Master 5 to this         Region.          0=Protection Master 5 may not Write or Erase in this region.         1=Protection Master 5 may Write and Erase in this region. Mask */
#define SAFBC_WRITE00_SAF_PROT_WR6_Pos        (6)                                            /**< (SAFBC_WRITE00) This bit contains the permission for Write or Erase access by Protection Master 6 to this         Region.          0=Protection Master 6 may not Write or Erase in this region.         1=Protection Master 6 may Write and Erase in this region. Position */
#define SAFBC_WRITE00_SAF_PROT_WR6_Msk        (0x1U << SAFBC_WRITE00_SAF_PROT_WR6_Pos)       /**< (SAFBC_WRITE00) This bit contains the permission for Write or Erase access by Protection Master 6 to this         Region.          0=Protection Master 6 may not Write or Erase in this region.         1=Protection Master 6 may Write and Erase in this region. Mask */
#define SAFBC_WRITE00_SAF_PROT_WR7_Pos        (7)                                            /**< (SAFBC_WRITE00) This bit contains the permission for Write or Erase access by Protection Master 7 to this         Region.          0=Protection Master 7 may not Write or Erase in this region.         1=Protection Master 7 may Write and Erase in this region. Position */
#define SAFBC_WRITE00_SAF_PROT_WR7_Msk        (0x1U << SAFBC_WRITE00_SAF_PROT_WR7_Pos)       /**< (SAFBC_WRITE00) This bit contains the permission for Write or Erase access by Protection Master 7 to this         Region.          0=Protection Master 7 may not Write or Erase in this region.         1=Protection Master 7 may Write and Erase in this region. Mask */
#define SAFBC_WRITE00_Msk                     (0x000000FFUL)                                 /**< (SAFBC_WRITE00) Register Mask  */
#define SAFBC_WRITE00_SAF_PROT_WR_Pos         (0)                                            /**< (SAFBC_WRITE00 Position) This bit contains the permission for Write or Erase access by Protection Master 7 to this         Region.          x=Protection Master 7 may not Write or Erase in this region.         x=Protection Master 7 may Write and Erase in this region. */
#define SAFBC_WRITE00_SAF_PROT_WR_Msk         (0xFFU << SAFBC_WRITE00_SAF_PROT_WR_Pos)       /**< (SAFBC_WRITE00 Mask) SAF_PROT_WR */
#define SAFBC_WRITE00_SAF_PROT_WR(value)      (SAFBC_WRITE00_SAF_PROT_WR_Msk & ((value) << SAFBC_WRITE00_SAF_PROT_WR_Pos))

