ranjithaguna/pv/LED_Demo/source/pic32cx/component/safbc.h
#define SAFBC_LIMIT01_SAF_PROT_LIMIT_Pos      (0)                                            /**< (SAFBC_LIMIT01) This field contains the limit address of this Region, in units of 4K bytes. The entire 4K         block identified is within the Region: that is, the final byte address is determined by appending         FFFh to this field. Position */
#define SAFBC_LIMIT01_SAF_PROT_LIMIT_Msk      (0xFFFFFU << SAFBC_LIMIT01_SAF_PROT_LIMIT_Pos)  /**< (SAFBC_LIMIT01) This field contains the limit address of this Region, in units of 4K bytes. The entire 4K         block identified is within the Region: that is, the final byte address is determined by appending         FFFh to this field. Mask */
#define SAFBC_LIMIT01_SAF_PROT_LIMIT(value)   (SAFBC_LIMIT01_SAF_PROT_LIMIT_Msk & ((value) << SAFBC_LIMIT01_SAF_PROT_LIMIT_Pos))
#define SAFBC_LIMIT01_Msk                     (0x000FFFFFUL)                                 /**< (SAFBC_LIMIT01) Register Mask  */

/* -------- SAFBC_WRITE01 : (SAFBC Offset: 0x9c) (R/W 32) This is Write01 register. It applies to the region defined by the associated [RR] Start and     Limit registers. Bits at positions [0]--[7] grant Write/Erase permission to Permission Masters     numbered 0--7 respectively. -------- */

typedef union
{
  struct
  {
    uint32_t SAF_PROT_WR0:1;            /**< bit:      0  This bit contains the permission for Write or Erase access by Protection Master 0 to this         Region. It is a read-only '1' placeholder because Protection Master 0 has full access to all         Flash locations.          1=Protection Master 0 may always Write and Erase in this region. */
    uint32_t SAF_PROT_WR1:1;            /**< bit:      1  This bit contains the permission for Write or Erase access by Protection Master 1 to this         Region.          0=Protection Master 1 may not Write or Erase in this region.         1=Protection Master 1 may Write and Erase in this region. */
    uint32_t SAF_PROT_WR2:1;            /**< bit:      2  This bit contains the permission for Write or Erase access by Protection Master 2 to this         Region.          0=Protection Master 2 may not Write or Erase in this region.         1=Protection Master 2 may Write and Erase in this region. */
    uint32_t SAF_PROT_WR3:1;            /**< bit:      3  This bit contains the permission for Write or Erase access by Protection Master 3 to this         Region.          0=Protection Master 3 may not Write or Erase in this region.         1=Protection Master 3 may Write and Erase in this region. */
    uint32_t SAF_PROT_WR4:1;            /**< bit:      4  This bit contains the permission for Write or Erase access by Protection Master 4 to this         Region.          0=Protection Master 4 may not Write or Erase in this region.         1=Protection Master 4 may Write and Erase in this region. */
    uint32_t SAF_PROT_WR5:1;            /**< bit:      5  This bit contains the permission for Write or Erase access by Protection Master 5 to this         Region.          0=Protection Master 5 may not Write or Erase in this region.         1=Protection Master 5 may Write and Erase in this region. */
    uint32_t SAF_PROT_WR6:1;            /**< bit:      6  This bit contains the permission for Write or Erase access by Protection Master 6 to this         Region.          0=Protection Master 6 may not Write or Erase in this region.         1=Protection Master 6 may Write and Erase in this region. */
    uint32_t SAF_PROT_WR7:1;            /**< bit:      7  This bit contains the permission for Write or Erase access by Protection Master 7 to this         Region.          0=Protection Master 7 may not Write or Erase in this region.         1=Protection Master 7 may Write and Erase in this region. */
    uint32_t :24;                       /**< bit:  8..31  Reserved                                      */
  };
  struct
  {
    uint32_t SAF_PROT_WR:8;             /**< bit:   0..7  This bit contains the permission for Write or Erase access by Protection Master 7 to this         Region.          x=Protection Master 7 may not Write or Erase in this region.         x=Protection Master 7 may Write and Erase in this region. */
    uint32_t :24;                       /**< bit:  8..31  Reserved                                      */
  };
  uint32_t w;
} __SAFBC_WRITE01_bits_t;
#define SAFBC_WRITE01_RESETVALUE            (0x00U)                                       /**<  (SAFBC_WRITE01) This is Write01 register. It applies to the region defined by the associated [RR] Start and     Limit registers. Bits at positions [0]--[7] grant Write/Erase permission to Permission Masters     numbered 0--7 respectively.  Reset Value */

#define SAFBC_WRITE01_SAF_PROT_WR0_Pos        (0)                                            /**< (SAFBC_WRITE01) This bit contains the permission for Write or Erase access by Protection Master 0 to this         Region. It is a read-only '1' placeholder because Protection Master 0 has full access to all         Flash locations.          1=Protection Master 0 may always Write and Erase in this region. Position */
#define SAFBC_WRITE01_SAF_PROT_WR0_Msk        (0x1U << SAFBC_WRITE01_SAF_PROT_WR0_Pos)       /**< (SAFBC_WRITE01) This bit contains the permission for Write or Erase access by Protection Master 0 to this         Region. It is a read-only '1' placeholder because Protection Master 0 has full access to all         Flash locations.          1=Protection Master 0 may always Write and Erase in this region. Mask */
#define SAFBC_WRITE01_SAF_PROT_WR1_Pos        (1)                                            /**< (SAFBC_WRITE01) This bit contains the permission for Write or Erase access by Protection Master 1 to this         Region.          0=Protection Master 1 may not Write or Erase in this region.         1=Protection Master 1 may Write and Erase in this region. Position */
#define SAFBC_WRITE01_SAF_PROT_WR1_Msk        (0x1U << SAFBC_WRITE01_SAF_PROT_WR1_Pos)       /**< (SAFBC_WRITE01) This bit contains the permission for Write or Erase access by Protection Master 1 to this         Region.          0=Protection Master 1 may not Write or Erase in this region.         1=Protection Master 1 may Write and Erase in this region. Mask */
#define SAFBC_WRITE01_SAF_PROT_WR2_Pos        (2)                                            /**< (SAFBC_WRITE01) This bit contains the permission for Write or Erase access by Protection Master 2 to this         Region.          0=Protection Master 2 may not Write or Erase in this region.         1=Protection Master 2 may Write and Erase in this region. Position */
#define SAFBC_WRITE01_SAF_PROT_WR2_Msk        (0x1U << SAFBC_WRITE01_SAF_PROT_WR2_Pos)       /**< (SAFBC_WRITE01) This bit contains the permission for Write or Erase access by Protection Master 2 to this         Region.          0=Protection Master 2 may not Write or Erase in this region.         1=Protection Master 2 may Write and Erase in this region. Mask */
#define SAFBC_WRITE01_SAF_PROT_WR3_Pos        (3)                                            /**< (SAFBC_WRITE01) This bit contains the permission for Write or Erase access by Protection Master 3 to this         Region.          0=Protection Master 3 may not Write or Erase in this region.         1=Protection Master 3 may Write and Erase in this region. Position */
#define SAFBC_WRITE01_SAF_PROT_WR3_Msk        (0x1U << SAFBC_WRITE01_SAF_PROT_WR3_Pos)       /**< (SAFBC_WRITE01) This bit contains the permission for Write or Erase access by Protection Master 3 to this         Region.          0=Protection Master 3 may not Write or Erase in this region.         1=Protection Master 3 may Write and Erase in this region. Mask */
#define SAFBC_WRITE01_SAF_PROT_WR4_Pos        (4)                                            /**< (SAFBC_WRITE01) This bit contains the permission for Write or Erase access by Protection Master 4 to this         Region.          0=Protection Master 4 may not Write or Erase in this region.         1=Protection Master 4 may Write and Erase in this region. Position */
#define SAFBC_WRITE01_SAF_PROT_WR4_Msk        (0x1U << SAFBC_WRITE01_SAF_PROT_WR4_Pos)       /**< (SAFBC_WRITE01) This bit contains the permission for Write or Erase access by Protection Master 4 to this         Region.          0=Protection Master 4 may not Write or Erase in this region.         1=Protection Master 4 may Write and Erase in this region. Mask */
#define SAFBC_WRITE01_SAF_PROT_WR5_Pos        (5)                                            /**< (SAFBC_WRITE01) This bit contains the permission for Write or Erase access by Protection Master 5 to this         Region.          0=Protection Master 5 may not Write or Erase in this region.         1=Protection Master 5 may Write and Erase in this region. Position */
#define SAFBC_WRITE01_SAF_PROT_WR5_Msk        (0x1U << SAFBC_WRITE01_SAF_PROT_WR5_Pos)       /**< (SAFBC_WRITE01) This bit contains the permission for Write or Erase access by Protection Master 5 to this         Region.          0=Protection Master 5 may not Write or Erase in this region.         1=Protection Master 5 may Write and Erase in this region. Mask */
#define SAFBC_WRITE01_SAF_PROT_WR6_Pos        (6)                                            /**< (SAFBC_WRITE01) This bit contains the permission for Write or Erase access by Protection Master 6 to this         Region.          0=Protection Master 6 may not Write or Erase in this region.         1=Protection Master 6 may Write and Erase in this region. Position */
#define SAFBC_WRITE01_SAF_PROT_WR6_Msk        (0x1U << SAFBC_WRITE01_SAF_PROT_WR6_Pos)       /**< (SAFBC_WRITE01) This bit contains the permission for Write or Erase access by Protection Master 6 to this         Region.          0=Protection Master 6 may not Write or Erase in this region.         1=Protection Master 6 may Write and Erase in this region. Mask */
#define SAFBC_WRITE01_SAF_PROT_WR7_Pos        (7)                                            /**< (SAFBC_WRITE01) This bit contains the permission for Write or Erase access by Protection Master 7 to this         Region.          0=Protection Master 7 may not Write or Erase in this region.         1=Protection Master 7 may Write and Erase in this region. Position */
#define SAFBC_WRITE01_SAF_PROT_WR7_Msk        (0x1U << SAFBC_WRITE01_SAF_PROT_WR7_Pos)       /**< (SAFBC_WRITE01) This bit contains the permission for Write or Erase access by Protection Master 7 to this         Region.          0=Protection Master 7 may not Write or Erase in this region.         1=Protection Master 7 may Write and Erase in this region. Mask */
#define SAFBC_WRITE01_Msk                     (0x000000FFUL)                                 /**< (SAFBC_WRITE01) Register Mask  */
#define SAFBC_WRITE01_SAF_PROT_WR_Pos         (0)                                            /**< (SAFBC_WRITE01 Position) This bit contains the permission for Write or Erase access by Protection Master 7 to this         Region.          x=Protection Master 7 may not Write or Erase in this region.         x=Protection Master 7 may Write and Erase in this region. */
#define SAFBC_WRITE01_SAF_PROT_WR_Msk         (0xFFU << SAFBC_WRITE01_SAF_PROT_WR_Pos)       /**< (SAFBC_WRITE01 Mask) SAF_PROT_WR */
#define SAFBC_WRITE01_SAF_PROT_WR(value)      (SAFBC_WRITE01_SAF_PROT_WR_Msk & ((value) << SAFBC_WRITE01_SAF_PROT_WR_Pos))

/* -------- SAFBC_READ01 : (SAFBC Offset: 0xa0) (R/W 32) This is Read01 register. Bits at positions [0]--[7] grant Read permission to Permission     Masters numbered 0--7 respectively. -------- */

typedef union
{
  struct
  {
    uint32_t SAF_PROT_RD0:1;            /**< bit:      0  This bit contains the permission for Read access by Protection Master 0 to this Region.         It is a read-only placeholder because Protection Master 0 has full access to all Flash locations.         1=Protection Master 0 may always Read in this region. */
    uint32_t SAF_PROT_RD1:1;            /**< bit:      1  This bit contains the permission for Read access by Protection Master 1 to this Region.         0=Protection Master 1 may not Read in this region.         1=Protection Master 1 may Read in this region. */
    uint32_t SAF_PROT_RD2:1;            /**< bit:      2  This bit contains the permission for Read access by Protection Master 2 to this Region.         0=Protection Master 2 may not Read in this region.         1=Protection Master 2 may Read in this region. */
    uint32_t SAF_PROT_RD3:1;            /**< bit:      3  This bit contains the permission for Read access by Protection Master 3 to this Region.         0=Protection Master 3 may not Read in this region.         1=Protection Master 3 may Read in this region. */
    uint32_t SAF_PROT_RD4:1;            /**< bit:      4  This bit contains the permission for Read access by Protection Master 4 to this Region.         0=Protection Master 4 may not Read in this region.         1=Protection Master 4 may Read in this region. */
    uint32_t SAF_PROT_RD5:1;            /**< bit:      5  This bit contains the permission for Read access by Protection Master 5 to this Region.         0=Protection Master 5 may not Read in this region.         1=Protection Master 5 may Read in this region. */
    uint32_t SAF_PROT_RD6:1;            /**< bit:      6  This bit contains the permission for Read access by Protection Master 6 to this Region.         0=Protection Master 6 may not Read in this region.         1=Protection Master 6 may Read in this region. */
    uint32_t SAF_PROT_RD7:1;            /**< bit:      7  This bit contains the permission for Read access by Protection Master 7 to this Region.        0=Protection Master 7 may not Read in this region.        1=Protection Master 7 may Read in this region. */
    uint32_t :24;                       /**< bit:  8..31  Reserved                                      */
  };
  struct
  {
    uint32_t SAF_PROT_RD:8;             /**< bit:   0..7  This bit contains the permission for Read access by Protection Master 7 to this Region.        x=Protection Master 7 may not Read in this region.        x=Protection Master 7 may Read in this region. */
    uint32_t :24;                       /**< bit:  8..31  Reserved                                      */
  };
  uint32_t w;
} __SAFBC_READ01_bits_t;
#define SAFBC_READ01_RESETVALUE             (0x00U)                                       /**<  (SAFBC_READ01) This is Read01 register. Bits at positions [0]--[7] grant Read permission to Permission     Masters numbered 0--7 respectively.  Reset Value */

#define SAFBC_READ01_SAF_PROT_RD0_Pos         (0)                                            /**< (SAFBC_READ01) This bit contains the permission for Read access by Protection Master 0 to this Region.         It is a read-only placeholder because Protection Master 0 has full access to all Flash locations.         1=Protection Master 0 may always Read in this region. Position */
#define SAFBC_READ01_SAF_PROT_RD0_Msk         (0x1U << SAFBC_READ01_SAF_PROT_RD0_Pos)        /**< (SAFBC_READ01) This bit contains the permission for Read access by Protection Master 0 to this Region.         It is a read-only placeholder because Protection Master 0 has full access to all Flash locations.         1=Protection Master 0 may always Read in this region. Mask */
#define SAFBC_READ01_SAF_PROT_RD1_Pos         (1)                                            /**< (SAFBC_READ01) This bit contains the permission for Read access by Protection Master 1 to this Region.         0=Protection Master 1 may not Read in this region.         1=Protection Master 1 may Read in this region. Position */
#define SAFBC_READ01_SAF_PROT_RD1_Msk         (0x1U << SAFBC_READ01_SAF_PROT_RD1_Pos)        /**< (SAFBC_READ01) This bit contains the permission for Read access by Protection Master 1 to this Region.         0=Protection Master 1 may not Read in this region.         1=Protection Master 1 may Read in this region. Mask */
#define SAFBC_READ01_SAF_PROT_RD2_Pos         (2)                                            /**< (SAFBC_READ01) This bit contains the permission for Read access by Protection Master 2 to this Region.         0=Protection Master 2 may not Read in this region.         1=Protection Master 2 may Read in this region. Position */
#define SAFBC_READ01_SAF_PROT_RD2_Msk         (0x1U << SAFBC_READ01_SAF_PROT_RD2_Pos)        /**< (SAFBC_READ01) This bit contains the permission for Read access by Protection Master 2 to this Region.         0=Protection Master 2 may not Read in this region.         1=Protection Master 2 may Read in this region. Mask */
#define SAFBC_READ01_SAF_PROT_RD3_Pos         (3)                                            /**< (SAFBC_READ01) This bit contains the permission for Read access by Protection Master 3 to this Region.         0=Protection Master 3 may not Read in this region.         1=Protection Master 3 may Read in this region. Position */
#define SAFBC_READ01_SAF_PROT_RD3_Msk         (0x1U << SAFBC_READ01_SAF_PROT_RD3_Pos)        /**< (SAFBC_READ01) This bit contains the permission for Read access by Protection Master 3 to this Region.         0=Protection Master 3 may not Read in this region.         1=Protection Master 3 may Read in this region. Mask */
#define SAFBC_READ01_SAF_PROT_RD4_Pos         (4)                                            /**< (SAFBC_READ01) This bit contains the permission for Read access by Protection Master 4 to this Region.         0=Protection Master 4 may not Read in this region.         1=Protection Master 4 may Read in this region. Position */
#define SAFBC_READ01_SAF_PROT_RD4_Msk         (0x1U << SAFBC_READ01_SAF_PROT_RD4_Pos)        /**< (SAFBC_READ01) This bit contains the permission for Read access by Protection Master 4 to this Region.         0=Protection Master 4 may not Read in this region.         1=Protection Master 4 may Read in this region. Mask */
#define SAFBC_READ01_SAF_PROT_RD5_Pos         (5)                                            /**< (SAFBC_READ01) This bit contains the permission for Read access by Protection Master 5 to this Region.         0=Protection Master 5 may not Read in this region.         1=Protection Master 5 may Read in this region. Position */
#define SAFBC_READ01_SAF_PROT_RD5_Msk         (0x1U << SAFBC_READ01_SAF_PROT_RD5_Pos)        /**< (SAFBC_READ01) This bit contains the permission for Read access by Protection Master 5 to this Region.         0=Protection Master 5 may not Read in this region.         1=Protection Master 5 may Read in this region. Mask */
#define SAFBC_READ01_SAF_PROT_RD6_Pos         (6)                                            /**< (SAFBC_READ01) This bit contains the permission for Read access by Protection Master 6 to this Region.         0=Protection Master 6 may not Read in this region.         1=Protection Master 6 may Read in this region. Position */
#define SAFBC_READ01_SAF_PROT_RD6_Msk         (0x1U << SAFBC_READ01_SAF_PROT_RD6_Pos)        /**< (SAFBC_READ01) This bit contains the permission for Read access by Protection Master 6 to this Region.         0=Protection Master 6 may not Read in this region.         1=Protection Master 6 may Read in this region. Mask */
#define SAFBC_READ01_SAF_PROT_RD7_Pos         (7)                                            /**< (SAFBC_READ01) This bit contains the permission for Read access by Protection Master 7 to this Region.        0=Protection Master 7 may not Read in this region.        1=Protection Master 7 may Read in this region. Position */
#define SAFBC_READ01_SAF_PROT_RD7_Msk         (0x1U << SAFBC_READ01_SAF_PROT_RD7_Pos)        /**< (SAFBC_READ01) This bit contains the permission for Read access by Protection Master 7 to this Region.        0=Protection Master 7 may not Read in this region.        1=Protection Master 7 may Read in this region. Mask */
#define SAFBC_READ01_Msk                      (0x000000FFUL)                                 /**< (SAFBC_READ01) Register Mask  */
#define SAFBC_READ01_SAF_PROT_RD_Pos          (0)                                            /**< (SAFBC_READ01 Position) This bit contains the permission for Read access by Protection Master 7 to this Region.        x=Protection Master 7 may not Read in this region.        x=Protection Master 7 may Read in this region. */
#define SAFBC_READ01_SAF_PROT_RD_Msk          (0xFFU << SAFBC_READ01_SAF_PROT_RD_Pos)        /**< (SAFBC_READ01 Mask) SAF_PROT_RD */
#define SAFBC_READ01_SAF_PROT_RD(value)       (SAFBC_READ01_SAF_PROT_RD_Msk & ((value) << SAFBC_READ01_SAF_PROT_RD_Pos))

/* -------- SAFBC_START02 : (SAFBC Offset: 0xa4) (R/W 32) This is Start02 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5). -------- */

typedef union
{
  struct
  {
    uint32_t SAF_PROT_START:20;         /**< bit:  0..19  This field contains the start address of this Region, in units of 4K bytes. */
    uint32_t :12;                       /**< bit: 20..31  Reserved                                      */
  };
  uint32_t w;
} __SAFBC_START02_bits_t;
#define SAFBC_START02_RESETVALUE            (0x00U)                                       /**<  (SAFBC_START02) This is Start02 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5).  Reset Value */

#define SAFBC_START02_SAF_PROT_START_Pos      (0)                                            /**< (SAFBC_START02) This field contains the start address of this Region, in units of 4K bytes. Position */
#define SAFBC_START02_SAF_PROT_START_Msk      (0xFFFFFU << SAFBC_START02_SAF_PROT_START_Pos)  /**< (SAFBC_START02) This field contains the start address of this Region, in units of 4K bytes. Mask */
#define SAFBC_START02_SAF_PROT_START(value)   (SAFBC_START02_SAF_PROT_START_Msk & ((value) << SAFBC_START02_SAF_PROT_START_Pos))
#define SAFBC_START02_Msk                     (0x000FFFFFUL)                                 /**< (SAFBC_START02) Register Mask  */

/* -------- SAFBC_LIMIT02 : (SAFBC Offset: 0xa8) (R/W 32) This is Limit02 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5). -------- */

typedef union
{
  struct
  {
    uint32_t SAF_PROT_LIMIT:20;         /**< bit:  0..19  This field contains the limit address of this Region, in units of 4K bytes. The entire 4K         block identified is within the Region: that is, the final byte address is determined by appending         FFFh to this field. */
    uint32_t :12;                       /**< bit: 20..31  Reserved                                      */
  };
  uint32_t w;
} __SAFBC_LIMIT02_bits_t;
