ranjithaguna/pv/LED_Demo/source/pic32cx/component/safbc.h
#define SAFBC_WRITE03_SAF_PROT_WR0_Pos        (0)                                            /**< (SAFBC_WRITE03) This bit contains the permission for Write or Erase access by Protection Master 0 to this         Region. It is a read-only '1' placeholder because Protection Master 0 has full access to all         Flash locations.          1=Protection Master 0 may always Write and Erase in this region. Position */
#define SAFBC_WRITE03_SAF_PROT_WR0_Msk        (0x1U << SAFBC_WRITE03_SAF_PROT_WR0_Pos)       /**< (SAFBC_WRITE03) This bit contains the permission for Write or Erase access by Protection Master 0 to this         Region. It is a read-only '1' placeholder because Protection Master 0 has full access to all         Flash locations.          1=Protection Master 0 may always Write and Erase in this region. Mask */
#define SAFBC_WRITE03_SAF_PROT_WR1_Pos        (1)                                            /**< (SAFBC_WRITE03) This bit contains the permission for Write or Erase access by Protection Master 1 to this         Region.          0=Protection Master 1 may not Write or Erase in this region.         1=Protection Master 1 may Write and Erase in this region. Position */
#define SAFBC_WRITE03_SAF_PROT_WR1_Msk        (0x1U << SAFBC_WRITE03_SAF_PROT_WR1_Pos)       /**< (SAFBC_WRITE03) This bit contains the permission for Write or Erase access by Protection Master 1 to this         Region.          0=Protection Master 1 may not Write or Erase in this region.         1=Protection Master 1 may Write and Erase in this region. Mask */
#define SAFBC_WRITE03_SAF_PROT_WR2_Pos        (2)                                            /**< (SAFBC_WRITE03) This bit contains the permission for Write or Erase access by Protection Master 2 to this         Region.          0=Protection Master 2 may not Write or Erase in this region.         1=Protection Master 2 may Write and Erase in this region. Position */
#define SAFBC_WRITE03_SAF_PROT_WR2_Msk        (0x1U << SAFBC_WRITE03_SAF_PROT_WR2_Pos)       /**< (SAFBC_WRITE03) This bit contains the permission for Write or Erase access by Protection Master 2 to this         Region.          0=Protection Master 2 may not Write or Erase in this region.         1=Protection Master 2 may Write and Erase in this region. Mask */
#define SAFBC_WRITE03_SAF_PROT_WR3_Pos        (3)                                            /**< (SAFBC_WRITE03) This bit contains the permission for Write or Erase access by Protection Master 3 to this         Region.          0=Protection Master 3 may not Write or Erase in this region.         1=Protection Master 3 may Write and Erase in this region. Position */
#define SAFBC_WRITE03_SAF_PROT_WR3_Msk        (0x1U << SAFBC_WRITE03_SAF_PROT_WR3_Pos)       /**< (SAFBC_WRITE03) This bit contains the permission for Write or Erase access by Protection Master 3 to this         Region.          0=Protection Master 3 may not Write or Erase in this region.         1=Protection Master 3 may Write and Erase in this region. Mask */
#define SAFBC_WRITE03_SAF_PROT_WR4_Pos        (4)                                            /**< (SAFBC_WRITE03) This bit contains the permission for Write or Erase access by Protection Master 4 to this         Region.          0=Protection Master 4 may not Write or Erase in this region.         1=Protection Master 4 may Write and Erase in this region. Position */
#define SAFBC_WRITE03_SAF_PROT_WR4_Msk        (0x1U << SAFBC_WRITE03_SAF_PROT_WR4_Pos)       /**< (SAFBC_WRITE03) This bit contains the permission for Write or Erase access by Protection Master 4 to this         Region.          0=Protection Master 4 may not Write or Erase in this region.         1=Protection Master 4 may Write and Erase in this region. Mask */
#define SAFBC_WRITE03_SAF_PROT_WR5_Pos        (5)                                            /**< (SAFBC_WRITE03) This bit contains the permission for Write or Erase access by Protection Master 5 to this         Region.          0=Protection Master 5 may not Write or Erase in this region.         1=Protection Master 5 may Write and Erase in this region. Position */
#define SAFBC_WRITE03_SAF_PROT_WR5_Msk        (0x1U << SAFBC_WRITE03_SAF_PROT_WR5_Pos)       /**< (SAFBC_WRITE03) This bit contains the permission for Write or Erase access by Protection Master 5 to this         Region.          0=Protection Master 5 may not Write or Erase in this region.         1=Protection Master 5 may Write and Erase in this region. Mask */
#define SAFBC_WRITE03_SAF_PROT_WR6_Pos        (6)                                            /**< (SAFBC_WRITE03) This bit contains the permission for Write or Erase access by Protection Master 6 to this         Region.          0=Protection Master 6 may not Write or Erase in this region.         1=Protection Master 6 may Write and Erase in this region. Position */
#define SAFBC_WRITE03_SAF_PROT_WR6_Msk        (0x1U << SAFBC_WRITE03_SAF_PROT_WR6_Pos)       /**< (SAFBC_WRITE03) This bit contains the permission for Write or Erase access by Protection Master 6 to this         Region.          0=Protection Master 6 may not Write or Erase in this region.         1=Protection Master 6 may Write and Erase in this region. Mask */
#define SAFBC_WRITE03_SAF_PROT_WR7_Pos        (7)                                            /**< (SAFBC_WRITE03) This bit contains the permission for Write or Erase access by Protection Master 7 to this         Region.          0=Protection Master 7 may not Write or Erase in this region.         1=Protection Master 7 may Write and Erase in this region. Position */
#define SAFBC_WRITE03_SAF_PROT_WR7_Msk        (0x1U << SAFBC_WRITE03_SAF_PROT_WR7_Pos)       /**< (SAFBC_WRITE03) This bit contains the permission for Write or Erase access by Protection Master 7 to this         Region.          0=Protection Master 7 may not Write or Erase in this region.         1=Protection Master 7 may Write and Erase in this region. Mask */
#define SAFBC_WRITE03_Msk                     (0x000000FFUL)                                 /**< (SAFBC_WRITE03) Register Mask  */
#define SAFBC_WRITE03_SAF_PROT_WR_Pos         (0)                                            /**< (SAFBC_WRITE03 Position) This bit contains the permission for Write or Erase access by Protection Master 7 to this         Region.          x=Protection Master 7 may not Write or Erase in this region.         x=Protection Master 7 may Write and Erase in this region. */
#define SAFBC_WRITE03_SAF_PROT_WR_Msk         (0xFFU << SAFBC_WRITE03_SAF_PROT_WR_Pos)       /**< (SAFBC_WRITE03 Mask) SAF_PROT_WR */
#define SAFBC_WRITE03_SAF_PROT_WR(value)      (SAFBC_WRITE03_SAF_PROT_WR_Msk & ((value) << SAFBC_WRITE03_SAF_PROT_WR_Pos))

/* -------- SAFBC_READ03 : (SAFBC Offset: 0xc0) (R/W 32) This is Read03 register. Bits at positions [0]--[7] grant Read permission to Permission     Masters numbered 0--7 respectively. -------- */

typedef union
{
  struct
  {
    uint32_t SAF_PROT_RD0:1;            /**< bit:      0  This bit contains the permission for Read access by Protection Master 0 to this Region.         It is a read-only placeholder because Protection Master 0 has full access to all Flash locations.         1=Protection Master 0 may always Read in this region. */
    uint32_t SAF_PROT_RD1:1;            /**< bit:      1  This bit contains the permission for Read access by Protection Master 1 to this Region.         0=Protection Master 1 may not Read in this region.         1=Protection Master 1 may Read in this region. */
    uint32_t SAF_PROT_RD2:1;            /**< bit:      2  This bit contains the permission for Read access by Protection Master 2 to this Region.         0=Protection Master 2 may not Read in this region.         1=Protection Master 2 may Read in this region. */
    uint32_t SAF_PROT_RD3:1;            /**< bit:      3  This bit contains the permission for Read access by Protection Master 3 to this Region.         0=Protection Master 3 may not Read in this region.         1=Protection Master 3 may Read in this region. */
    uint32_t SAF_PROT_RD4:1;            /**< bit:      4  This bit contains the permission for Read access by Protection Master 4 to this Region.         0=Protection Master 4 may not Read in this region.         1=Protection Master 4 may Read in this region. */
    uint32_t SAF_PROT_RD5:1;            /**< bit:      5  This bit contains the permission for Read access by Protection Master 5 to this Region.         0=Protection Master 5 may not Read in this region.         1=Protection Master 5 may Read in this region. */
    uint32_t SAF_PROT_RD6:1;            /**< bit:      6  This bit contains the permission for Read access by Protection Master 6 to this Region.         0=Protection Master 6 may not Read in this region.         1=Protection Master 6 may Read in this region. */
    uint32_t SAF_PROT_RD7:1;            /**< bit:      7  This bit contains the permission for Read access by Protection Master 7 to this Region.        0=Protection Master 7 may not Read in this region.        1=Protection Master 7 may Read in this region. */
    uint32_t :24;                       /**< bit:  8..31  Reserved                                      */
  };
  struct
  {
    uint32_t SAF_PROT_RD:8;             /**< bit:   0..7  This bit contains the permission for Read access by Protection Master 7 to this Region.        x=Protection Master 7 may not Read in this region.        x=Protection Master 7 may Read in this region. */
    uint32_t :24;                       /**< bit:  8..31  Reserved                                      */
  };
  uint32_t w;
} __SAFBC_READ03_bits_t;
