ranjithaguna/pv/LED_Demo/source/pic32cx/component/safbc.h
#define SAFBC_READ08_RESETVALUE             (0x00U)                                       /**<  (SAFBC_READ08) This is Read08 register. Bits at positions [0]--[7] grant Read permission to Permission     Masters numbered 0--7 respectively.  Reset Value */

#define SAFBC_READ08_SAF_PROT_RD0_Pos         (0)                                            /**< (SAFBC_READ08) This bit contains the permission for Read access by Protection Master 0 to this Region.         It is a read-only placeholder because Protection Master 0 has full access to all Flash locations.         1=Protection Master 0 may always Read in this region. Position */
#define SAFBC_READ08_SAF_PROT_RD0_Msk         (0x1U << SAFBC_READ08_SAF_PROT_RD0_Pos)        /**< (SAFBC_READ08) This bit contains the permission for Read access by Protection Master 0 to this Region.         It is a read-only placeholder because Protection Master 0 has full access to all Flash locations.         1=Protection Master 0 may always Read in this region. Mask */
#define SAFBC_READ08_SAF_PROT_RD1_Pos         (1)                                            /**< (SAFBC_READ08) This bit contains the permission for Read access by Protection Master 1 to this Region.         0=Protection Master 1 may not Read in this region.         1=Protection Master 1 may Read in this region. Position */
#define SAFBC_READ08_SAF_PROT_RD1_Msk         (0x1U << SAFBC_READ08_SAF_PROT_RD1_Pos)        /**< (SAFBC_READ08) This bit contains the permission for Read access by Protection Master 1 to this Region.         0=Protection Master 1 may not Read in this region.         1=Protection Master 1 may Read in this region. Mask */
#define SAFBC_READ08_SAF_PROT_RD2_Pos         (2)                                            /**< (SAFBC_READ08) This bit contains the permission for Read access by Protection Master 2 to this Region.         0=Protection Master 2 may not Read in this region.         1=Protection Master 2 may Read in this region. Position */
#define SAFBC_READ08_SAF_PROT_RD2_Msk         (0x1U << SAFBC_READ08_SAF_PROT_RD2_Pos)        /**< (SAFBC_READ08) This bit contains the permission for Read access by Protection Master 2 to this Region.         0=Protection Master 2 may not Read in this region.         1=Protection Master 2 may Read in this region. Mask */
#define SAFBC_READ08_SAF_PROT_RD3_Pos         (3)                                            /**< (SAFBC_READ08) This bit contains the permission for Read access by Protection Master 3 to this Region.         0=Protection Master 3 may not Read in this region.         1=Protection Master 3 may Read in this region. Position */
#define SAFBC_READ08_SAF_PROT_RD3_Msk         (0x1U << SAFBC_READ08_SAF_PROT_RD3_Pos)        /**< (SAFBC_READ08) This bit contains the permission for Read access by Protection Master 3 to this Region.         0=Protection Master 3 may not Read in this region.         1=Protection Master 3 may Read in this region. Mask */
#define SAFBC_READ08_SAF_PROT_RD4_Pos         (4)                                            /**< (SAFBC_READ08) This bit contains the permission for Read access by Protection Master 4 to this Region.         0=Protection Master 4 may not Read in this region.         1=Protection Master 4 may Read in this region. Position */
#define SAFBC_READ08_SAF_PROT_RD4_Msk         (0x1U << SAFBC_READ08_SAF_PROT_RD4_Pos)        /**< (SAFBC_READ08) This bit contains the permission for Read access by Protection Master 4 to this Region.         0=Protection Master 4 may not Read in this region.         1=Protection Master 4 may Read in this region. Mask */
#define SAFBC_READ08_SAF_PROT_RD5_Pos         (5)                                            /**< (SAFBC_READ08) This bit contains the permission for Read access by Protection Master 5 to this Region.         0=Protection Master 5 may not Read in this region.         1=Protection Master 5 may Read in this region. Position */
#define SAFBC_READ08_SAF_PROT_RD5_Msk         (0x1U << SAFBC_READ08_SAF_PROT_RD5_Pos)        /**< (SAFBC_READ08) This bit contains the permission for Read access by Protection Master 5 to this Region.         0=Protection Master 5 may not Read in this region.         1=Protection Master 5 may Read in this region. Mask */
#define SAFBC_READ08_SAF_PROT_RD6_Pos         (6)                                            /**< (SAFBC_READ08) This bit contains the permission for Read access by Protection Master 6 to this Region.         0=Protection Master 6 may not Read in this region.         1=Protection Master 6 may Read in this region. Position */
#define SAFBC_READ08_SAF_PROT_RD6_Msk         (0x1U << SAFBC_READ08_SAF_PROT_RD6_Pos)        /**< (SAFBC_READ08) This bit contains the permission for Read access by Protection Master 6 to this Region.         0=Protection Master 6 may not Read in this region.         1=Protection Master 6 may Read in this region. Mask */
#define SAFBC_READ08_SAF_PROT_RD7_Pos         (7)                                            /**< (SAFBC_READ08) This bit contains the permission for Read access by Protection Master 7 to this Region.        0=Protection Master 7 may not Read in this region.        1=Protection Master 7 may Read in this region. Position */
#define SAFBC_READ08_SAF_PROT_RD7_Msk         (0x1U << SAFBC_READ08_SAF_PROT_RD7_Pos)        /**< (SAFBC_READ08) This bit contains the permission for Read access by Protection Master 7 to this Region.        0=Protection Master 7 may not Read in this region.        1=Protection Master 7 may Read in this region. Mask */
#define SAFBC_READ08_Msk                      (0x000000FFUL)                                 /**< (SAFBC_READ08) Register Mask  */
#define SAFBC_READ08_SAF_PROT_RD_Pos          (0)                                            /**< (SAFBC_READ08 Position) This bit contains the permission for Read access by Protection Master 7 to this Region.        x=Protection Master 7 may not Read in this region.        x=Protection Master 7 may Read in this region. */
#define SAFBC_READ08_SAF_PROT_RD_Msk          (0xFFU << SAFBC_READ08_SAF_PROT_RD_Pos)        /**< (SAFBC_READ08 Mask) SAF_PROT_RD */
#define SAFBC_READ08_SAF_PROT_RD(value)       (SAFBC_READ08_SAF_PROT_RD_Msk & ((value) << SAFBC_READ08_SAF_PROT_RD_Pos))

/* -------- SAFBC_START09 : (SAFBC Offset: 0x114) (R/W 32) This is Start09 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5). -------- */

typedef union
{
  struct
  {
    uint32_t SAF_PROT_START:20;         /**< bit:  0..19  This field contains the start address of this Region, in units of 4K bytes. */
    uint32_t :12;                       /**< bit: 20..31  Reserved                                      */
  };
  uint32_t w;
} __SAFBC_START09_bits_t;
#define SAFBC_START09_RESETVALUE            (0x00U)                                       /**<  (SAFBC_START09) This is Start09 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5).  Reset Value */

#define SAFBC_START09_SAF_PROT_START_Pos      (0)                                            /**< (SAFBC_START09) This field contains the start address of this Region, in units of 4K bytes. Position */
#define SAFBC_START09_SAF_PROT_START_Msk      (0xFFFFFU << SAFBC_START09_SAF_PROT_START_Pos)  /**< (SAFBC_START09) This field contains the start address of this Region, in units of 4K bytes. Mask */
#define SAFBC_START09_SAF_PROT_START(value)   (SAFBC_START09_SAF_PROT_START_Msk & ((value) << SAFBC_START09_SAF_PROT_START_Pos))
#define SAFBC_START09_Msk                     (0x000FFFFFUL)                                 /**< (SAFBC_START09) Register Mask  */

