ranjithaguna/pv/LED_Demo/source/pic32cx/component/safbc.h
/* -------- SAFBC_READ12 : (SAFBC Offset: 0x150) (R/W 32) This is Read12 register. Bits at positions [0]--[7] grant Read permission to Permission     Masters numbered 0--7 respectively. -------- */

typedef union
{
  struct
  {
    uint32_t SAF_PROT_RD0:1;            /**< bit:      0  This bit contains the permission for Read access by Protection Master 0 to this Region.         It is a read-only placeholder because Protection Master 0 has full access to all Flash locations.         1=Protection Master 0 may always Read in this region. */
    uint32_t SAF_PROT_RD1:1;            /**< bit:      1  This bit contains the permission for Read access by Protection Master 1 to this Region.         0=Protection Master 1 may not Read in this region.         1=Protection Master 1 may Read in this region. */
    uint32_t SAF_PROT_RD2:1;            /**< bit:      2  This bit contains the permission for Read access by Protection Master 2 to this Region.         0=Protection Master 2 may not Read in this region.         1=Protection Master 2 may Read in this region. */
    uint32_t SAF_PROT_RD3:1;            /**< bit:      3  This bit contains the permission for Read access by Protection Master 3 to this Region.         0=Protection Master 3 may not Read in this region.         1=Protection Master 3 may Read in this region. */
    uint32_t SAF_PROT_RD4:1;            /**< bit:      4  This bit contains the permission for Read access by Protection Master 4 to this Region.         0=Protection Master 4 may not Read in this region.         1=Protection Master 4 may Read in this region. */
    uint32_t SAF_PROT_RD5:1;            /**< bit:      5  This bit contains the permission for Read access by Protection Master 5 to this Region.         0=Protection Master 5 may not Read in this region.         1=Protection Master 5 may Read in this region. */
    uint32_t SAF_PROT_RD6:1;            /**< bit:      6  This bit contains the permission for Read access by Protection Master 6 to this Region.         0=Protection Master 6 may not Read in this region.         1=Protection Master 6 may Read in this region. */
    uint32_t SAF_PROT_RD7:1;            /**< bit:      7  This bit contains the permission for Read access by Protection Master 7 to this Region.        0=Protection Master 7 may not Read in this region.        1=Protection Master 7 may Read in this region. */
    uint32_t :24;                       /**< bit:  8..31  Reserved                                      */
  };
  struct
  {
    uint32_t SAF_PROT_RD:8;             /**< bit:   0..7  This bit contains the permission for Read access by Protection Master 7 to this Region.        x=Protection Master 7 may not Read in this region.        x=Protection Master 7 may Read in this region. */
    uint32_t :24;                       /**< bit:  8..31  Reserved                                      */
  };
  uint32_t w;
} __SAFBC_READ12_bits_t;
#define SAFBC_READ12_RESETVALUE             (0x00U)                                       /**<  (SAFBC_READ12) This is Read12 register. Bits at positions [0]--[7] grant Read permission to Permission     Masters numbered 0--7 respectively.  Reset Value */

#define SAFBC_READ12_SAF_PROT_RD0_Pos         (0)                                            /**< (SAFBC_READ12) This bit contains the permission for Read access by Protection Master 0 to this Region.         It is a read-only placeholder because Protection Master 0 has full access to all Flash locations.         1=Protection Master 0 may always Read in this region. Position */
#define SAFBC_READ12_SAF_PROT_RD0_Msk         (0x1U << SAFBC_READ12_SAF_PROT_RD0_Pos)        /**< (SAFBC_READ12) This bit contains the permission for Read access by Protection Master 0 to this Region.         It is a read-only placeholder because Protection Master 0 has full access to all Flash locations.         1=Protection Master 0 may always Read in this region. Mask */
#define SAFBC_READ12_SAF_PROT_RD1_Pos         (1)                                            /**< (SAFBC_READ12) This bit contains the permission for Read access by Protection Master 1 to this Region.         0=Protection Master 1 may not Read in this region.         1=Protection Master 1 may Read in this region. Position */
#define SAFBC_READ12_SAF_PROT_RD1_Msk         (0x1U << SAFBC_READ12_SAF_PROT_RD1_Pos)        /**< (SAFBC_READ12) This bit contains the permission for Read access by Protection Master 1 to this Region.         0=Protection Master 1 may not Read in this region.         1=Protection Master 1 may Read in this region. Mask */
#define SAFBC_READ12_SAF_PROT_RD2_Pos         (2)                                            /**< (SAFBC_READ12) This bit contains the permission for Read access by Protection Master 2 to this Region.         0=Protection Master 2 may not Read in this region.         1=Protection Master 2 may Read in this region. Position */
#define SAFBC_READ12_SAF_PROT_RD2_Msk         (0x1U << SAFBC_READ12_SAF_PROT_RD2_Pos)        /**< (SAFBC_READ12) This bit contains the permission for Read access by Protection Master 2 to this Region.         0=Protection Master 2 may not Read in this region.         1=Protection Master 2 may Read in this region. Mask */
#define SAFBC_READ12_SAF_PROT_RD3_Pos         (3)                                            /**< (SAFBC_READ12) This bit contains the permission for Read access by Protection Master 3 to this Region.         0=Protection Master 3 may not Read in this region.         1=Protection Master 3 may Read in this region. Position */
#define SAFBC_READ12_SAF_PROT_RD3_Msk         (0x1U << SAFBC_READ12_SAF_PROT_RD3_Pos)        /**< (SAFBC_READ12) This bit contains the permission for Read access by Protection Master 3 to this Region.         0=Protection Master 3 may not Read in this region.         1=Protection Master 3 may Read in this region. Mask */
#define SAFBC_READ12_SAF_PROT_RD4_Pos         (4)                                            /**< (SAFBC_READ12) This bit contains the permission for Read access by Protection Master 4 to this Region.         0=Protection Master 4 may not Read in this region.         1=Protection Master 4 may Read in this region. Position */
#define SAFBC_READ12_SAF_PROT_RD4_Msk         (0x1U << SAFBC_READ12_SAF_PROT_RD4_Pos)        /**< (SAFBC_READ12) This bit contains the permission for Read access by Protection Master 4 to this Region.         0=Protection Master 4 may not Read in this region.         1=Protection Master 4 may Read in this region. Mask */
#define SAFBC_READ12_SAF_PROT_RD5_Pos         (5)                                            /**< (SAFBC_READ12) This bit contains the permission for Read access by Protection Master 5 to this Region.         0=Protection Master 5 may not Read in this region.         1=Protection Master 5 may Read in this region. Position */
#define SAFBC_READ12_SAF_PROT_RD5_Msk         (0x1U << SAFBC_READ12_SAF_PROT_RD5_Pos)        /**< (SAFBC_READ12) This bit contains the permission for Read access by Protection Master 5 to this Region.         0=Protection Master 5 may not Read in this region.         1=Protection Master 5 may Read in this region. Mask */
#define SAFBC_READ12_SAF_PROT_RD6_Pos         (6)                                            /**< (SAFBC_READ12) This bit contains the permission for Read access by Protection Master 6 to this Region.         0=Protection Master 6 may not Read in this region.         1=Protection Master 6 may Read in this region. Position */
#define SAFBC_READ12_SAF_PROT_RD6_Msk         (0x1U << SAFBC_READ12_SAF_PROT_RD6_Pos)        /**< (SAFBC_READ12) This bit contains the permission for Read access by Protection Master 6 to this Region.         0=Protection Master 6 may not Read in this region.         1=Protection Master 6 may Read in this region. Mask */
#define SAFBC_READ12_SAF_PROT_RD7_Pos         (7)                                            /**< (SAFBC_READ12) This bit contains the permission for Read access by Protection Master 7 to this Region.        0=Protection Master 7 may not Read in this region.        1=Protection Master 7 may Read in this region. Position */
#define SAFBC_READ12_SAF_PROT_RD7_Msk         (0x1U << SAFBC_READ12_SAF_PROT_RD7_Pos)        /**< (SAFBC_READ12) This bit contains the permission for Read access by Protection Master 7 to this Region.        0=Protection Master 7 may not Read in this region.        1=Protection Master 7 may Read in this region. Mask */
#define SAFBC_READ12_Msk                      (0x000000FFUL)                                 /**< (SAFBC_READ12) Register Mask  */
#define SAFBC_READ12_SAF_PROT_RD_Pos          (0)                                            /**< (SAFBC_READ12 Position) This bit contains the permission for Read access by Protection Master 7 to this Region.        x=Protection Master 7 may not Read in this region.        x=Protection Master 7 may Read in this region. */
#define SAFBC_READ12_SAF_PROT_RD_Msk          (0xFFU << SAFBC_READ12_SAF_PROT_RD_Pos)        /**< (SAFBC_READ12 Mask) SAF_PROT_RD */
#define SAFBC_READ12_SAF_PROT_RD(value)       (SAFBC_READ12_SAF_PROT_RD_Msk & ((value) << SAFBC_READ12_SAF_PROT_RD_Pos))

/* -------- SAFBC_START13 : (SAFBC Offset: 0x154) (R/W 32) This is Start13 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5). -------- */

typedef union
{
  struct
  {
    uint32_t SAF_PROT_START:20;         /**< bit:  0..19  This field contains the start address of this Region, in units of 4K bytes. */
    uint32_t :12;                       /**< bit: 20..31  Reserved                                      */
  };
  uint32_t w;
} __SAFBC_START13_bits_t;
#define SAFBC_START13_RESETVALUE            (0x00U)                                       /**<  (SAFBC_START13) This is Start13 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5).  Reset Value */

#define SAFBC_START13_SAF_PROT_START_Pos      (0)                                            /**< (SAFBC_START13) This field contains the start address of this Region, in units of 4K bytes. Position */
#define SAFBC_START13_SAF_PROT_START_Msk      (0xFFFFFU << SAFBC_START13_SAF_PROT_START_Pos)  /**< (SAFBC_START13) This field contains the start address of this Region, in units of 4K bytes. Mask */
#define SAFBC_START13_SAF_PROT_START(value)   (SAFBC_START13_SAF_PROT_START_Msk & ((value) << SAFBC_START13_SAF_PROT_START_Pos))
#define SAFBC_START13_Msk                     (0x000FFFFFUL)                                 /**< (SAFBC_START13) Register Mask  */

/* -------- SAFBC_LIMIT13 : (SAFBC Offset: 0x158) (R/W 32) This is Limit13 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5). -------- */

typedef union
{
  struct
  {
    uint32_t SAF_PROT_LIMIT:20;         /**< bit:  0..19  This field contains the limit address of this Region, in units of 4K bytes. The entire 4K         block identified is within the Region: that is, the final byte address is determined by appending         FFFh to this field. */
    uint32_t :12;                       /**< bit: 20..31  Reserved                                      */
  };
  uint32_t w;
} __SAFBC_LIMIT13_bits_t;
