ranjithaguna/pv/LED_Demo/source/pic32cx/component/safbc.h
#define SAFBC_READ16_SAF_PROT_RD0_Pos         (0)                                            /**< (SAFBC_READ16) This bit contains the permission for Read access by Protection Master 0 to this Region.         It is a read-only placeholder because Protection Master 0 has full access to all Flash locations.         1=Protection Master 0 may always Read in this region. Position */
#define SAFBC_READ16_SAF_PROT_RD0_Msk         (0x1U << SAFBC_READ16_SAF_PROT_RD0_Pos)        /**< (SAFBC_READ16) This bit contains the permission for Read access by Protection Master 0 to this Region.         It is a read-only placeholder because Protection Master 0 has full access to all Flash locations.         1=Protection Master 0 may always Read in this region. Mask */
#define SAFBC_READ16_SAF_PROT_RD1_Pos         (1)                                            /**< (SAFBC_READ16) This bit contains the permission for Read access by Protection Master 1 to this Region.         0=Protection Master 1 may not Read in this region.         1=Protection Master 1 may Read in this region. Position */
#define SAFBC_READ16_SAF_PROT_RD1_Msk         (0x1U << SAFBC_READ16_SAF_PROT_RD1_Pos)        /**< (SAFBC_READ16) This bit contains the permission for Read access by Protection Master 1 to this Region.         0=Protection Master 1 may not Read in this region.         1=Protection Master 1 may Read in this region. Mask */
#define SAFBC_READ16_SAF_PROT_RD2_Pos         (2)                                            /**< (SAFBC_READ16) This bit contains the permission for Read access by Protection Master 2 to this Region.         0=Protection Master 2 may not Read in this region.         1=Protection Master 2 may Read in this region. Position */
#define SAFBC_READ16_SAF_PROT_RD2_Msk         (0x1U << SAFBC_READ16_SAF_PROT_RD2_Pos)        /**< (SAFBC_READ16) This bit contains the permission for Read access by Protection Master 2 to this Region.         0=Protection Master 2 may not Read in this region.         1=Protection Master 2 may Read in this region. Mask */
#define SAFBC_READ16_SAF_PROT_RD3_Pos         (3)                                            /**< (SAFBC_READ16) This bit contains the permission for Read access by Protection Master 3 to this Region.         0=Protection Master 3 may not Read in this region.         1=Protection Master 3 may Read in this region. Position */
#define SAFBC_READ16_SAF_PROT_RD3_Msk         (0x1U << SAFBC_READ16_SAF_PROT_RD3_Pos)        /**< (SAFBC_READ16) This bit contains the permission for Read access by Protection Master 3 to this Region.         0=Protection Master 3 may not Read in this region.         1=Protection Master 3 may Read in this region. Mask */
#define SAFBC_READ16_SAF_PROT_RD4_Pos         (4)                                            /**< (SAFBC_READ16) This bit contains the permission for Read access by Protection Master 4 to this Region.         0=Protection Master 4 may not Read in this region.         1=Protection Master 4 may Read in this region. Position */
#define SAFBC_READ16_SAF_PROT_RD4_Msk         (0x1U << SAFBC_READ16_SAF_PROT_RD4_Pos)        /**< (SAFBC_READ16) This bit contains the permission for Read access by Protection Master 4 to this Region.         0=Protection Master 4 may not Read in this region.         1=Protection Master 4 may Read in this region. Mask */
#define SAFBC_READ16_SAF_PROT_RD5_Pos         (5)                                            /**< (SAFBC_READ16) This bit contains the permission for Read access by Protection Master 5 to this Region.         0=Protection Master 5 may not Read in this region.         1=Protection Master 5 may Read in this region. Position */
#define SAFBC_READ16_SAF_PROT_RD5_Msk         (0x1U << SAFBC_READ16_SAF_PROT_RD5_Pos)        /**< (SAFBC_READ16) This bit contains the permission for Read access by Protection Master 5 to this Region.         0=Protection Master 5 may not Read in this region.         1=Protection Master 5 may Read in this region. Mask */
#define SAFBC_READ16_SAF_PROT_RD6_Pos         (6)                                            /**< (SAFBC_READ16) This bit contains the permission for Read access by Protection Master 6 to this Region.         0=Protection Master 6 may not Read in this region.         1=Protection Master 6 may Read in this region. Position */
#define SAFBC_READ16_SAF_PROT_RD6_Msk         (0x1U << SAFBC_READ16_SAF_PROT_RD6_Pos)        /**< (SAFBC_READ16) This bit contains the permission for Read access by Protection Master 6 to this Region.         0=Protection Master 6 may not Read in this region.         1=Protection Master 6 may Read in this region. Mask */
#define SAFBC_READ16_SAF_PROT_RD7_Pos         (7)                                            /**< (SAFBC_READ16) This bit contains the permission for Read access by Protection Master 7 to this Region.        0=Protection Master 7 may not Read in this region.        1=Protection Master 7 may Read in this region. Position */
#define SAFBC_READ16_SAF_PROT_RD7_Msk         (0x1U << SAFBC_READ16_SAF_PROT_RD7_Pos)        /**< (SAFBC_READ16) This bit contains the permission for Read access by Protection Master 7 to this Region.        0=Protection Master 7 may not Read in this region.        1=Protection Master 7 may Read in this region. Mask */
#define SAFBC_READ16_Msk                      (0x000000FFUL)                                 /**< (SAFBC_READ16) Register Mask  */
#define SAFBC_READ16_SAF_PROT_RD_Pos          (0)                                            /**< (SAFBC_READ16 Position) This bit contains the permission for Read access by Protection Master 7 to this Region.        x=Protection Master 7 may not Read in this region.        x=Protection Master 7 may Read in this region. */
#define SAFBC_READ16_SAF_PROT_RD_Msk          (0xFFU << SAFBC_READ16_SAF_PROT_RD_Pos)        /**< (SAFBC_READ16 Mask) SAF_PROT_RD */
#define SAFBC_READ16_SAF_PROT_RD(value)       (SAFBC_READ16_SAF_PROT_RD_Msk & ((value) << SAFBC_READ16_SAF_PROT_RD_Pos))

/* -------- SAFBC_POLL_TOUT : (SAFBC Offset: 0x194) (R/W 32) This is an error timeout value imposed on any consecutive series of Poll-1 commands to a     Flash. The timeout counter starts whenever any new Poll-1 sequence starts, and stops when a     Poll-1 detects Not-BUSY status from the Flash. -------- */

typedef union
{
  struct
  {
    uint32_t POLL_TIMEOUT:18;           /**< bit:  0..17  This field provides a polling timeout value in units of the 32KHz clock. Recommended         value is 5 seconds, expressed as 28000h (163,840 decimal) in this field. */
    uint32_t :14;                       /**< bit: 18..31  Reserved                                      */
  };
  uint32_t w;
} __SAFBC_POLL_TOUT_bits_t;
#define SAFBC_POLL_TOUT_RESETVALUE          (0x00U)                                       /**<  (SAFBC_POLL_TOUT) This is an error timeout value imposed on any consecutive series of Poll-1 commands to a     Flash. The timeout counter starts whenever any new Poll-1 sequence starts, and stops when a     Poll-1 detects Not-BUSY status from the Flash.  Reset Value */

#define SAFBC_POLL_TOUT_POLL_TIMEOUT_Pos      (0)                                            /**< (SAFBC_POLL_TOUT) This field provides a polling timeout value in units of the 32KHz clock. Recommended         value is 5 seconds, expressed as 28000h (163,840 decimal) in this field. Position */
#define SAFBC_POLL_TOUT_POLL_TIMEOUT_Msk      (0x3FFFFU << SAFBC_POLL_TOUT_POLL_TIMEOUT_Pos)  /**< (SAFBC_POLL_TOUT) This field provides a polling timeout value in units of the 32KHz clock. Recommended         value is 5 seconds, expressed as 28000h (163,840 decimal) in this field. Mask */
#define SAFBC_POLL_TOUT_POLL_TIMEOUT(value)   (SAFBC_POLL_TOUT_POLL_TIMEOUT_Msk & ((value) << SAFBC_POLL_TOUT_POLL_TIMEOUT_Pos))
#define SAFBC_POLL_TOUT_Msk                   (0x0003FFFFUL)                                 /**< (SAFBC_POLL_TOUT) Register Mask  */

