ranjithaguna/pv/LED_Demo/source/pic32cx/component/safbc.h
/* -------- SAFBC_POLL_INTERVAL : (SAFBC Offset: 0x198) (R/W 32) This register should be kept zero except for diagnostic purposes. Where needed, it can be set     to provide spacing between consecutive Poll-1 operations to limit the amount of traffic. -------- */

typedef union
{
  struct
  {
    uint32_t POLL_INTRVL:16;            /**< bit:  0..15  This field provides an interval in units of the EC internal clock MCLK. */
    uint32_t :16;                       /**< bit: 16..31  Reserved                                      */
  };
  uint32_t w;
} __SAFBC_POLL_INTERVAL_bits_t;
#define SAFBC_POLL_INTERVAL_RESETVALUE      (0x00U)                                       /**<  (SAFBC_POLL_INTERVAL) This register should be kept zero except for diagnostic purposes. Where needed, it can be set     to provide spacing between consecutive Poll-1 operations to limit the amount of traffic.  Reset Value */

#define SAFBC_POLL_INTERVAL_POLL_INTRVL_Pos   (0)                                            /**< (SAFBC_POLL_INTERVAL) This field provides an interval in units of the EC internal clock MCLK. Position */
#define SAFBC_POLL_INTERVAL_POLL_INTRVL_Msk   (0xFFFFU << SAFBC_POLL_INTERVAL_POLL_INTRVL_Pos)  /**< (SAFBC_POLL_INTERVAL) This field provides an interval in units of the EC internal clock MCLK. Mask */
#define SAFBC_POLL_INTERVAL_POLL_INTRVL(value) (SAFBC_POLL_INTERVAL_POLL_INTRVL_Msk & ((value) << SAFBC_POLL_INTERVAL_POLL_INTRVL_Pos))
#define SAFBC_POLL_INTERVAL_Msk               (0x0000FFFFUL)                                 /**< (SAFBC_POLL_INTERVAL) Register Mask  */

/* -------- SAFBC_TIMEOUT_RESUSP : (SAFBC Offset: 0x19c) (R/W 32) The value placed in this register provides necessary programmable support to a Flash that is     performing an Erase or a Program operation.  When an Erase or Program is started or Resumed, a     Suspend is held off until this time expires.  While an Erase or Program is in process but     Suspended, a Resume is forced when this time expires, even if Read requests are still pending,     causing the Erase or Program operation to continue, and again inhibiting the next Suspend until     it expires again. -------- */

typedef union
{
  struct
  {
    uint32_t SUS_RSM_INTERVAL:16;       /**< bit:  0..15  This field provides an interval value in units of the 32KHz RTC clock. Its value should         be taken from the Flash datasheet parameter that specifies minimum time for an Erase or         Program step to make progress. */
    uint32_t :16;                       /**< bit: 16..31  Reserved                                      */
  };
  uint32_t w;
} __SAFBC_TIMEOUT_RESUSP_bits_t;
#define SAFBC_TIMEOUT_RESUSP_RESETVALUE     (0x01U)                                       /**<  (SAFBC_TIMEOUT_RESUSP) The value placed in this register provides necessary programmable support to a Flash that is     performing an Erase or a Program operation.  When an Erase or Program is started or Resumed, a     Suspend is held off until this time expires.  While an Erase or Program is in process but     Suspended, a Resume is forced when this time expires, even if Read requests are still pending,     causing the Erase or Program operation to continue, and again inhibiting the next Suspend until     it expires again.  Reset Value */

#define SAFBC_TIMEOUT_RESUSP_SUS_RSM_INTERVAL_Pos (0)                                            /**< (SAFBC_TIMEOUT_RESUSP) This field provides an interval value in units of the 32KHz RTC clock. Its value should         be taken from the Flash datasheet parameter that specifies minimum time for an Erase or         Program step to make progress. Position */
#define SAFBC_TIMEOUT_RESUSP_SUS_RSM_INTERVAL_Msk (0xFFFFU << SAFBC_TIMEOUT_RESUSP_SUS_RSM_INTERVAL_Pos)  /**< (SAFBC_TIMEOUT_RESUSP) This field provides an interval value in units of the 32KHz RTC clock. Its value should         be taken from the Flash datasheet parameter that specifies minimum time for an Erase or         Program step to make progress. Mask */
#define SAFBC_TIMEOUT_RESUSP_SUS_RSM_INTERVAL(value) (SAFBC_TIMEOUT_RESUSP_SUS_RSM_INTERVAL_Msk & ((value) << SAFBC_TIMEOUT_RESUSP_SUS_RSM_INTERVAL_Pos))
#define SAFBC_TIMEOUT_RESUSP_Msk              (0x0000FFFFUL)                                 /**< (SAFBC_TIMEOUT_RESUSP) Register Mask  */

/* -------- SAFBC_TIMEOUT_RD_SUSP : (SAFBC Offset: 0x1a0) (R/W 32) This register is used to detect when a series of Read transfers has finished. When this time     expires without any new Read request, any suspended Erase or Program operation is given the     Resume command to continue. -------- */

typedef union
{
  struct
  {
    uint32_t READ_TIMEOUT:20;           /**< bit:  0..19  This field provides a timeout value in units of the EC internal clock MCLK. This value is         tunable for system performance, but a value at or below 20us is suggested. */
    uint32_t :12;                       /**< bit: 20..31  Reserved                                      */
  };
  uint32_t w;
} __SAFBC_TIMEOUT_RD_SUSP_bits_t;
#define SAFBC_TIMEOUT_RD_SUSP_RESETVALUE    (0x00U)                                       /**<  (SAFBC_TIMEOUT_RD_SUSP) This register is used to detect when a series of Read transfers has finished. When this time     expires without any new Read request, any suspended Erase or Program operation is given the     Resume command to continue.  Reset Value */

#define SAFBC_TIMEOUT_RD_SUSP_READ_TIMEOUT_Pos (0)                                            /**< (SAFBC_TIMEOUT_RD_SUSP) This field provides a timeout value in units of the EC internal clock MCLK. This value is         tunable for system performance, but a value at or below 20us is suggested. Position */
#define SAFBC_TIMEOUT_RD_SUSP_READ_TIMEOUT_Msk (0xFFFFFU << SAFBC_TIMEOUT_RD_SUSP_READ_TIMEOUT_Pos)  /**< (SAFBC_TIMEOUT_RD_SUSP) This field provides a timeout value in units of the EC internal clock MCLK. This value is         tunable for system performance, but a value at or below 20us is suggested. Mask */
#define SAFBC_TIMEOUT_RD_SUSP_READ_TIMEOUT(value) (SAFBC_TIMEOUT_RD_SUSP_READ_TIMEOUT_Msk & ((value) << SAFBC_TIMEOUT_RD_SUSP_READ_TIMEOUT_Pos))
#define SAFBC_TIMEOUT_RD_SUSP_Msk             (0x000FFFFFUL)                                 /**< (SAFBC_TIMEOUT_RD_SUSP) Register Mask  */

