ranjithaguna/pv/LED_Demo/source/pic32cx/component/safbc.h
/* -------- SAFBC_CS_POLL2_MSK : (SAFBC Offset: 0x1a4) (R/W 32) Upon issuing a Suspend command, a Poll-1 operation is repeated until the Flash is no longer     BUSY, then a Poll-2 operation to determine whether the Flash device is in a Suspended state. -------- */

typedef union
{
  struct
  {
    uint32_t CS0_POLL2_MASK:16;         /**< bit:  0..15  A '1' in this field masks out (ignores) the corresponding bit returned in Poll-2 status         for the CS0 Flash. */
    uint32_t CS1_POLL2_MASK:16;         /**< bit: 16..31  A '1' in this field masks out (ignores) the corresponding bit returned in Poll-2 status         for the CS1 Flash. */
  };
  uint32_t w;
} __SAFBC_CS_POLL2_MSK_bits_t;
#define SAFBC_CS_POLL2_MSK_RESETVALUE       (0x00U)                                       /**<  (SAFBC_CS_POLL2_MSK) Upon issuing a Suspend command, a Poll-1 operation is repeated until the Flash is no longer     BUSY, then a Poll-2 operation to determine whether the Flash device is in a Suspended state.  Reset Value */

#define SAFBC_CS_POLL2_MSK_CS0_POLL2_MASK_Pos (0)                                            /**< (SAFBC_CS_POLL2_MSK) A '1' in this field masks out (ignores) the corresponding bit returned in Poll-2 status         for the CS0 Flash. Position */
#define SAFBC_CS_POLL2_MSK_CS0_POLL2_MASK_Msk (0xFFFFU << SAFBC_CS_POLL2_MSK_CS0_POLL2_MASK_Pos)  /**< (SAFBC_CS_POLL2_MSK) A '1' in this field masks out (ignores) the corresponding bit returned in Poll-2 status         for the CS0 Flash. Mask */
#define SAFBC_CS_POLL2_MSK_CS0_POLL2_MASK(value) (SAFBC_CS_POLL2_MSK_CS0_POLL2_MASK_Msk & ((value) << SAFBC_CS_POLL2_MSK_CS0_POLL2_MASK_Pos))
#define SAFBC_CS_POLL2_MSK_CS1_POLL2_MASK_Pos (16)                                           /**< (SAFBC_CS_POLL2_MSK) A '1' in this field masks out (ignores) the corresponding bit returned in Poll-2 status         for the CS1 Flash. Position */
#define SAFBC_CS_POLL2_MSK_CS1_POLL2_MASK_Msk (0xFFFFU << SAFBC_CS_POLL2_MSK_CS1_POLL2_MASK_Pos)  /**< (SAFBC_CS_POLL2_MSK) A '1' in this field masks out (ignores) the corresponding bit returned in Poll-2 status         for the CS1 Flash. Mask */
#define SAFBC_CS_POLL2_MSK_CS1_POLL2_MASK(value) (SAFBC_CS_POLL2_MSK_CS1_POLL2_MASK_Msk & ((value) << SAFBC_CS_POLL2_MSK_CS1_POLL2_MASK_Pos))
#define SAFBC_CS_POLL2_MSK_Msk                (0xFFFFFFFFUL)                                 /**< (SAFBC_CS_POLL2_MSK) Register Mask  */

/* -------- SAFBC_TESTREG_CTRL0 : (SAFBC Offset: 0x1a8) (R/W 32) This register provides special mode control. -------- */

typedef union
{
  struct
  {
    uint32_t DISABLE_SUSPEND:1;         /**< bit:      0  A '1' in this field enters DISABLE_SUSPEND mode, which prevents suspending an Erase or         Write in progress. In this mode, Read operations will be held waiting until the Erase or         Write finishes. */
    uint32_t :31;                       /**< bit:  1..31  Reserved                                      */
  };
  uint32_t w;
} __SAFBC_TESTREG_CTRL0_bits_t;
#define SAFBC_TESTREG_CTRL0_RESETVALUE      (0x00U)                                       /**<  (SAFBC_TESTREG_CTRL0) This register provides special mode control.  Reset Value */

#define SAFBC_TESTREG_CTRL0_DISABLE_SUSPEND_Pos (0)                                            /**< (SAFBC_TESTREG_CTRL0) A '1' in this field enters DISABLE_SUSPEND mode, which prevents suspending an Erase or         Write in progress. In this mode, Read operations will be held waiting until the Erase or         Write finishes. Position */
#define SAFBC_TESTREG_CTRL0_DISABLE_SUSPEND_Msk (0x1U << SAFBC_TESTREG_CTRL0_DISABLE_SUSPEND_Pos)  /**< (SAFBC_TESTREG_CTRL0) A '1' in this field enters DISABLE_SUSPEND mode, which prevents suspending an Erase or         Write in progress. In this mode, Read operations will be held waiting until the Erase or         Write finishes. Mask */
#define SAFBC_TESTREG_CTRL0_Msk               (0x00000001UL)                                 /**< (SAFBC_TESTREG_CTRL0) Register Mask  */

/* -------- SAFBC_TIMOUTDLY_SUSPCHK : (SAFBC Offset: 0x1ac) (R/W 32) This register provides a time delay for support of some Flash devices. It holds off the     first Poll-1 check after a Suspend command has been given to the Flash. -------- */

typedef union
{
  struct
  {
    uint32_t SUS_CHECK_DELAY:20;        /**< bit:  0..19  This field provides a delay value in units of the EC internal clock MCLK. This value         should be set to 20us. */
    uint32_t :12;                       /**< bit: 20..31  Reserved                                      */
  };
  uint32_t w;
} __SAFBC_TIMOUTDLY_SUSPCHK_bits_t;
#define SAFBC_TIMOUTDLY_SUSPCHK_RESETVALUE  (0x00U)                                       /**<  (SAFBC_TIMOUTDLY_SUSPCHK) This register provides a time delay for support of some Flash devices. It holds off the     first Poll-1 check after a Suspend command has been given to the Flash.  Reset Value */

#define SAFBC_TIMOUTDLY_SUSPCHK_SUS_CHECK_DELAY_Pos (0)                                            /**< (SAFBC_TIMOUTDLY_SUSPCHK) This field provides a delay value in units of the EC internal clock MCLK. This value         should be set to 20us. Position */
#define SAFBC_TIMOUTDLY_SUSPCHK_SUS_CHECK_DELAY_Msk (0xFFFFFU << SAFBC_TIMOUTDLY_SUSPCHK_SUS_CHECK_DELAY_Pos)  /**< (SAFBC_TIMOUTDLY_SUSPCHK) This field provides a delay value in units of the EC internal clock MCLK. This value         should be set to 20us. Mask */
#define SAFBC_TIMOUTDLY_SUSPCHK_SUS_CHECK_DELAY(value) (SAFBC_TIMOUTDLY_SUSPCHK_SUS_CHECK_DELAY_Msk & ((value) << SAFBC_TIMOUTDLY_SUSPCHK_SUS_CHECK_DELAY_Pos))
#define SAFBC_TIMOUTDLY_SUSPCHK_Msk           (0x000FFFFFUL)                                 /**< (SAFBC_TIMOUTDLY_SUSPCHK) Register Mask  */

/* -------- SAFBC_TESTREG_CTRL1 : (SAFBC Offset: 0x1b0) (R/W 32) Micron requires a prefix consisting of two command frames (in separate CS# assertions) to     be sent before Mode information will be recognized to enter Continuous Read mode. This     technique is called (Micron XIP) in their datasheets.  The support for these chips requires     setting up this register and setting the corresponding Prefix Enable bit(s) to enable this     handling.  The first command frame of the Prefix sequence will be a single byte consisting of     the Write Enable opcode, taken from the OP_WE opcode field of the appropriate Opcode A register     (Section 7.3.5, on page 113).  The second command frame of the Prefix sequence comes from this     register, consisting of first the PREFIX_OP byte for the corresponding Flash device (CS0/CS1),     and then its PREFIX_DAT byte.  The PREFIX_OP byte will be 81h always, which is documented as     the Micron opcode (WRITE VOLATILE CONFIGURATION REGISTER) The PREFIX_DAT byte contains the data     written to the Micron Flash device's Volatile Configuration Register. It has potential     side-effects beyond just enabling Micron XIP Mode, so it must be constructed very carefully. -------- */

typedef union
{
  struct
  {
    uint32_t CS0_PREFIX_OP:8;           /**< bit:   0..7  This field is the Prefix Opcode for Micron XIP mode on CS0. It should be set to 81h,         for Micron parts. */
    uint32_t CS0_PREFIX_DAT:8;          /**< bit:  8..15  This field is the data sent with the CS0_PREFIX_OP command. */
    uint32_t CS1_PREFIX_OP:8;           /**< bit: 16..23  This field is the Prefix Opcode for Micron XIP mode on CS1. It should be set to 81h,         for Micron parts. */
    uint32_t CS1_PREFIX_DAT:8;          /**< bit: 24..31  This field is the data sent with the CS1_PREFIX_OP command. */
  };
  uint32_t w;
} __SAFBC_TESTREG_CTRL1_bits_t;
#define SAFBC_TESTREG_CTRL1_RESETVALUE      (0x00U)                                       /**<  (SAFBC_TESTREG_CTRL1) Micron requires a prefix consisting of two command frames (in separate CS# assertions) to     be sent before Mode information will be recognized to enter Continuous Read mode. This     technique is called (Micron XIP) in their datasheets.  The support for these chips requires     setting up this register and setting the corresponding Prefix Enable bit(s) to enable this     handling.  The first command frame of the Prefix sequence will be a single byte consisting of     the Write Enable opcode, taken from the OP_WE opcode field of the appropriate Opcode A register     (Section 7.3.5, on page 113).  The second command frame of the Prefix sequence comes from this     register, consisting of first the PREFIX_OP byte for the corresponding Flash device (CS0/CS1),     and then its PREFIX_DAT byte.  The PREFIX_OP byte will be 81h always, which is documented as     the Micron opcode (WRITE VOLATILE CONFIGURATION REGISTER) The PREFIX_DAT byte contains the data     written to the Micron Flash device's Volatile Configuration Register. It has potential     side-effects beyond just enabling Micron XIP Mode, so it must be constructed very carefully.  Reset Value */

