ranjithaguna/pv/LED_Demo/source/pic32cx/component/safbc.h
#define SAFBC_TESTREG_CTRL1_CS0_PREFIX_OP_Pos (0)                                            /**< (SAFBC_TESTREG_CTRL1) This field is the Prefix Opcode for Micron XIP mode on CS0. It should be set to 81h,         for Micron parts. Position */
#define SAFBC_TESTREG_CTRL1_CS0_PREFIX_OP_Msk (0xFFU << SAFBC_TESTREG_CTRL1_CS0_PREFIX_OP_Pos)  /**< (SAFBC_TESTREG_CTRL1) This field is the Prefix Opcode for Micron XIP mode on CS0. It should be set to 81h,         for Micron parts. Mask */
#define SAFBC_TESTREG_CTRL1_CS0_PREFIX_OP(value) (SAFBC_TESTREG_CTRL1_CS0_PREFIX_OP_Msk & ((value) << SAFBC_TESTREG_CTRL1_CS0_PREFIX_OP_Pos))
#define SAFBC_TESTREG_CTRL1_CS0_PREFIX_DAT_Pos (8)                                            /**< (SAFBC_TESTREG_CTRL1) This field is the data sent with the CS0_PREFIX_OP command. Position */
#define SAFBC_TESTREG_CTRL1_CS0_PREFIX_DAT_Msk (0xFFU << SAFBC_TESTREG_CTRL1_CS0_PREFIX_DAT_Pos)  /**< (SAFBC_TESTREG_CTRL1) This field is the data sent with the CS0_PREFIX_OP command. Mask */
#define SAFBC_TESTREG_CTRL1_CS0_PREFIX_DAT(value) (SAFBC_TESTREG_CTRL1_CS0_PREFIX_DAT_Msk & ((value) << SAFBC_TESTREG_CTRL1_CS0_PREFIX_DAT_Pos))
#define SAFBC_TESTREG_CTRL1_CS1_PREFIX_OP_Pos (16)                                           /**< (SAFBC_TESTREG_CTRL1) This field is the Prefix Opcode for Micron XIP mode on CS1. It should be set to 81h,         for Micron parts. Position */
#define SAFBC_TESTREG_CTRL1_CS1_PREFIX_OP_Msk (0xFFU << SAFBC_TESTREG_CTRL1_CS1_PREFIX_OP_Pos)  /**< (SAFBC_TESTREG_CTRL1) This field is the Prefix Opcode for Micron XIP mode on CS1. It should be set to 81h,         for Micron parts. Mask */
#define SAFBC_TESTREG_CTRL1_CS1_PREFIX_OP(value) (SAFBC_TESTREG_CTRL1_CS1_PREFIX_OP_Msk & ((value) << SAFBC_TESTREG_CTRL1_CS1_PREFIX_OP_Pos))
#define SAFBC_TESTREG_CTRL1_CS1_PREFIX_DAT_Pos (24)                                           /**< (SAFBC_TESTREG_CTRL1) This field is the data sent with the CS1_PREFIX_OP command. Position */
#define SAFBC_TESTREG_CTRL1_CS1_PREFIX_DAT_Msk (0xFFU << SAFBC_TESTREG_CTRL1_CS1_PREFIX_DAT_Pos)  /**< (SAFBC_TESTREG_CTRL1) This field is the data sent with the CS1_PREFIX_OP command. Mask */
#define SAFBC_TESTREG_CTRL1_CS1_PREFIX_DAT(value) (SAFBC_TESTREG_CTRL1_CS1_PREFIX_DAT_Msk & ((value) << SAFBC_TESTREG_CTRL1_CS1_PREFIX_DAT_Pos))
#define SAFBC_TESTREG_CTRL1_Msk               (0xFFFFFFFFUL)                                 /**< (SAFBC_TESTREG_CTRL1) Register Mask  */

/** \brief SAFBC register offsets definitions */
#define SAFBC_EC_LEN_TAG_CMD_OFFSET  (0x18)         /**< (SAFBC_EC_LEN_TAG_CMD) This register defines the command type and length of transfers requested by EC firmware Offset */
#define SAFBC_EC_FLASH_ADD_OFFSET    (0x1C)         /**< (SAFBC_EC_FLASH_ADD) This register hold the Flash Space address to be accessed by the current command from EC firmware. Offset */
#define SAFBC_EC_START_OFFSET        (0x20)         /**< (SAFBC_EC_START) This register contains the Start control for a Flash access requested in the rest of the EC    Portal registers. It triggers the requested transfer. Offset */
#define SAFBC_EC_AHB_ADD_OFFSET      (0x24)         /**< (SAFBC_EC_AHB_ADD) This register holds a location in the EC's own address space that is to be used as     the SRAM buffer for an EC Flash access. Offset */
#define SAFBC_EC_DONE_STATUS_OFFSET  (0x28)         /**< (SAFBC_EC_DONE_STATUS) This register holds the DONE status bit, which indicates when a request is completed     by rising to '1'. It may be used as an interrupt trigger for INTR_FLASH. It may be cleared     at any time after it rises, but must be cleared before issuing the next request. Offset */
#define SAFBC_EC_EN_OFFSET           (0x2C)         /**< (SAFBC_EC_EN) This register contains the one bit DONE_EN in bit position[0]. This bit enables the DONE bit in     the status register to trigger an interrupt. Offset */
#define SAFBC_CONFIG_SIZE_OFFSET     (0x30)         /**< (SAFBC_CONFIG_SIZE) This register declares the address of the final byte of the Flash space implemented in the    physically present Flash device or devices. Offset */
#define SAFBC_CONFIG_TH_OFFSET       (0x34)         /**< (SAFBC_CONFIG_TH) This register declares whether there are two Flash devices, and if so, where the boundary is     between the devices. Offset */
#define SAFBC_CONFIG_MISC_OFFSET     (0x38)         /**< (SAFBC_CONFIG_MISC) Bits[7:6] (PREFIX) declare the need for some Flash devices (notably Micron) to be given an     explicit command to enter Continuous Mode, as opposed to requiring only Mode bits in the first     Read access. Offset */
#define SAFBC_ESPI_ERRINTR_STAT_OFFSET (0x3C)         /**< (SAFBC_ESPI_ERRINTR_STAT) These bits may be individually enabled to trigger interrupts using the corresponding        Interrupt Enable register. Offset */
#define SAFBC_ESPI_ERRINT_EN_OFFSET  (0x40)         /**< (SAFBC_ESPI_ERRINT_EN) These bits individually enable the bits in SAF eSPI Monitor Status Register  to trigger    interrupts to the EC firmware. Offset */
#define SAFBC_EC_BUSY_REG_OFFSET     (0x44)         /**< (SAFBC_EC_BUSY_REG) This register holds the EC_BUSY status bit, which indicates when the EC Portal    is busy performing an access. Offset */
#define SAFBC_CNFG_CS0_OPCODEA_OFFSET (0x4C)         /**< (SAFBC_CNFG_CS0_OPCODEA) There are two Opcode A registers, one associated with each of the Flashes. If the CS1     Flash does not exist, its register can be left in its default state. The four fields in each     register represent the 8-bit Flash opcodes for Write Enable, Suspend, Resume and Read Status     Register. The Status Register referred to is the register inside the Flash which contains the     (BUSY) or (IN PROGRESS) status bit in position 0. Offset */
#define SAFBC_CNFG_CS0_OPCODEB_OFFSET (0x50)         /**< (SAFBC_CNFG_CS0_OPCODEB) There are two Opcode B registers, one associated with each of the Flashes. If the CS1 Flash    does not exist, its register can be left in its default state. The OP_PROGRAM field is mandatory,    and must hold the Page Program opcode for the respective Flash. The Erase size of 4K is mandatory,    and so the OP_ERASE0 field must be initialized to the appropriate opcode for the Flash device.    There is only one bit declaring each Erase size up to the Host System (instead of one per Flash device,    see eSPI Configuration Register 44h), so if there are two Flash devices, each    Erase size over 4K must be declared here only if BOTH Flash devices support it. Offset */
#define SAFBC_CNFG_CS0_OPCODEC_OFFSET (0x54)         /**< (SAFBC_CNFG_CS0_OPCODEC) There are two Opcode C registers, one associated with each of the Flashes. If the CS1 Flash     does not exist, its register can be left in its default state. Two fields (OP) define opcodes,     and two fields (MODE) represent the Mode code values. Mode codes are provided immediately after     the Address in Continuous Read traffic, and are used to keep the Flash device in Continuous     Read Mode. Depending on the Flash device manufacturer, this mode may be documented in their     datasheet as either a Mode byte, or as certain bits of a first Dummy byte or first Dummy     clock. The recommended Mode values given below are selected to be appropriate for any Flash device. Offset */
#define SAFBC_CNFG_CS0_DESC_OFFSET   (0x58)         /**< (SAFBC_CNFG_CS0_DESC) There are two Per-Flash Descriptors registers, one associated with each of the Flash devices.     If the CS1 Flash does not exist, its register can be left in its default state. Each 4-bit field     is a pointer which identifies a Timing Descriptor location in the Captive QMSPI block's Timing     Description register structure.     The ENTER_CONT (Enter Continuous Mode) and READ_CONT (Read in Continuous Mode) fields are used to     invoke a QMSPI Timing Descriptor chain for the corresponding action, by identifying the first     Descriptor entry of the chain being invoked. Using the general QMSPI programming model, these     settings would be:      ENTER_CONT =      - 3 for CS0      - 9 for CS1      READ_CONT =      - 0 for CS0      - 6 for CS1      The SIZE_CONT field identifies the specific Descriptor within the READ_CONT chain that holds the      requested Read size. Using the example QMSPI programming model, these settings would be:       SIZE_CONT =       - 2 for CS0       - 8 for CS1 Offset */
#define SAFBC_CNFG_CS1_OPCODEA_OFFSET (0x5C)         /**< (SAFBC_CNFG_CS1_OPCODEA) This is the CS1 Opcode A register. \n   If the CS1 Flash does not exist, its register can be left in its default state. The four fields in each register represent the 8-bit Flash\n   opcodes for Write Enable, Suspend, Resume and Read Status Register. The Status Register referred to is the register inside the Flash which\n          contains the BUSY or IN PROGRESS status bit in position 0. Offset */
#define SAFBC_CNFG_CS1_OPCODEB_OFFSET (0x60)         /**< (SAFBC_CNFG_CS1_OPCODEB) This is the CS1 Flash Opcode B register. If the CS1 Flash does not exist, its register can be     left in its default state. The OP_PROGRAM field is mandatory, and must hold the Page Program     opcode for the respective Flash. The Erase size of 4K is mandatory, and so the OP_ERASE0 field     must be initialized to the appropriate opcode for the Flash device. There is only one bit     declaring each Erase size up to the Host System (instead of one per Flash device, see eSPI     Configuration Register 44h), so if there are two Flash devices, each Erase size over 4K must     be declared here only if BOTH Flash devices support it. Offset */
#define SAFBC_CNFG_CS1_OPCODEC_OFFSET (0x64)         /**< (SAFBC_CNFG_CS1_OPCODEC) This is the CS1 Flash device Opcode C register. If the CS1 Flash does not exist, its     register can be left in its default state. Two fields (OP) define opcodes, and two fields     (MODE) represent the Mode code values. Mode codes are provided immediately after the Address     in Continuous Read traffic, and are used to keep the Flash device in Continuous Read Mode.     Depending on the Flash device manufacturer, this mode may be documented in their datasheet     as either a Mode byte, or as certain bits of a first Dummy byte or first Dummy clock.     The recommended Mode values given below are selected to be appropriate for any Flash device. Offset */
#define SAFBC_CNFG_CS1_DESC_OFFSET   (0x68)         /**< (SAFBC_CNFG_CS1_DESC) This is the Per-Flash Descriptors register for CS1 Flash . If the CS1 Flash does not exist,     its register can be left in its default state. Each 4-bit field is a pointer which identifies a     Timing Descriptor location in the Captive QMSPI block's Timing Description register structure.     The ENTER_CONT (Enter Continuous Mode) and READ_CONT (Read in Continuous Mode) fields are used to     invoke a QMSPI Timing Descriptor chain for the corresponding action, by identifying the first     Descriptor entry of the chain being invoked. Using the general QMSPI programming model, these     settings would be:      ENTER_CONT =      - 3 for CS0      - 9 for CS1      READ_CONT =      - 0 for CS0      - 6 for CS1      The SIZE_CONT field identifies the specific Descriptor within the READ_CONT chain that holds the      requested Read size. Using the example QMSPI programming model, these settings would be:       SIZE_CONT =       - 2 for CS0       - 8 for CS1 Offset */
#define SAFBC_CNFG_CS_DESC_OFFSET    (0x6C)         /**< (SAFBC_CNFG_CS_DESC) This is a single register, which accompanies the two Per-Flash Descriptors registers, and     provides Descriptor pointers that are shared by both CS0 and CS1 devices uniformly.     Each 4-bit field is a pointer which identifies a Timing Descriptor location in the Captive     QMSPI block's memory. The EXIT_CONT field (Exit Continuous Mode) points to the single chain     invoked to exit the Flash from Continuous Mode, allowing an Erase or Program command to be     entered. This chain is identical for either Flash device, regardless of its manufacturer, and     simply directs a universal Exit symbol to the appropriate CS0/CS1 device. The POLL1 and POLL2     fields should both point to the same chain. This chain will issue the appropriate opcode for the     operation (Poll1 or Poll2) supplied by the SAF Bridge from the Opcode registers, and will read     back 16 bits of information for use by the SAF Bridge. Offset */
#define SAFBC_PROTECT_LOCK_OFFSET    (0x70)         /**< (SAFBC_PROTECT_LOCK) There is a bit in this register for each of the 17 Protection Region Register sets. Writing     '1' to a bit locks the associated 4-Register set to Read-Only access, and also locks this bit     itself to a Read-Only '1'. Offset */
#define SAFBC_PROTECT_DIRTY_OFFSET   (0x74)         /**< (SAFBC_PROTECT_DIRTY) There is a bit in this register for each of the 12 Flash Regions that can be allocated from     the Region Table in the Intel Descriptor structure. Register sets 12 through 16 do not represent     allocated Flash regions, and so they do not have bits in this register. Offset */
#define SAFBC_TAGMAP0_OFFSET         (0x78)         /**< (SAFBC_TAGMAP0) The default values in this register match hard-wired assignments made in the Chipset for eSPI     Tag values 0h through 7h. A default value of 7 indicates a non-existent map entry, for a Tag value     which should never happen. Offset */
#define SAFBC_TAGMAP1_OFFSET         (0x7C)         /**< (SAFBC_TAGMAP1) The default values in this register match hard-wired assignments made in the Chipset for eSPI Tag     values 8h through Fh. A default value of 7 indicates a non-existent map entry, for a Tag value which     should never happen. Offset */
#define SAFBC_TAGMAP2_OFFSET         (0x80)         /**< (SAFBC_TAGMAP2) The default value in bits [2:0] of this register matches the hard-wired assignment made in the     Chipset for accesses made by an EC. After ensuring that all three Tag Map Registers [2:0] contain     valid mappings, the STM_LK bit should be set to '1' to lock them, preventing firmware from     re-assigning them later. Offset */
#define SAFBC_START00_OFFSET         (0x84)         /**< (SAFBC_START00) This is Start00 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5). Offset */
#define SAFBC_LIMIT00_OFFSET         (0x88)         /**< (SAFBC_LIMIT00) This is Limit00 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5). Offset */
#define SAFBC_WRITE00_OFFSET         (0x8C)         /**< (SAFBC_WRITE00) This is Write00 register. It applies to the region defined by the associated [RR] Start and     Limit registers. Bits at positions [0]--[7] grant Write/Erase permission to Permission Masters     numbered 0--7 respectively. Offset */
#define SAFBC_READ00_OFFSET          (0x90)         /**< (SAFBC_READ00) This is Read00 register. Bits at positions [0]--[7] grant Read permission to Permission     Masters numbered 0--7 respectively. Offset */
#define SAFBC_START01_OFFSET         (0x94)         /**< (SAFBC_START01) This is Start01 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5). Offset */
#define SAFBC_LIMIT01_OFFSET         (0x98)         /**< (SAFBC_LIMIT01) This is Limit01 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5). Offset */
#define SAFBC_WRITE01_OFFSET         (0x9C)         /**< (SAFBC_WRITE01) This is Write01 register. It applies to the region defined by the associated [RR] Start and     Limit registers. Bits at positions [0]--[7] grant Write/Erase permission to Permission Masters     numbered 0--7 respectively. Offset */
#define SAFBC_READ01_OFFSET          (0xA0)         /**< (SAFBC_READ01) This is Read01 register. Bits at positions [0]--[7] grant Read permission to Permission     Masters numbered 0--7 respectively. Offset */
#define SAFBC_START02_OFFSET         (0xA4)         /**< (SAFBC_START02) This is Start02 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5). Offset */
#define SAFBC_LIMIT02_OFFSET         (0xA8)         /**< (SAFBC_LIMIT02) This is Limit02 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5). Offset */
#define SAFBC_WRITE02_OFFSET         (0xAC)         /**< (SAFBC_WRITE02) This is Write02 register. It applies to the region defined by the associated [RR] Start and     Limit registers. Bits at positions [0]--[7] grant Write/Erase permission to Permission Masters     numbered 0--7 respectively. Offset */
#define SAFBC_READ02_OFFSET          (0xB0)         /**< (SAFBC_READ02) This is Read02 register. Bits at positions [0]--[7] grant Read permission to Permission     Masters numbered 0--7 respectively. Offset */
#define SAFBC_START03_OFFSET         (0xB4)         /**< (SAFBC_START03) This is Start03 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5). Offset */
#define SAFBC_LIMIT03_OFFSET         (0xB8)         /**< (SAFBC_LIMIT03) This is Limit03 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5). Offset */
#define SAFBC_WRITE03_OFFSET         (0xBC)         /**< (SAFBC_WRITE03) This is Write03 register. It applies to the region defined by the associated [RR] Start and     Limit registers. Bits at positions [0]--[7] grant Write/Erase permission to Permission Masters     numbered 0--7 respectively. Offset */
#define SAFBC_READ03_OFFSET          (0xC0)         /**< (SAFBC_READ03) This is Read03 register. Bits at positions [0]--[7] grant Read permission to Permission     Masters numbered 0--7 respectively. Offset */
#define SAFBC_START04_OFFSET         (0xC4)         /**< (SAFBC_START04) This is Start04 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5). Offset */
#define SAFBC_LIMIT04_OFFSET         (0xC8)         /**< (SAFBC_LIMIT04) This is Limit04 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5). Offset */
#define SAFBC_WRITE04_OFFSET         (0xCC)         /**< (SAFBC_WRITE04) This is Write04 register. It applies to the region defined by the associated [RR] Start and     Limit registers. Bits at positions [0]--[7] grant Write/Erase permission to Permission Masters     numbered 0--7 respectively. Offset */
#define SAFBC_READ04_OFFSET          (0xD0)         /**< (SAFBC_READ04) This is Read04 register. Bits at positions [0]--[7] grant Read permission to Permission     Masters numbered 0--7 respectively. Offset */
#define SAFBC_START05_OFFSET         (0xD4)         /**< (SAFBC_START05) This is Start05 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5). Offset */
#define SAFBC_LIMIT05_OFFSET         (0xD8)         /**< (SAFBC_LIMIT05) This is Limit05 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5). Offset */
