ranjithaguna/pv/LED_Demo/source/pic32cx/component/safbc.h
#define SAFBC_WRITE05_OFFSET         (0xDC)         /**< (SAFBC_WRITE05) This is Write05 register. It applies to the region defined by the associated [RR] Start and     Limit registers. Bits at positions [0]--[7] grant Write/Erase permission to Permission Masters     numbered 0--7 respectively. Offset */
#define SAFBC_READ05_OFFSET          (0xE0)         /**< (SAFBC_READ05) This is Read05 register. Bits at positions [0]--[7] grant Read permission to Permission     Masters numbered 0--7 respectively. Offset */
#define SAFBC_START06_OFFSET         (0xE4)         /**< (SAFBC_START06) This is Start06 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5). Offset */
#define SAFBC_LIMIT06_OFFSET         (0xE8)         /**< (SAFBC_LIMIT06) This is Limit06 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5). Offset */
#define SAFBC_WRITE06_OFFSET         (0xEC)         /**< (SAFBC_WRITE06) This is Write06 register. It applies to the region defined by the associated [RR] Start and     Limit registers. Bits at positions [0]--[7] grant Write/Erase permission to Permission Masters     numbered 0--7 respectively. Offset */
#define SAFBC_READ06_OFFSET          (0xF0)         /**< (SAFBC_READ06) This is Read06 register. Bits at positions [0]--[7] grant Read permission to Permission     Masters numbered 0--7 respectively. Offset */
#define SAFBC_START07_OFFSET         (0xF4)         /**< (SAFBC_START07) This is Start07 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5). Offset */
#define SAFBC_LIMIT07_OFFSET         (0xF8)         /**< (SAFBC_LIMIT07) This is Limit07 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5). Offset */
#define SAFBC_WRITE07_OFFSET         (0xFC)         /**< (SAFBC_WRITE07) This is Write07 register. It applies to the region defined by the associated [RR] Start and     Limit registers. Bits at positions [0]--[7] grant Write/Erase permission to Permission Masters     numbered 0--7 respectively. Offset */
#define SAFBC_READ07_OFFSET          (0x100)        /**< (SAFBC_READ07) This is Read07 register. Bits at positions [0]--[7] grant Read permission to Permission     Masters numbered 0--7 respectively. Offset */
#define SAFBC_START08_OFFSET         (0x104)        /**< (SAFBC_START08) This is Start08 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5). Offset */
#define SAFBC_LIMIT08_OFFSET         (0x108)        /**< (SAFBC_LIMIT08) This is Limit08 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5). Offset */
#define SAFBC_WRITE08_OFFSET         (0x10C)        /**< (SAFBC_WRITE08) This is Write08 register. It applies to the region defined by the associated [RR] Start and     Limit registers. Bits at positions [0]--[7] grant Write/Erase permission to Permission Masters     numbered 0--7 respectively. Offset */
#define SAFBC_READ08_OFFSET          (0x110)        /**< (SAFBC_READ08) This is Read08 register. Bits at positions [0]--[7] grant Read permission to Permission     Masters numbered 0--7 respectively. Offset */
#define SAFBC_START09_OFFSET         (0x114)        /**< (SAFBC_START09) This is Start09 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5). Offset */
#define SAFBC_LIMIT09_OFFSET         (0x118)        /**< (SAFBC_LIMIT09) This is Limit09 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5). Offset */
#define SAFBC_WRITE09_OFFSET         (0x11C)        /**< (SAFBC_WRITE09) This is Write09 register. It applies to the region defined by the associated [RR] Start and     Limit registers. Bits at positions [0]--[7] grant Write/Erase permission to Permission Masters     numbered 0--7 respectively. Offset */
#define SAFBC_READ09_OFFSET          (0x120)        /**< (SAFBC_READ09) This is Read09 register. Bits at positions [0]--[7] grant Read permission to Permission     Masters numbered 0--7 respectively. Offset */
#define SAFBC_START10_OFFSET         (0x124)        /**< (SAFBC_START10) This is Start10 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5). Offset */
#define SAFBC_LIMIT10_OFFSET         (0x128)        /**< (SAFBC_LIMIT10) This is Limit10 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5). Offset */
#define SAFBC_WRITE10_OFFSET         (0x12C)        /**< (SAFBC_WRITE10) This is Write10 register. It applies to the region defined by the associated [RR] Start and     Limit registers. Bits at positions [0]--[7] grant Write/Erase permission to Permission Masters     numbered 0--7 respectively. Offset */
#define SAFBC_READ10_OFFSET          (0x130)        /**< (SAFBC_READ10) This is Read10 register. Bits at positions [0]--[7] grant Read permission to Permission     Masters numbered 0--7 respectively. Offset */
#define SAFBC_START11_OFFSET         (0x134)        /**< (SAFBC_START11) This is Start11 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5). Offset */
#define SAFBC_LIMIT11_OFFSET         (0x138)        /**< (SAFBC_LIMIT11) This is Limit11 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5). Offset */
#define SAFBC_WRITE11_OFFSET         (0x13C)        /**< (SAFBC_WRITE11) This is Write11 register. It applies to the region defined by the associated [RR] Start and     Limit registers. Bits at positions [0]--[7] grant Write/Erase permission to Permission Masters     numbered 0--7 respectively. Offset */
#define SAFBC_READ11_OFFSET          (0x140)        /**< (SAFBC_READ11) This is Read11 register. Bits at positions [0]--[7] grant Read permission to Permission     Masters numbered 0--7 respectively. Offset */
#define SAFBC_START12_OFFSET         (0x144)        /**< (SAFBC_START12) This is Start12 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5). Offset */
#define SAFBC_LIMIT12_OFFSET         (0x148)        /**< (SAFBC_LIMIT12) This is Limit12 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5). Offset */
#define SAFBC_WRITE12_OFFSET         (0x14C)        /**< (SAFBC_WRITE12) This is Write12 register. It applies to the region defined by the associated [RR] Start and     Limit registers. Bits at positions [0]--[7] grant Write/Erase permission to Permission Masters     numbered 0--7 respectively. Offset */
#define SAFBC_READ12_OFFSET          (0x150)        /**< (SAFBC_READ12) This is Read12 register. Bits at positions [0]--[7] grant Read permission to Permission     Masters numbered 0--7 respectively. Offset */
#define SAFBC_START13_OFFSET         (0x154)        /**< (SAFBC_START13) This is Start13 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5). Offset */
#define SAFBC_LIMIT13_OFFSET         (0x158)        /**< (SAFBC_LIMIT13) This is Limit13 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5). Offset */
#define SAFBC_WRITE13_OFFSET         (0x15C)        /**< (SAFBC_WRITE13) This is Write13 register. It applies to the region defined by the associated [RR] Start and     Limit registers. Bits at positions [0]--[7] grant Write/Erase permission to Permission Masters     numbered 0--7 respectively. Offset */
#define SAFBC_READ13_OFFSET          (0x160)        /**< (SAFBC_READ13) This is Read13 register. Bits at positions [0]--[7] grant Read permission to Permission     Masters numbered 0--7 respectively. Offset */
#define SAFBC_START14_OFFSET         (0x164)        /**< (SAFBC_START14) This is Start14 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5). Offset */
#define SAFBC_LIMIT14_OFFSET         (0x168)        /**< (SAFBC_LIMIT14) This is Limit14 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5). Offset */
#define SAFBC_WRITE14_OFFSET         (0x16C)        /**< (SAFBC_WRITE14) This is Write14 register. It applies to the region defined by the associated [RR] Start and     Limit registers. Bits at positions [0]--[7] grant Write/Erase permission to Permission Masters     numbered 0--7 respectively. Offset */
#define SAFBC_READ14_OFFSET          (0x170)        /**< (SAFBC_READ14) This is Read14 register. Bits at positions [0]--[7] grant Read permission to Permission     Masters numbered 0--7 respectively. Offset */
#define SAFBC_START15_OFFSET         (0x174)        /**< (SAFBC_START15) This is Start15 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5). Offset */
#define SAFBC_LIMIT15_OFFSET         (0x178)        /**< (SAFBC_LIMIT15) This is Limit15 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5). Offset */
#define SAFBC_WRITE15_OFFSET         (0x17C)        /**< (SAFBC_WRITE15) This is Write15 register. It applies to the region defined by the associated [RR] Start and     Limit registers. Bits at positions [0]--[7] grant Write/Erase permission to Permission Masters     numbered 0--7 respectively. Offset */
#define SAFBC_READ15_OFFSET          (0x180)        /**< (SAFBC_READ15) This is Read15 register. Bits at positions [0]--[7] grant Read permission to Permission     Masters numbered 0--7 respectively. Offset */
#define SAFBC_START16_OFFSET         (0x184)        /**< (SAFBC_START16) This is Start16 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5). Offset */
#define SAFBC_LIMIT16_OFFSET         (0x188)        /**< (SAFBC_LIMIT16) This is Limit16 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5). Offset */
#define SAFBC_WRITE16_OFFSET         (0x18C)        /**< (SAFBC_WRITE16) This is Write16 register. It applies to the region defined by the associated [RR] Start and     Limit registers. Bits at positions [0]--[7] grant Write/Erase permission to Permission Masters     numbered 0--7 respectively. Offset */
#define SAFBC_READ16_OFFSET          (0x190)        /**< (SAFBC_READ16) This is Read16 register. Bits at positions [0]--[7] grant Read permission to Permission     Masters numbered 0--7 respectively. Offset */
#define SAFBC_POLL_TOUT_OFFSET       (0x194)        /**< (SAFBC_POLL_TOUT) This is an error timeout value imposed on any consecutive series of Poll-1 commands to a     Flash. The timeout counter starts whenever any new Poll-1 sequence starts, and stops when a     Poll-1 detects Not-BUSY status from the Flash. Offset */
#define SAFBC_POLL_INTERVAL_OFFSET   (0x198)        /**< (SAFBC_POLL_INTERVAL) This register should be kept zero except for diagnostic purposes. Where needed, it can be set     to provide spacing between consecutive Poll-1 operations to limit the amount of traffic. Offset */
#define SAFBC_TIMEOUT_RESUSP_OFFSET  (0x19C)        /**< (SAFBC_TIMEOUT_RESUSP) The value placed in this register provides necessary programmable support to a Flash that is     performing an Erase or a Program operation.  When an Erase or Program is started or Resumed, a     Suspend is held off until this time expires.  While an Erase or Program is in process but     Suspended, a Resume is forced when this time expires, even if Read requests are still pending,     causing the Erase or Program operation to continue, and again inhibiting the next Suspend until     it expires again. Offset */
#define SAFBC_TIMEOUT_RD_SUSP_OFFSET (0x1A0)        /**< (SAFBC_TIMEOUT_RD_SUSP) This register is used to detect when a series of Read transfers has finished. When this time     expires without any new Read request, any suspended Erase or Program operation is given the     Resume command to continue. Offset */
#define SAFBC_CS_POLL2_MSK_OFFSET    (0x1A4)        /**< (SAFBC_CS_POLL2_MSK) Upon issuing a Suspend command, a Poll-1 operation is repeated until the Flash is no longer     BUSY, then a Poll-2 operation to determine whether the Flash device is in a Suspended state. Offset */
#define SAFBC_TESTREG_CTRL0_OFFSET   (0x1A8)        /**< (SAFBC_TESTREG_CTRL0) This register provides special mode control. Offset */
#define SAFBC_TIMOUTDLY_SUSPCHK_OFFSET (0x1AC)        /**< (SAFBC_TIMOUTDLY_SUSPCHK) This register provides a time delay for support of some Flash devices. It holds off the     first Poll-1 check after a Suspend command has been given to the Flash. Offset */
#define SAFBC_TESTREG_CTRL1_OFFSET   (0x1B0)        /**< (SAFBC_TESTREG_CTRL1) Micron requires a prefix consisting of two command frames (in separate CS# assertions) to     be sent before Mode information will be recognized to enter Continuous Read mode. This     technique is called (Micron XIP) in their datasheets.  The support for these chips requires     setting up this register and setting the corresponding Prefix Enable bit(s) to enable this     handling.  The first command frame of the Prefix sequence will be a single byte consisting of     the Write Enable opcode, taken from the OP_WE opcode field of the appropriate Opcode A register     (Section 7.3.5, on page 113).  The second command frame of the Prefix sequence comes from this     register, consisting of first the PREFIX_OP byte for the corresponding Flash device (CS0/CS1),     and then its PREFIX_DAT byte.  The PREFIX_OP byte will be 81h always, which is documented as     the Micron opcode (WRITE VOLATILE CONFIGURATION REGISTER) The PREFIX_DAT byte contains the data     written to the Micron Flash device's Volatile Configuration Register. It has potential     side-effects beyond just enabling Micron XIP Mode, so it must be constructed very carefully. Offset */

