ranjithaguna/pv/LED_Demo/source/pic32cx/component/safbc.h
/** \brief SAFBC register API structure */
typedef struct
{  /* SAF BRIDGE COMPONENT */
  __IO  __SAFBC_EC_LEN_TAG_CMD_bits_t  EC_LEN_TAG_CMD; /**< Offset: 0x18 (R/W  32) This register defines the command type and length of transfers requested by EC firmware */
  __IO  __SAFBC_EC_FLASH_ADD_bits_t    EC_FLASH_ADD;  /**< Offset: 0x1C (R/W  32) This register hold the Flash Space address to be accessed by the current command from EC firmware. */
  __IO  __SAFBC_EC_START_bits_t        EC_START;      /**< Offset: 0x20 (R/W  32) This register contains the Start control for a Flash access requested in the rest of the EC    Portal registers. It triggers the requested transfer. */
  __IO  __SAFBC_EC_AHB_ADD_bits_t      EC_AHB_ADD;    /**< Offset: 0x24 (R/W  32) This register holds a location in the EC's own address space that is to be used as     the SRAM buffer for an EC Flash access. */
  __IO  __SAFBC_EC_DONE_STATUS_bits_t  EC_DONE_STATUS; /**< Offset: 0x28 (R/W  32) This register holds the DONE status bit, which indicates when a request is completed     by rising to '1'. It may be used as an interrupt trigger for INTR_FLASH. It may be cleared     at any time after it rises, but must be cleared before issuing the next request. */
  __IO  __SAFBC_EC_EN_bits_t           EC_EN;         /**< Offset: 0x2C (R/W  32) This register contains the one bit DONE_EN in bit position[0]. This bit enables the DONE bit in     the status register to trigger an interrupt. */
  __IO  __SAFBC_CONFIG_SIZE_bits_t     CONFIG_SIZE;   /**< Offset: 0x30 (R/W  32) This register declares the address of the final byte of the Flash space implemented in the    physically present Flash device or devices. */
  __IO  __SAFBC_CONFIG_TH_bits_t       CONFIG_TH;     /**< Offset: 0x34 (R/W  32) This register declares whether there are two Flash devices, and if so, where the boundary is     between the devices. */
  __IO  __SAFBC_CONFIG_MISC_bits_t     CONFIG_MISC;   /**< Offset: 0x38 (R/W  32) Bits[7:6] (PREFIX) declare the need for some Flash devices (notably Micron) to be given an     explicit command to enter Continuous Mode, as opposed to requiring only Mode bits in the first     Read access. */
  __IO  __SAFBC_ESPI_ERRINTR_STAT_bits_t ESPI_ERRINTR_STAT; /**< Offset: 0x3C (R/W  32) These bits may be individually enabled to trigger interrupts using the corresponding        Interrupt Enable register. */
  __IO  __SAFBC_ESPI_ERRINT_EN_bits_t  ESPI_ERRINT_EN; /**< Offset: 0x40 (R/W  32) These bits individually enable the bits in SAF eSPI Monitor Status Register  to trigger    interrupts to the EC firmware. */
  __IO  __SAFBC_EC_BUSY_REG_bits_t     EC_BUSY_REG;   /**< Offset: 0x44 (R/W  32) This register holds the EC_BUSY status bit, which indicates when the EC Portal    is busy performing an access. */
  __IO  __SAFBC_CNFG_CS0_OPCODEA_bits_t CNFG_CS0_OPCODEA; /**< Offset: 0x4C (R/W  32) There are two Opcode A registers, one associated with each of the Flashes. If the CS1     Flash does not exist, its register can be left in its default state. The four fields in each     register represent the 8-bit Flash opcodes for Write Enable, Suspend, Resume and Read Status     Register. The Status Register referred to is the register inside the Flash which contains the     (BUSY) or (IN PROGRESS) status bit in position 0. */
  __IO  __SAFBC_CNFG_CS0_OPCODEB_bits_t CNFG_CS0_OPCODEB; /**< Offset: 0x50 (R/W  32) There are two Opcode B registers, one associated with each of the Flashes. If the CS1 Flash    does not exist, its register can be left in its default state. The OP_PROGRAM field is mandatory,    and must hold the Page Program opcode for the respective Flash. The Erase size of 4K is mandatory,    and so the OP_ERASE0 field must be initialized to the appropriate opcode for the Flash device.    There is only one bit declaring each Erase size up to the Host System (instead of one per Flash device,    see eSPI Configuration Register 44h), so if there are two Flash devices, each    Erase size over 4K must be declared here only if BOTH Flash devices support it. */
  __IO  __SAFBC_CNFG_CS0_OPCODEC_bits_t CNFG_CS0_OPCODEC; /**< Offset: 0x54 (R/W  32) There are two Opcode C registers, one associated with each of the Flashes. If the CS1 Flash     does not exist, its register can be left in its default state. Two fields (OP) define opcodes,     and two fields (MODE) represent the Mode code values. Mode codes are provided immediately after     the Address in Continuous Read traffic, and are used to keep the Flash device in Continuous     Read Mode. Depending on the Flash device manufacturer, this mode may be documented in their     datasheet as either a Mode byte, or as certain bits of a first Dummy byte or first Dummy     clock. The recommended Mode values given below are selected to be appropriate for any Flash device. */
  __IO  __SAFBC_CNFG_CS0_DESC_bits_t   CNFG_CS0_DESC; /**< Offset: 0x58 (R/W  32) There are two Per-Flash Descriptors registers, one associated with each of the Flash devices.     If the CS1 Flash does not exist, its register can be left in its default state. Each 4-bit field     is a pointer which identifies a Timing Descriptor location in the Captive QMSPI block's Timing     Description register structure.     The ENTER_CONT (Enter Continuous Mode) and READ_CONT (Read in Continuous Mode) fields are used to     invoke a QMSPI Timing Descriptor chain for the corresponding action, by identifying the first     Descriptor entry of the chain being invoked. Using the general QMSPI programming model, these     settings would be:      ENTER_CONT =      - 3 for CS0      - 9 for CS1      READ_CONT =      - 0 for CS0      - 6 for CS1      The SIZE_CONT field identifies the specific Descriptor within the READ_CONT chain that holds the      requested Read size. Using the example QMSPI programming model, these settings would be:       SIZE_CONT =       - 2 for CS0       - 8 for CS1 */
  __IO  __SAFBC_CNFG_CS1_OPCODEA_bits_t CNFG_CS1_OPCODEA; /**< Offset: 0x5C (R/W  32) This is the CS1 Opcode A register. \n   If the CS1 Flash does not exist, its register can be left in its default state. The four fields in each register represent the 8-bit Flash\n   opcodes for Write Enable, Suspend, Resume and Read Status Register. The Status Register referred to is the register inside the Flash which\n          contains the BUSY or IN PROGRESS status bit in position 0. */
  __IO  __SAFBC_CNFG_CS1_OPCODEB_bits_t CNFG_CS1_OPCODEB; /**< Offset: 0x60 (R/W  32) This is the CS1 Flash Opcode B register. If the CS1 Flash does not exist, its register can be     left in its default state. The OP_PROGRAM field is mandatory, and must hold the Page Program     opcode for the respective Flash. The Erase size of 4K is mandatory, and so the OP_ERASE0 field     must be initialized to the appropriate opcode for the Flash device. There is only one bit     declaring each Erase size up to the Host System (instead of one per Flash device, see eSPI     Configuration Register 44h), so if there are two Flash devices, each Erase size over 4K must     be declared here only if BOTH Flash devices support it. */
  __IO  __SAFBC_CNFG_CS1_OPCODEC_bits_t CNFG_CS1_OPCODEC; /**< Offset: 0x64 (R/W  32) This is the CS1 Flash device Opcode C register. If the CS1 Flash does not exist, its     register can be left in its default state. Two fields (OP) define opcodes, and two fields     (MODE) represent the Mode code values. Mode codes are provided immediately after the Address     in Continuous Read traffic, and are used to keep the Flash device in Continuous Read Mode.     Depending on the Flash device manufacturer, this mode may be documented in their datasheet     as either a Mode byte, or as certain bits of a first Dummy byte or first Dummy clock.     The recommended Mode values given below are selected to be appropriate for any Flash device. */
  __IO  __SAFBC_CNFG_CS1_DESC_bits_t   CNFG_CS1_DESC; /**< Offset: 0x68 (R/W  32) This is the Per-Flash Descriptors register for CS1 Flash . If the CS1 Flash does not exist,     its register can be left in its default state. Each 4-bit field is a pointer which identifies a     Timing Descriptor location in the Captive QMSPI block's Timing Description register structure.     The ENTER_CONT (Enter Continuous Mode) and READ_CONT (Read in Continuous Mode) fields are used to     invoke a QMSPI Timing Descriptor chain for the corresponding action, by identifying the first     Descriptor entry of the chain being invoked. Using the general QMSPI programming model, these     settings would be:      ENTER_CONT =      - 3 for CS0      - 9 for CS1      READ_CONT =      - 0 for CS0      - 6 for CS1      The SIZE_CONT field identifies the specific Descriptor within the READ_CONT chain that holds the      requested Read size. Using the example QMSPI programming model, these settings would be:       SIZE_CONT =       - 2 for CS0       - 8 for CS1 */
  __IO  __SAFBC_CNFG_CS_DESC_bits_t    CNFG_CS_DESC;  /**< Offset: 0x6C (R/W  32) This is a single register, which accompanies the two Per-Flash Descriptors registers, and     provides Descriptor pointers that are shared by both CS0 and CS1 devices uniformly.     Each 4-bit field is a pointer which identifies a Timing Descriptor location in the Captive     QMSPI block's memory. The EXIT_CONT field (Exit Continuous Mode) points to the single chain     invoked to exit the Flash from Continuous Mode, allowing an Erase or Program command to be     entered. This chain is identical for either Flash device, regardless of its manufacturer, and     simply directs a universal Exit symbol to the appropriate CS0/CS1 device. The POLL1 and POLL2     fields should both point to the same chain. This chain will issue the appropriate opcode for the     operation (Poll1 or Poll2) supplied by the SAF Bridge from the Opcode registers, and will read     back 16 bits of information for use by the SAF Bridge. */
  __IO  __SAFBC_PROTECT_LOCK_bits_t    PROTECT_LOCK;  /**< Offset: 0x70 (R/W  32) There is a bit in this register for each of the 17 Protection Region Register sets. Writing     '1' to a bit locks the associated 4-Register set to Read-Only access, and also locks this bit     itself to a Read-Only '1'. */
  __IO  __SAFBC_PROTECT_DIRTY_bits_t   PROTECT_DIRTY; /**< Offset: 0x74 (R/W  32) There is a bit in this register for each of the 12 Flash Regions that can be allocated from     the Region Table in the Intel Descriptor structure. Register sets 12 through 16 do not represent     allocated Flash regions, and so they do not have bits in this register. */
  __IO  __SAFBC_TAGMAP0_bits_t         TAGMAP0;       /**< Offset: 0x78 (R/W  32) The default values in this register match hard-wired assignments made in the Chipset for eSPI     Tag values 0h through 7h. A default value of 7 indicates a non-existent map entry, for a Tag value     which should never happen. */
  __IO  __SAFBC_TAGMAP1_bits_t         TAGMAP1;       /**< Offset: 0x7C (R/W  32) The default values in this register match hard-wired assignments made in the Chipset for eSPI Tag     values 8h through Fh. A default value of 7 indicates a non-existent map entry, for a Tag value which     should never happen. */
  __IO  __SAFBC_TAGMAP2_bits_t         TAGMAP2;       /**< Offset: 0x80 (R/W  32) The default value in bits [2:0] of this register matches the hard-wired assignment made in the     Chipset for accesses made by an EC. After ensuring that all three Tag Map Registers [2:0] contain     valid mappings, the STM_LK bit should be set to '1' to lock them, preventing firmware from     re-assigning them later. */
  __IO  __SAFBC_START00_bits_t         START00;       /**< Offset: 0x84 (R/W  32) This is Start00 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5). */
  __IO  __SAFBC_LIMIT00_bits_t         LIMIT00;       /**< Offset: 0x88 (R/W  32) This is Limit00 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5). */
  __IO  __SAFBC_WRITE00_bits_t         WRITE00;       /**< Offset: 0x8C (R/W  32) This is Write00 register. It applies to the region defined by the associated [RR] Start and     Limit registers. Bits at positions [0]--[7] grant Write/Erase permission to Permission Masters     numbered 0--7 respectively. */
  __IO  __SAFBC_READ00_bits_t          READ00;        /**< Offset: 0x90 (R/W  32) This is Read00 register. Bits at positions [0]--[7] grant Read permission to Permission     Masters numbered 0--7 respectively. */
  __IO  __SAFBC_START01_bits_t         START01;       /**< Offset: 0x94 (R/W  32) This is Start01 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5). */
  __IO  __SAFBC_LIMIT01_bits_t         LIMIT01;       /**< Offset: 0x98 (R/W  32) This is Limit01 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5). */
  __IO  __SAFBC_WRITE01_bits_t         WRITE01;       /**< Offset: 0x9C (R/W  32) This is Write01 register. It applies to the region defined by the associated [RR] Start and     Limit registers. Bits at positions [0]--[7] grant Write/Erase permission to Permission Masters     numbered 0--7 respectively. */
  __IO  __SAFBC_READ01_bits_t          READ01;        /**< Offset: 0xA0 (R/W  32) This is Read01 register. Bits at positions [0]--[7] grant Read permission to Permission     Masters numbered 0--7 respectively. */
  __IO  __SAFBC_START02_bits_t         START02;       /**< Offset: 0xA4 (R/W  32) This is Start02 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5). */
  __IO  __SAFBC_LIMIT02_bits_t         LIMIT02;       /**< Offset: 0xA8 (R/W  32) This is Limit02 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5). */
  __IO  __SAFBC_WRITE02_bits_t         WRITE02;       /**< Offset: 0xAC (R/W  32) This is Write02 register. It applies to the region defined by the associated [RR] Start and     Limit registers. Bits at positions [0]--[7] grant Write/Erase permission to Permission Masters     numbered 0--7 respectively. */
  __IO  __SAFBC_READ02_bits_t          READ02;        /**< Offset: 0xB0 (R/W  32) This is Read02 register. Bits at positions [0]--[7] grant Read permission to Permission     Masters numbered 0--7 respectively. */
  __IO  __SAFBC_START03_bits_t         START03;       /**< Offset: 0xB4 (R/W  32) This is Start03 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5). */
  __IO  __SAFBC_LIMIT03_bits_t         LIMIT03;       /**< Offset: 0xB8 (R/W  32) This is Limit03 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5). */
  __IO  __SAFBC_WRITE03_bits_t         WRITE03;       /**< Offset: 0xBC (R/W  32) This is Write03 register. It applies to the region defined by the associated [RR] Start and     Limit registers. Bits at positions [0]--[7] grant Write/Erase permission to Permission Masters     numbered 0--7 respectively. */
  __IO  __SAFBC_READ03_bits_t          READ03;        /**< Offset: 0xC0 (R/W  32) This is Read03 register. Bits at positions [0]--[7] grant Read permission to Permission     Masters numbered 0--7 respectively. */
  __IO  __SAFBC_START04_bits_t         START04;       /**< Offset: 0xC4 (R/W  32) This is Start04 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5). */
  __IO  __SAFBC_LIMIT04_bits_t         LIMIT04;       /**< Offset: 0xC8 (R/W  32) This is Limit04 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5). */
  __IO  __SAFBC_WRITE04_bits_t         WRITE04;       /**< Offset: 0xCC (R/W  32) This is Write04 register. It applies to the region defined by the associated [RR] Start and     Limit registers. Bits at positions [0]--[7] grant Write/Erase permission to Permission Masters     numbered 0--7 respectively. */
  __IO  __SAFBC_READ04_bits_t          READ04;        /**< Offset: 0xD0 (R/W  32) This is Read04 register. Bits at positions [0]--[7] grant Read permission to Permission     Masters numbered 0--7 respectively. */
  __IO  __SAFBC_START05_bits_t         START05;       /**< Offset: 0xD4 (R/W  32) This is Start05 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5). */
  __IO  __SAFBC_LIMIT05_bits_t         LIMIT05;       /**< Offset: 0xD8 (R/W  32) This is Limit05 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5). */
  __IO  __SAFBC_WRITE05_bits_t         WRITE05;       /**< Offset: 0xDC (R/W  32) This is Write05 register. It applies to the region defined by the associated [RR] Start and     Limit registers. Bits at positions [0]--[7] grant Write/Erase permission to Permission Masters     numbered 0--7 respectively. */
  __IO  __SAFBC_READ05_bits_t          READ05;        /**< Offset: 0xE0 (R/W  32) This is Read05 register. Bits at positions [0]--[7] grant Read permission to Permission     Masters numbered 0--7 respectively. */
  __IO  __SAFBC_START06_bits_t         START06;       /**< Offset: 0xE4 (R/W  32) This is Start06 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5). */
  __IO  __SAFBC_LIMIT06_bits_t         LIMIT06;       /**< Offset: 0xE8 (R/W  32) This is Limit06 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5). */
  __IO  __SAFBC_WRITE06_bits_t         WRITE06;       /**< Offset: 0xEC (R/W  32) This is Write06 register. It applies to the region defined by the associated [RR] Start and     Limit registers. Bits at positions [0]--[7] grant Write/Erase permission to Permission Masters     numbered 0--7 respectively. */
  __IO  __SAFBC_READ06_bits_t          READ06;        /**< Offset: 0xF0 (R/W  32) This is Read06 register. Bits at positions [0]--[7] grant Read permission to Permission     Masters numbered 0--7 respectively. */
