ranjithaguna/pv/LED_Demo/source/pic32cx/component/safbc.h
  __IO  __SAFBC_START07_bits_t         START07;       /**< Offset: 0xF4 (R/W  32) This is Start07 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5). */
  __IO  __SAFBC_LIMIT07_bits_t         LIMIT07;       /**< Offset: 0xF8 (R/W  32) This is Limit07 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5). */
  __IO  __SAFBC_WRITE07_bits_t         WRITE07;       /**< Offset: 0xFC (R/W  32) This is Write07 register. It applies to the region defined by the associated [RR] Start and     Limit registers. Bits at positions [0]--[7] grant Write/Erase permission to Permission Masters     numbered 0--7 respectively. */
  __IO  __SAFBC_READ07_bits_t          READ07;        /**< Offset: 0x100 (R/W  32) This is Read07 register. Bits at positions [0]--[7] grant Read permission to Permission     Masters numbered 0--7 respectively. */
  __IO  __SAFBC_START08_bits_t         START08;       /**< Offset: 0x104 (R/W  32) This is Start08 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5). */
  __IO  __SAFBC_LIMIT08_bits_t         LIMIT08;       /**< Offset: 0x108 (R/W  32) This is Limit08 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5). */
  __IO  __SAFBC_WRITE08_bits_t         WRITE08;       /**< Offset: 0x10C (R/W  32) This is Write08 register. It applies to the region defined by the associated [RR] Start and     Limit registers. Bits at positions [0]--[7] grant Write/Erase permission to Permission Masters     numbered 0--7 respectively. */
  __IO  __SAFBC_READ08_bits_t          READ08;        /**< Offset: 0x110 (R/W  32) This is Read08 register. Bits at positions [0]--[7] grant Read permission to Permission     Masters numbered 0--7 respectively. */
  __IO  __SAFBC_START09_bits_t         START09;       /**< Offset: 0x114 (R/W  32) This is Start09 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5). */
  __IO  __SAFBC_LIMIT09_bits_t         LIMIT09;       /**< Offset: 0x118 (R/W  32) This is Limit09 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5). */
  __IO  __SAFBC_WRITE09_bits_t         WRITE09;       /**< Offset: 0x11C (R/W  32) This is Write09 register. It applies to the region defined by the associated [RR] Start and     Limit registers. Bits at positions [0]--[7] grant Write/Erase permission to Permission Masters     numbered 0--7 respectively. */
  __IO  __SAFBC_READ09_bits_t          READ09;        /**< Offset: 0x120 (R/W  32) This is Read09 register. Bits at positions [0]--[7] grant Read permission to Permission     Masters numbered 0--7 respectively. */
  __IO  __SAFBC_START10_bits_t         START10;       /**< Offset: 0x124 (R/W  32) This is Start10 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5). */
  __IO  __SAFBC_LIMIT10_bits_t         LIMIT10;       /**< Offset: 0x128 (R/W  32) This is Limit10 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5). */
  __IO  __SAFBC_WRITE10_bits_t         WRITE10;       /**< Offset: 0x12C (R/W  32) This is Write10 register. It applies to the region defined by the associated [RR] Start and     Limit registers. Bits at positions [0]--[7] grant Write/Erase permission to Permission Masters     numbered 0--7 respectively. */
  __IO  __SAFBC_READ10_bits_t          READ10;        /**< Offset: 0x130 (R/W  32) This is Read10 register. Bits at positions [0]--[7] grant Read permission to Permission     Masters numbered 0--7 respectively. */
  __IO  __SAFBC_START11_bits_t         START11;       /**< Offset: 0x134 (R/W  32) This is Start11 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5). */
  __IO  __SAFBC_LIMIT11_bits_t         LIMIT11;       /**< Offset: 0x138 (R/W  32) This is Limit11 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5). */
  __IO  __SAFBC_WRITE11_bits_t         WRITE11;       /**< Offset: 0x13C (R/W  32) This is Write11 register. It applies to the region defined by the associated [RR] Start and     Limit registers. Bits at positions [0]--[7] grant Write/Erase permission to Permission Masters     numbered 0--7 respectively. */
  __IO  __SAFBC_READ11_bits_t          READ11;        /**< Offset: 0x140 (R/W  32) This is Read11 register. Bits at positions [0]--[7] grant Read permission to Permission     Masters numbered 0--7 respectively. */
  __IO  __SAFBC_START12_bits_t         START12;       /**< Offset: 0x144 (R/W  32) This is Start12 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5). */
  __IO  __SAFBC_LIMIT12_bits_t         LIMIT12;       /**< Offset: 0x148 (R/W  32) This is Limit12 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5). */
  __IO  __SAFBC_WRITE12_bits_t         WRITE12;       /**< Offset: 0x14C (R/W  32) This is Write12 register. It applies to the region defined by the associated [RR] Start and     Limit registers. Bits at positions [0]--[7] grant Write/Erase permission to Permission Masters     numbered 0--7 respectively. */
  __IO  __SAFBC_READ12_bits_t          READ12;        /**< Offset: 0x150 (R/W  32) This is Read12 register. Bits at positions [0]--[7] grant Read permission to Permission     Masters numbered 0--7 respectively. */
  __IO  __SAFBC_START13_bits_t         START13;       /**< Offset: 0x154 (R/W  32) This is Start13 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5). */
  __IO  __SAFBC_LIMIT13_bits_t         LIMIT13;       /**< Offset: 0x158 (R/W  32) This is Limit13 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5). */
  __IO  __SAFBC_WRITE13_bits_t         WRITE13;       /**< Offset: 0x15C (R/W  32) This is Write13 register. It applies to the region defined by the associated [RR] Start and     Limit registers. Bits at positions [0]--[7] grant Write/Erase permission to Permission Masters     numbered 0--7 respectively. */
  __IO  __SAFBC_READ13_bits_t          READ13;        /**< Offset: 0x160 (R/W  32) This is Read13 register. Bits at positions [0]--[7] grant Read permission to Permission     Masters numbered 0--7 respectively. */
  __IO  __SAFBC_START14_bits_t         START14;       /**< Offset: 0x164 (R/W  32) This is Start14 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5). */
  __IO  __SAFBC_LIMIT14_bits_t         LIMIT14;       /**< Offset: 0x168 (R/W  32) This is Limit14 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5). */
  __IO  __SAFBC_WRITE14_bits_t         WRITE14;       /**< Offset: 0x16C (R/W  32) This is Write14 register. It applies to the region defined by the associated [RR] Start and     Limit registers. Bits at positions [0]--[7] grant Write/Erase permission to Permission Masters     numbered 0--7 respectively. */
  __IO  __SAFBC_READ14_bits_t          READ14;        /**< Offset: 0x170 (R/W  32) This is Read14 register. Bits at positions [0]--[7] grant Read permission to Permission     Masters numbered 0--7 respectively. */
  __IO  __SAFBC_START15_bits_t         START15;       /**< Offset: 0x174 (R/W  32) This is Start15 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5). */
  __IO  __SAFBC_LIMIT15_bits_t         LIMIT15;       /**< Offset: 0x178 (R/W  32) This is Limit15 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5). */
  __IO  __SAFBC_WRITE15_bits_t         WRITE15;       /**< Offset: 0x17C (R/W  32) This is Write15 register. It applies to the region defined by the associated [RR] Start and     Limit registers. Bits at positions [0]--[7] grant Write/Erase permission to Permission Masters     numbered 0--7 respectively. */
  __IO  __SAFBC_READ15_bits_t          READ15;        /**< Offset: 0x180 (R/W  32) This is Read15 register. Bits at positions [0]--[7] grant Read permission to Permission     Masters numbered 0--7 respectively. */
  __IO  __SAFBC_START16_bits_t         START16;       /**< Offset: 0x184 (R/W  32) This is Start16 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5). */
  __IO  __SAFBC_LIMIT16_bits_t         LIMIT16;       /**< Offset: 0x188 (R/W  32) This is Limit16 register. Unless the Start register is less than or equal to the Limit register,     the associated register set [RR] is Disabled, and has no effect on permissions.     The default state of these registers, in all of the register sets, is this Disabled state. While all     register sets remain Disabled, no Protection Master except Master #0 (PCH HW) will be able to perform     any Flash access anywhere through SAFS operations, and this restriction includes the EC firmware (as     Master #5). */
  __IO  __SAFBC_WRITE16_bits_t         WRITE16;       /**< Offset: 0x18C (R/W  32) This is Write16 register. It applies to the region defined by the associated [RR] Start and     Limit registers. Bits at positions [0]--[7] grant Write/Erase permission to Permission Masters     numbered 0--7 respectively. */
  __IO  __SAFBC_READ16_bits_t          READ16;        /**< Offset: 0x190 (R/W  32) This is Read16 register. Bits at positions [0]--[7] grant Read permission to Permission     Masters numbered 0--7 respectively. */
  __IO  __SAFBC_POLL_TOUT_bits_t       POLL_TOUT;     /**< Offset: 0x194 (R/W  32) This is an error timeout value imposed on any consecutive series of Poll-1 commands to a     Flash. The timeout counter starts whenever any new Poll-1 sequence starts, and stops when a     Poll-1 detects Not-BUSY status from the Flash. */
  __IO  __SAFBC_POLL_INTERVAL_bits_t   POLL_INTERVAL; /**< Offset: 0x198 (R/W  32) This register should be kept zero except for diagnostic purposes. Where needed, it can be set     to provide spacing between consecutive Poll-1 operations to limit the amount of traffic. */
  __IO  __SAFBC_TIMEOUT_RESUSP_bits_t  TIMEOUT_RESUSP; /**< Offset: 0x19C (R/W  32) The value placed in this register provides necessary programmable support to a Flash that is     performing an Erase or a Program operation.  When an Erase or Program is started or Resumed, a     Suspend is held off until this time expires.  While an Erase or Program is in process but     Suspended, a Resume is forced when this time expires, even if Read requests are still pending,     causing the Erase or Program operation to continue, and again inhibiting the next Suspend until     it expires again. */
  __IO  __SAFBC_TIMEOUT_RD_SUSP_bits_t TIMEOUT_RD_SUSP; /**< Offset: 0x1A0 (R/W  32) This register is used to detect when a series of Read transfers has finished. When this time     expires without any new Read request, any suspended Erase or Program operation is given the     Resume command to continue. */
  __IO  __SAFBC_CS_POLL2_MSK_bits_t    CS_POLL2_MSK;  /**< Offset: 0x1A4 (R/W  32) Upon issuing a Suspend command, a Poll-1 operation is repeated until the Flash is no longer     BUSY, then a Poll-2 operation to determine whether the Flash device is in a Suspended state. */
  __IO  __SAFBC_TESTREG_CTRL0_bits_t   TESTREG_CTRL0; /**< Offset: 0x1A8 (R/W  32) This register provides special mode control. */
  __IO  __SAFBC_TIMOUTDLY_SUSPCHK_bits_t TIMOUTDLY_SUSPCHK; /**< Offset: 0x1AC (R/W  32) This register provides a time delay for support of some Flash devices. It holds off the     first Poll-1 check after a Suspend command has been given to the Flash. */
  __IO  __SAFBC_TESTREG_CTRL1_bits_t   TESTREG_CTRL1; /**< Offset: 0x1B0 (R/W  32) Micron requires a prefix consisting of two command frames (in separate CS# assertions) to     be sent before Mode information will be recognized to enter Continuous Read mode. This     technique is called (Micron XIP) in their datasheets.  The support for these chips requires     setting up this register and setting the corresponding Prefix Enable bit(s) to enable this     handling.  The first command frame of the Prefix sequence will be a single byte consisting of     the Write Enable opcode, taken from the OP_WE opcode field of the appropriate Opcode A register     (Section 7.3.5, on page 113).  The second command frame of the Prefix sequence comes from this     register, consisting of first the PREFIX_OP byte for the corresponding Flash device (CS0/CS1),     and then its PREFIX_DAT byte.  The PREFIX_OP byte will be 81h always, which is documented as     the Micron opcode (WRITE VOLATILE CONFIGURATION REGISTER) The PREFIX_DAT byte contains the data     written to the Micron Flash device's Volatile Configuration Register. It has potential     side-effects beyond just enabling Micron XIP Mode, so it must be constructed very carefully. */
} safbc_registers_t;
/** @}  end of SAF BRIDGE COMPONENT */

#endif /* _PIC32CX_0525SG12_SAFBC_COMPONENT_H_ */
